NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ENABLE @Bits 0..1 : Enable or disable AAR */
  #define AAR_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define AAR_ENABLE_ENABLE_Msk (0x3UL << AAR_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Max (0x3UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define AAR_ENABLE_ENABLE_Enabled (0x3UL)          /*!< Enable                                                               */


/* AAR_MAXRESOLVED: Maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_ResetValue (0x00000001UL)  /*!< Reset value of MAXRESOLVED register.                                 */

/* MAXRESOLVED @Bits 0..11 : The maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Pos (0UL)      /*!< Position of MAXRESOLVED field.                                       */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Msk (0xFFFUL << AAR_MAXRESOLVED_MAXRESOLVED_Pos) /*!< Bit mask of MAXRESOLVED field.     */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Min (0x001UL)  /*!< Min value of MAXRESOLVED field.                                      */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Max (0xFFFUL)  /*!< Max size of MAXRESOLVED field.                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          ANTSWC                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct ANTSWC_ERRORSTATUS ================================================ */
/**
  * @brief ERRORSTATUS [ANTSWC_ERRORSTATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TX;                                /*!< (@ 0x00000000) Concurrent TX error condition                         */
  __IOM uint32_t  TXRX;                              /*!< (@ 0x00000004) Concurrent TX-RX error condition                      */
  __IOM uint32_t  ERRORPORT;                         /*!< (@ 0x00000008) Indicates which ports are in error                    */
} NRF_ANTSWC_ERRORSTATUS_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* ANTSWC_ERRORSTATUS_TX: Concurrent TX error condition */
  #define ANTSWC_ERRORSTATUS_TX_ResetValue (0x00000000UL) /*!< Reset value of TX register.                                     */

/* COUNT @Bits 0..3 : Count of concurrent TX error conditions detected */
  #define ANTSWC_ERRORSTATUS_TX_COUNT_Pos (0UL)      /*!< Position of COUNT field.                                             */
  #define ANTSWC_ERRORSTATUS_TX_COUNT_Msk (0xFUL << ANTSWC_ERRORSTATUS_TX_COUNT_Pos) /*!< Bit mask of COUNT field.             */

/* ERRORACTIVE @Bit 31 : Concurrent TX error condition is active */
  #define ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Pos (31UL) /*!< Position of ERRORACTIVE field.                                     */
  #define ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Msk (0x1UL << ANTSWC_ERRORSTATUS_TX_ERRORACTIVE_Pos) /*!< Bit mask of ERRORACTIVE
                                                                            field.*/


/* ANTSWC_ERRORSTATUS_TXRX: Concurrent TX-RX error condition */
  #define ANTSWC_ERRORSTATUS_TXRX_ResetValue (0x00000000UL) /*!< Reset value of TXRX register.                                 */

/* COUNT @Bits 0..3 : Count of concurrent TX-RX error conditions detected */
  #define ANTSWC_ERRORSTATUS_TXRX_COUNT_Pos (0UL)    /*!< Position of COUNT field.                                             */
  #define ANTSWC_ERRORSTATUS_TXRX_COUNT_Msk (0xFUL << ANTSWC_ERRORSTATUS_TXRX_COUNT_Pos) /*!< Bit mask of COUNT field.         */

/* ERRORACTIVE @Bit 31 : Concurrent TX-RX error condition is active */
  #define ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Pos (31UL) /*!< Position of ERRORACTIVE field.                                   */
  #define ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Msk (0x1UL << ANTSWC_ERRORSTATUS_TXRX_ERRORACTIVE_Pos) /*!< Bit mask of
                                                                            ERRORACTIVE field.*/


/* ANTSWC_ERRORSTATUS_ERRORPORT: Indicates which ports are in error */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ResetValue (0x00000000UL) /*!< Reset value of ERRORPORT register.                       */

/* ERRORPORT @Bits 0..7 : Bitfield indicating the ports in error during the last error condition. */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Pos (0UL) /*!< Position of ERRORPORT field.                                   */
  #define ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Msk (0xFFUL << ANTSWC_ERRORSTATUS_ERRORPORT_ERRORPORT_Pos) /*!< Bit mask of
                                                                            ERRORPORT field.*/


/* ====================================================== Struct ANTSWC ====================================================== */
/**
  * @brief Antenna switch controller
  */
  typedef struct {                                   /*!< ANTSWC Structure                                                     */
    __IM uint32_t RESERVED[256];
    __IOM NRF_ANTSWC_ERRORSTATUS_Type ERRORSTATUS;   /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED1;
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000410) Antenna switch controller enable / software reset     */
    __IOM uint32_t INHIBIT;                          /*!< (@ 0x00000414) Inhibit register                                      */
  } NRF_ANTSWC_Type;                                 /*!< Size = 1048 (0x418)                                                  */

/* ANTSWC_CONFIG: Antenna switch controller enable / software reset */
  #define ANTSWC_CONFIG_ResetValue (0x00000000UL)    /*!< Reset value of CONFIG register.                                      */

/* ENABLEPKTACTIVE0 @Bit 0 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Pos (0UL)   /*!< Position of ENABLEPKTACTIVE0 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE0_Pos) /*!< Bit mask of ENABLEPKTACTIVE0
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE0 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE0 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE0_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE1 @Bit 1 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Pos (1UL)   /*!< Position of ENABLEPKTACTIVE1 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE1_Pos) /*!< Bit mask of ENABLEPKTACTIVE1
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE1 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE1 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE1_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE2 @Bit 2 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Pos (2UL)   /*!< Position of ENABLEPKTACTIVE2 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE2_Pos) /*!< Bit mask of ENABLEPKTACTIVE2
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE2 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE2 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE2_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE3 @Bit 3 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Pos (3UL)   /*!< Position of ENABLEPKTACTIVE3 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE3_Pos) /*!< Bit mask of ENABLEPKTACTIVE3
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE3 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE3 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE3_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE4 @Bit 4 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Pos (4UL)   /*!< Position of ENABLEPKTACTIVE4 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE4_Pos) /*!< Bit mask of ENABLEPKTACTIVE4
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE4 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE4 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE4_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

