NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ENABLEPKTACTIVE5 @Bit 5 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Pos (5UL)   /*!< Position of ENABLEPKTACTIVE5 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE5_Pos) /*!< Bit mask of ENABLEPKTACTIVE5
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE5 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE5 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE5_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE6 @Bit 6 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Pos (6UL)   /*!< Position of ENABLEPKTACTIVE6 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE6_Pos) /*!< Bit mask of ENABLEPKTACTIVE6
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE6 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE6 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE6_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLEPKTACTIVE7 @Bit 7 : Bitfield indicating whether ANTSWC listens to PktActive on radio port i. */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Pos (7UL)   /*!< Position of ENABLEPKTACTIVE7 field.                                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Msk (0x1UL << ANTSWC_CONFIG_ENABLEPKTACTIVE7_Pos) /*!< Bit mask of ENABLEPKTACTIVE7
                                                                            field.*/
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Min (0x0UL) /*!< Min enumerator value of ENABLEPKTACTIVE7 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Max (0x1UL) /*!< Max enumerator value of ENABLEPKTACTIVE7 field.                      */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Ignore (0x0UL) /*!< Ignore PktActive on the corresponding radio port                  */
  #define ANTSWC_CONFIG_ENABLEPKTACTIVE7_Respect (0x1UL) /*!< Use PktActive on the corresponding radio port for antenna switch
                                                              selection*/

/* ENABLE @Bit 31 : Enable antenna switch module. */
  #define ANTSWC_CONFIG_ENABLE_Pos (31UL)            /*!< Position of ENABLE field.                                            */
  #define ANTSWC_CONFIG_ENABLE_Msk (0x1UL << ANTSWC_CONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */
  #define ANTSWC_CONFIG_ENABLE_Min (0x0UL)           /*!< Min enumerator value of ENABLE field.                                */
  #define ANTSWC_CONFIG_ENABLE_Max (0x1UL)           /*!< Max enumerator value of ENABLE field.                                */
  #define ANTSWC_CONFIG_ENABLE_Disable (0x0UL)       /*!< Antenna Switch Controller disabled - all outputs held low            */
  #define ANTSWC_CONFIG_ENABLE_Enable (0x1UL)        /*!< Antenna Switch Controller enabled                                    */


/* ANTSWC_INHIBIT: Inhibit register */
  #define ANTSWC_INHIBIT_ResetValue (0x000000FFUL)   /*!< Reset value of INHIBIT register.                                     */

/* INHIBIT0 @Bit 0 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT0_Pos (0UL)          /*!< Position of INHIBIT0 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT0_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT0_Pos) /*!< Bit mask of INHIBIT0 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT0_Min (0x0UL)        /*!< Min enumerator value of INHIBIT0 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT0_Max (0x1UL)        /*!< Max enumerator value of INHIBIT0 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT0_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT0_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT1 @Bit 1 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT1_Pos (1UL)          /*!< Position of INHIBIT1 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT1_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT1_Pos) /*!< Bit mask of INHIBIT1 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT1_Min (0x0UL)        /*!< Min enumerator value of INHIBIT1 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT1_Max (0x1UL)        /*!< Max enumerator value of INHIBIT1 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT1_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT1_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT2 @Bit 2 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT2_Pos (2UL)          /*!< Position of INHIBIT2 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT2_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT2_Pos) /*!< Bit mask of INHIBIT2 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT2_Min (0x0UL)        /*!< Min enumerator value of INHIBIT2 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT2_Max (0x1UL)        /*!< Max enumerator value of INHIBIT2 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT2_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT2_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT3 @Bit 3 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT3_Pos (3UL)          /*!< Position of INHIBIT3 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT3_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT3_Pos) /*!< Bit mask of INHIBIT3 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT3_Min (0x0UL)        /*!< Min enumerator value of INHIBIT3 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT3_Max (0x1UL)        /*!< Max enumerator value of INHIBIT3 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT3_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT3_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT4 @Bit 4 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

