NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
  #define ANTSWC_INHIBIT_INHIBIT4_Pos (4UL)          /*!< Position of INHIBIT4 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT4_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT4_Pos) /*!< Bit mask of INHIBIT4 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT4_Min (0x0UL)        /*!< Min enumerator value of INHIBIT4 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT4_Max (0x1UL)        /*!< Max enumerator value of INHIBIT4 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT4_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT4_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT5 @Bit 5 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT5_Pos (5UL)          /*!< Position of INHIBIT5 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT5_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT5_Pos) /*!< Bit mask of INHIBIT5 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT5_Min (0x0UL)        /*!< Min enumerator value of INHIBIT5 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT5_Max (0x1UL)        /*!< Max enumerator value of INHIBIT5 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT5_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT5_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT6 @Bit 6 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT6_Pos (6UL)          /*!< Position of INHIBIT6 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT6_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT6_Pos) /*!< Bit mask of INHIBIT6 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT6_Min (0x0UL)        /*!< Min enumerator value of INHIBIT6 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT6_Max (0x1UL)        /*!< Max enumerator value of INHIBIT6 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT6_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT6_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */

/* INHIBIT7 @Bit 7 : Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is
                     enabled or inhibited. */

  #define ANTSWC_INHIBIT_INHIBIT7_Pos (7UL)          /*!< Position of INHIBIT7 field.                                          */
  #define ANTSWC_INHIBIT_INHIBIT7_Msk (0x1UL << ANTSWC_INHIBIT_INHIBIT7_Pos) /*!< Bit mask of INHIBIT7 field.                  */
  #define ANTSWC_INHIBIT_INHIBIT7_Min (0x0UL)        /*!< Min enumerator value of INHIBIT7 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT7_Max (0x1UL)        /*!< Max enumerator value of INHIBIT7 field.                              */
  #define ANTSWC_INHIBIT_INHIBIT7_Inhibit (0x0UL)    /*!< Inhibit connection of antenna to the corresponding radio             */
  #define ANTSWC_INHIBIT_INHIBIT7_Enable (0x1UL)     /*!< Enable antenna to be connected to the corresponding radio            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          AUXPLL                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct AUXPLL_CONFIG =================================================== */
/**
  * @brief CONFIG [AUXPLL_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;                         /*!< (@ 0x00000000) AUXPLL configuration                                  */
} NRF_AUXPLL_CONFIG_Type;                            /*!< Size = 4 (0x004)                                                     */

/* AUXPLL_CONFIG_CFGSTATIC: AUXPLL configuration */
  #define AUXPLL_CONFIG_CFGSTATIC_ResetValue (0x00000224UL) /*!< Reset value of CFGSTATIC register.                            */

/* OUTDRIVE @Bits 0..1 : Output buffer drive strength selection */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos (0UL) /*!< Position of OUTDRIVE field.                                          */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos) /*!< Bit mask of OUTDRIVE field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Min (0x0UL) /*!< Lowest drive strength                                              */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Max (0x3UL) /*!< Highest drive strength                                             */

/* SELCONSTANTI @Bits 2..6 : Constant current tune for ring oscillator */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos (2UL) /*!< Position of SELCONSTANTI field.                                  */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Msk (0x1FUL << AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos) /*!< Bit mask of
                                                                            SELCONSTANTI field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Min (0x00UL) /*!< Minimum current                                               */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Default (0x09UL) /*!< Default current for audio and USB                         */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Max (0x0FUL) /*!< Maximum current                                               */

/* SDMOFF @Bit 7 : Turn off sigma delta modulation */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos (7UL)   /*!< Position of SDMOFF field.                                            */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos) /*!< Bit mask of SDMOFF field.      */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Min (0x0UL) /*!< Min enumerator value of SDMOFF field.                                */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Max (0x1UL) /*!< Max enumerator value of SDMOFF field.                                */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOn (0x0UL) /*!< Sigma Delta Modulator enabled                                      */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOff (0x1UL) /*!< Sigma Delta Modulator disabled                                    */

/* SDMDITHEROFF @Bit 8 : Turn off dither in sigma delta modulator */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos (8UL) /*!< Position of SDMDITHEROFF field.                                  */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos) /*!< Bit mask of
                                                                            SDMDITHEROFF field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Min (0x0UL) /*!< Min enumerator value of SDMDITHEROFF field.                    */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Max (0x1UL) /*!< Max enumerator value of SDMDITHEROFF field.                    */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOn (0x0UL) /*!< Dither enabled                                            */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOff (0x1UL) /*!< Dither disabled                                          */

/* AUXPLLRANGE @Bits 9..10 : Loop divider base settings */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos (9UL) /*!< Position of AUXPLLRANGE field.                                    */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos) /*!< Bit mask of
                                                                            AUXPLLRANGE field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Min (0x0UL) /*!< Min enumerator value of AUXPLLRANGE field.                      */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Max (0x3UL) /*!< Max enumerator value of AUXPLLRANGE field.                      */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Low (0x0UL) /*!< Low range divider setting                                       */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Mid (0x1UL) /*!< Mid range divider setting                                       */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_High (0x2UL) /*!< High range divider setting                                     */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_StaticHigh (0x3UL) /*!< Maximum static divider setting                           */



/* =================================================== Struct AUXPLL_TRIM ==================================================== */
/**
  * @brief TRIM [AUXPLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTUNE;                             /*!< (@ 0x00000000) Ring oscillator core process corner tuning            */
} NRF_AUXPLL_TRIM_Type;                              /*!< Size = 4 (0x004)                                                     */

/* AUXPLL_TRIM_CTUNE: Ring oscillator core process corner tuning */
  #define AUXPLL_TRIM_CTUNE_ResetValue (0x0000000DUL) /*!< Reset value of CTUNE register.                                      */

