NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* BELLBOARD_EVENTS_TRIGGERED: Event TRIGGERED[n] */
  #define BELLBOARD_EVENTS_TRIGGERED_MaxCount (4UL)  /*!< Max size of EVENTS_TRIGGERED[4] array.                               */
  #define BELLBOARD_EVENTS_TRIGGERED_MaxIndex (3UL)  /*!< Max index of EVENTS_TRIGGERED[4] array.                              */
  #define BELLBOARD_EVENTS_TRIGGERED_MinIndex (0UL)  /*!< Min index of EVENTS_TRIGGERED[4] array.                              */
  #define BELLBOARD_EVENTS_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIGGERED[4] register.               */

/* EVENTS_TRIGGERED @Bit 0 : Event TRIGGERED[n] */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL) /*!< Position of EVENTS_TRIGGERED field.                       */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit
                                                                            mask of EVENTS_TRIGGERED field.*/
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIGGERED field.         */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIGGERED field.         */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL) /*!< Event generated                                   */


/* BELLBOARD_INTEN0: Enable or disable interrupt */
  #define BELLBOARD_INTEN0_ResetValue (0x00000000UL) /*!< Reset value of INTEN0 register.                                      */

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTEN0_TRIGGERED0_Pos (0UL)      /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTEN0_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTEN0_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.        */
  #define BELLBOARD_INTEN0_TRIGGERED0_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED0_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED0_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN0_TRIGGERED0_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTEN0_TRIGGERED1_Pos (1UL)      /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTEN0_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTEN0_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.        */
  #define BELLBOARD_INTEN0_TRIGGERED1_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED1_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED1_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN0_TRIGGERED1_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTEN0_TRIGGERED2_Pos (2UL)      /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTEN0_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTEN0_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.        */
  #define BELLBOARD_INTEN0_TRIGGERED2_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED2_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED2_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN0_TRIGGERED2_Enabled (0x1UL) /*!< Enable                                                              */

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTEN0_TRIGGERED3_Pos (3UL)      /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTEN0_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTEN0_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.        */
  #define BELLBOARD_INTEN0_TRIGGERED3_Min (0x0UL)    /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED3_Max (0x1UL)    /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTEN0_TRIGGERED3_Disabled (0x0UL) /*!< Disable                                                            */
  #define BELLBOARD_INTEN0_TRIGGERED3_Enabled (0x1UL) /*!< Enable                                                              */


/* BELLBOARD_INTENSET0: Enable interrupt */
  #define BELLBOARD_INTENSET0_ResetValue (0x00000000UL) /*!< Reset value of INTENSET0 register.                                */

/* TRIGGERED0 @Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Pos (0UL)   /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.  */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Min (0x0UL) /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Max (0x1UL) /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET0_TRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED1 @Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Pos (1UL)   /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.  */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Min (0x0UL) /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Max (0x1UL) /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET0_TRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED2 @Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Pos (2UL)   /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.  */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Min (0x0UL) /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Max (0x1UL) /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET0_TRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED3 @Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Pos (3UL)   /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENSET0_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.  */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Min (0x0UL) /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Max (0x1UL) /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Set (0x1UL) /*!< Enable                                                               */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENSET0_TRIGGERED3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


