NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* XOSTARTED @Bit 0 : Enable or disable interrupt for event XOSTARTED */
  #define CLOCK_INTEN_XOSTARTED_Pos (0UL)            /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTEN_XOSTARTED_Msk (0x1UL << CLOCK_INTEN_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.                     */
  #define CLOCK_INTEN_XOSTARTED_Min (0x0UL)          /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTEN_XOSTARTED_Max (0x1UL)          /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTEN_XOSTARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define CLOCK_INTEN_XOSTARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* PLLSTARTED @Bit 1 : Enable or disable interrupt for event PLLSTARTED */
  #define CLOCK_INTEN_PLLSTARTED_Pos (1UL)           /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTEN_PLLSTARTED_Msk (0x1UL << CLOCK_INTEN_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.                  */
  #define CLOCK_INTEN_PLLSTARTED_Min (0x0UL)         /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTEN_PLLSTARTED_Max (0x1UL)         /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTEN_PLLSTARTED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define CLOCK_INTEN_PLLSTARTED_Enabled (0x1UL)     /*!< Enable                                                               */

/* LFCLKSTARTED @Bit 2 : Enable or disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTEN_LFCLKSTARTED_Pos (2UL)         /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTEN_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.            */
  #define CLOCK_INTEN_LFCLKSTARTED_Min (0x0UL)       /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Max (0x1UL)       /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_LFCLKSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* XO24MSTARTED @Bit 7 : Enable or disable interrupt for event XO24MSTARTED */
  #define CLOCK_INTEN_XO24MSTARTED_Pos (7UL)         /*!< Position of XO24MSTARTED field.                                      */
  #define CLOCK_INTEN_XO24MSTARTED_Msk (0x1UL << CLOCK_INTEN_XO24MSTARTED_Pos) /*!< Bit mask of XO24MSTARTED field.            */
  #define CLOCK_INTEN_XO24MSTARTED_Min (0x0UL)       /*!< Min enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTEN_XO24MSTARTED_Max (0x1UL)       /*!< Max enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTEN_XO24MSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_XO24MSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* AUXPLLSTARTED @Bit 8 : Enable or disable interrupt for event AUXPLLSTARTED */
  #define CLOCK_INTEN_AUXPLLSTARTED_Pos (8UL)        /*!< Position of AUXPLLSTARTED field.                                     */
  #define CLOCK_INTEN_AUXPLLSTARTED_Msk (0x1UL << CLOCK_INTEN_AUXPLLSTARTED_Pos) /*!< Bit mask of AUXPLLSTARTED field.         */
  #define CLOCK_INTEN_AUXPLLSTARTED_Min (0x0UL)      /*!< Min enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTEN_AUXPLLSTARTED_Max (0x1UL)      /*!< Max enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTEN_AUXPLLSTARTED_Disabled (0x0UL) /*!< Disable                                                              */
  #define CLOCK_INTEN_AUXPLLSTARTED_Enabled (0x1UL)  /*!< Enable                                                               */


/* CLOCK_INTENSET: Enable interrupt */
  #define CLOCK_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* XOSTARTED @Bit 0 : Write '1' to enable interrupt for event XOSTARTED */
  #define CLOCK_INTENSET_XOSTARTED_Pos (0UL)         /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTENSET_XOSTARTED_Msk (0x1UL << CLOCK_INTENSET_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.               */
  #define CLOCK_INTENSET_XOSTARTED_Min (0x0UL)       /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENSET_XOSTARTED_Max (0x1UL)       /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENSET_XOSTARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define CLOCK_INTENSET_XOSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_XOSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PLLSTARTED @Bit 1 : Write '1' to enable interrupt for event PLLSTARTED */
  #define CLOCK_INTENSET_PLLSTARTED_Pos (1UL)        /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTENSET_PLLSTARTED_Msk (0x1UL << CLOCK_INTENSET_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.            */
  #define CLOCK_INTENSET_PLLSTARTED_Min (0x0UL)      /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENSET_PLLSTARTED_Max (0x1UL)      /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENSET_PLLSTARTED_Set (0x1UL)      /*!< Enable                                                               */
  #define CLOCK_INTENSET_PLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_PLLSTARTED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LFCLKSTARTED @Bit 2 : Write '1' to enable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENSET_LFCLKSTARTED_Pos (2UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define CLOCK_INTENSET_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENSET_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* XO24MSTARTED @Bit 7 : Write '1' to enable interrupt for event XO24MSTARTED */
  #define CLOCK_INTENSET_XO24MSTARTED_Pos (7UL)      /*!< Position of XO24MSTARTED field.                                      */
  #define CLOCK_INTENSET_XO24MSTARTED_Msk (0x1UL << CLOCK_INTENSET_XO24MSTARTED_Pos) /*!< Bit mask of XO24MSTARTED field.      */
  #define CLOCK_INTENSET_XO24MSTARTED_Min (0x0UL)    /*!< Min enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTENSET_XO24MSTARTED_Max (0x1UL)    /*!< Max enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTENSET_XO24MSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define CLOCK_INTENSET_XO24MSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENSET_XO24MSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

