NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* CH20 @Bit 20 : Include or exclude channel 20 */
  #define DPPIC_CHG_CH20_Pos (20UL)                  /*!< Position of CH20 field.                                              */
  #define DPPIC_CHG_CH20_Msk (0x1UL << DPPIC_CHG_CH20_Pos) /*!< Bit mask of CH20 field.                                        */
  #define DPPIC_CHG_CH20_Min (0x0UL)                 /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Max (0x1UL)                 /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH20_Included (0x1UL)            /*!< Include                                                              */

/* CH21 @Bit 21 : Include or exclude channel 21 */
  #define DPPIC_CHG_CH21_Pos (21UL)                  /*!< Position of CH21 field.                                              */
  #define DPPIC_CHG_CH21_Msk (0x1UL << DPPIC_CHG_CH21_Pos) /*!< Bit mask of CH21 field.                                        */
  #define DPPIC_CHG_CH21_Min (0x0UL)                 /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Max (0x1UL)                 /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH21_Included (0x1UL)            /*!< Include                                                              */

/* CH22 @Bit 22 : Include or exclude channel 22 */
  #define DPPIC_CHG_CH22_Pos (22UL)                  /*!< Position of CH22 field.                                              */
  #define DPPIC_CHG_CH22_Msk (0x1UL << DPPIC_CHG_CH22_Pos) /*!< Bit mask of CH22 field.                                        */
  #define DPPIC_CHG_CH22_Min (0x0UL)                 /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Max (0x1UL)                 /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH22_Included (0x1UL)            /*!< Include                                                              */

/* CH23 @Bit 23 : Include or exclude channel 23 */
  #define DPPIC_CHG_CH23_Pos (23UL)                  /*!< Position of CH23 field.                                              */
  #define DPPIC_CHG_CH23_Msk (0x1UL << DPPIC_CHG_CH23_Pos) /*!< Bit mask of CH23 field.                                        */
  #define DPPIC_CHG_CH23_Min (0x0UL)                 /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Max (0x1UL)                 /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH23_Included (0x1UL)            /*!< Include                                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct ECB_KEY ====================================================== */
/**
  * @brief KEY [ECB_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];                          /*!< (@ 0x00000000) 128-bit AES key                                       */
} NRF_ECB_KEY_Type;                                  /*!< Size = 16 (0x010)                                                    */

/* ECB_KEY_VALUE: 128-bit AES key */
  #define ECB_KEY_VALUE_MaxCount (4UL)               /*!< Max size of VALUE[4] array.                                          */
  #define ECB_KEY_VALUE_MaxIndex (3UL)               /*!< Max index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_MinIndex (0UL)               /*!< Min index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_ResetValue (0x00000000UL)    /*!< Reset value of VALUE[4] register.                                    */

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(n+1))-1 : (32*n) */
  #define ECB_KEY_VALUE_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define ECB_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << ECB_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* ====================================================== Struct ECB_IN ====================================================== */
/**
  * @brief IN [ECB_IN] IN EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Input pointer                                         */
} NRF_ECB_IN_Type;                                   /*!< Size = 4 (0x004)                                                     */

/* ECB_IN_PTR: Input pointer */
  #define ECB_IN_PTR_ResetValue (0x00000000UL)       /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Points to a job list containing unencrypted ECB data structure */
  #define ECB_IN_PTR_PTR_Pos (0UL)                   /*!< Position of PTR field.                                               */
  #define ECB_IN_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_IN_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                  */



