NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* DSTALL @Bit 9 : Data stall bit. Controls if a trace unit can stall the PE when the data trace buffer space is less than
                   LEVEL. */

  #define ETM_TRCSTALLCTLR_DSTALL_Pos (9UL)          /*!< Position of DSTALL field.                                            */
  #define ETM_TRCSTALLCTLR_DSTALL_Msk (0x1UL << ETM_TRCSTALLCTLR_DSTALL_Pos) /*!< Bit mask of DSTALL field.                    */
  #define ETM_TRCSTALLCTLR_DSTALL_Min (0x0UL)        /*!< Min enumerator value of DSTALL field.                                */
  #define ETM_TRCSTALLCTLR_DSTALL_Max (0x1UL)        /*!< Max enumerator value of DSTALL field.                                */
  #define ETM_TRCSTALLCTLR_DSTALL_Disabled (0x0UL)   /*!< The trace unit must not stall the PE.                                */
  #define ETM_TRCSTALLCTLR_DSTALL_Enabled (0x1UL)    /*!< The trace unit can stall the PE.                                     */

/* INSTPRIORITY @Bit 10 : Prioritize instruction trace bit. Controls if a trace unit can prioritize instruction trace when the
                          instruction trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Pos (10UL)   /*!< Position of INSTPRIORITY field.                                      */
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Msk (0x1UL << ETM_TRCSTALLCTLR_INSTPRIORITY_Pos) /*!< Bit mask of INSTPRIORITY field.  */
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Min (0x0UL)  /*!< Min enumerator value of INSTPRIORITY field.                          */
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Max (0x1UL)  /*!< Max enumerator value of INSTPRIORITY field.                          */
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Disabled (0x0UL) /*!< The trace unit must not prioritize instruction trace.            */
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Enabled (0x1UL) /*!< The trace unit can prioritize instruction trace. A trace unit might
                                                             prioritize instruction trace by preventing output of data trace, or
                                                             other means which ensure that the instruction trace has a higher
                                                             priority than the data trace.*/

/* DATADISCARDLOAD @Bit 11 : Data discard field. Controls if a trace unit can discard data trace elements on a load when the
                             data trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Pos (11UL) /*!< Position of DATADISCARDLOAD field.                                  */
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Msk (0x1UL << ETM_TRCSTALLCTLR_DATADISCARDLOAD_Pos) /*!< Bit mask of DATADISCARDLOAD
                                                                            field.*/
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Min (0x0UL) /*!< Min enumerator value of DATADISCARDLOAD field.                     */
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Max (0x1UL) /*!< Max enumerator value of DATADISCARDLOAD field.                     */
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Disabled (0x0UL) /*!< The trace unit must not discard any data trace elements.      */
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Enabled (0x1UL) /*!< The trace unit can discard P1 and P2 elements associated with
                                                                data loads.*/

/* DATADISCARDSTORE @Bit 12 : Data discard field. Controls if a trace unit can discard data trace elements on a store when the
                              data trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Pos (12UL) /*!< Position of DATADISCARDSTORE field.                                */
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Msk (0x1UL << ETM_TRCSTALLCTLR_DATADISCARDSTORE_Pos) /*!< Bit mask of
                                                                            DATADISCARDSTORE field.*/
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Min (0x0UL) /*!< Min enumerator value of DATADISCARDSTORE field.                   */
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Max (0x1UL) /*!< Max enumerator value of DATADISCARDSTORE field.                   */
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Disabled (0x0UL) /*!< The trace unit must not discard any data trace elements.     */
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Enabled (0x1UL) /*!< The trace unit can discard P1 and P2 elements associated with
                                                                 data stores.*/

/* NOOVERFLOW @Bit 13 : Trace overflow prevention bit. */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Pos (13UL)     /*!< Position of NOOVERFLOW field.                                        */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Msk (0x1UL << ETM_TRCSTALLCTLR_NOOVERFLOW_Pos) /*!< Bit mask of NOOVERFLOW field.        */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Min (0x0UL)    /*!< Min enumerator value of NOOVERFLOW field.                            */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Max (0x1UL)    /*!< Max enumerator value of NOOVERFLOW field.                            */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Disabled (0x0UL) /*!< Trace overflow prevention is disabled.                             */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Enabled (0x1UL) /*!< Trace overflow prevention is enabled. This might cause a significant
                                                           performance impact.*/


/* ETM_TRCTSCTLR: Controls the insertion of global timestamps in the trace streams. When the selected event is triggered, the
                   trace unit inserts a global timestamp into the trace streams. Might ignore writes when the trace unit is
                   enabled or not idle. Must be programmed if TRCCONFIGR.TS == 1. */

  #define ETM_TRCTSCTLR_ResetValue (0x00000000UL)    /*!< Reset value of TRCTSCTLR register.                                   */

/* EVENT @Bits 0..7 : Select which event should generate time stamps. */
  #define ETM_TRCTSCTLR_EVENT_Pos (0UL)              /*!< Position of EVENT field.                                             */
  #define ETM_TRCTSCTLR_EVENT_Msk (0xFFUL << ETM_TRCTSCTLR_EVENT_Pos) /*!< Bit mask of EVENT field.                            */
  #define ETM_TRCTSCTLR_EVENT_Min (0x00UL)           /*!< Min value of EVENT field.                                            */
  #define ETM_TRCTSCTLR_EVENT_Max (0xFFUL)           /*!< Max size of EVENT field.                                             */


/* ETM_TRCSYNCPR: Controls how often trace synchronization requests occur. Might ignore writes when the trace unit is enabled or
                   not idle. If writes are permitted then the register must be programmed. */

  #define ETM_TRCSYNCPR_ResetValue (0x00000000UL)    /*!< Reset value of TRCSYNCPR register.                                   */

/* PERIOD @Bits 0..4 : Controls how many bytes of trace, the sum of instruction and data, that a trace unit can generate before
                       a trace synchronization request occurs. The number of bytes is always a power of two, calculated by
                       2^PERIOD */

  #define ETM_TRCSYNCPR_PERIOD_Pos (0UL)             /*!< Position of PERIOD field.                                            */
  #define ETM_TRCSYNCPR_PERIOD_Msk (0x1FUL << ETM_TRCSYNCPR_PERIOD_Pos) /*!< Bit mask of PERIOD field.                         */
  #define ETM_TRCSYNCPR_PERIOD_Min (0x00UL)          /*!< Min value of PERIOD field.                                           */
  #define ETM_TRCSYNCPR_PERIOD_Max (0x1FUL)          /*!< Max size of PERIOD field.                                            */
  #define ETM_TRCSYNCPR_PERIOD_Disabled (0x00UL)     /*!< Trace synchronization requests are disabled. This setting does not
                                                          disable other types of trace synchronization request.*/


/* ETM_TRCCCCTLR: Sets the threshold value for cycle counting. Might ignore writes when the trace unit is enabled or not idle.
                   Must be programmed if TRCCONFIGR.CCI==1. */

  #define ETM_TRCCCCTLR_ResetValue (0x00000000UL)    /*!< Reset value of TRCCCCTLR register.                                   */

