NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_OUTCLR_PIN9_Pos (9UL)                 /*!< Position of PIN9 field.                                              */
  #define GPIO_OUTCLR_PIN9_Msk (0x1UL << GPIO_OUTCLR_PIN9_Pos) /*!< Bit mask of PIN9 field.                                    */
  #define GPIO_OUTCLR_PIN9_Min (0x0UL)               /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_OUTCLR_PIN9_Max (0x1UL)               /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_OUTCLR_PIN9_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN9_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN9_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_OUTCLR_PIN10_Pos (10UL)               /*!< Position of PIN10 field.                                             */
  #define GPIO_OUTCLR_PIN10_Msk (0x1UL << GPIO_OUTCLR_PIN10_Pos) /*!< Bit mask of PIN10 field.                                 */
  #define GPIO_OUTCLR_PIN10_Min (0x0UL)              /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_OUTCLR_PIN10_Max (0x1UL)              /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_OUTCLR_PIN10_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN10_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN10_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_OUTCLR_PIN11_Pos (11UL)               /*!< Position of PIN11 field.                                             */
  #define GPIO_OUTCLR_PIN11_Msk (0x1UL << GPIO_OUTCLR_PIN11_Pos) /*!< Bit mask of PIN11 field.                                 */
  #define GPIO_OUTCLR_PIN11_Min (0x0UL)              /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_OUTCLR_PIN11_Max (0x1UL)              /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_OUTCLR_PIN11_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN11_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN11_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_OUTCLR_PIN12_Pos (12UL)               /*!< Position of PIN12 field.                                             */
  #define GPIO_OUTCLR_PIN12_Msk (0x1UL << GPIO_OUTCLR_PIN12_Pos) /*!< Bit mask of PIN12 field.                                 */
  #define GPIO_OUTCLR_PIN12_Min (0x0UL)              /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_OUTCLR_PIN12_Max (0x1UL)              /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_OUTCLR_PIN12_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN12_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN12_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_OUTCLR_PIN13_Pos (13UL)               /*!< Position of PIN13 field.                                             */
  #define GPIO_OUTCLR_PIN13_Msk (0x1UL << GPIO_OUTCLR_PIN13_Pos) /*!< Bit mask of PIN13 field.                                 */
  #define GPIO_OUTCLR_PIN13_Min (0x0UL)              /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_OUTCLR_PIN13_Max (0x1UL)              /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_OUTCLR_PIN13_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN13_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN13_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_OUTCLR_PIN14_Pos (14UL)               /*!< Position of PIN14 field.                                             */
  #define GPIO_OUTCLR_PIN14_Msk (0x1UL << GPIO_OUTCLR_PIN14_Pos) /*!< Bit mask of PIN14 field.                                 */
  #define GPIO_OUTCLR_PIN14_Min (0x0UL)              /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_OUTCLR_PIN14_Max (0x1UL)              /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_OUTCLR_PIN14_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN14_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN14_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_OUTCLR_PIN15_Pos (15UL)               /*!< Position of PIN15 field.                                             */
  #define GPIO_OUTCLR_PIN15_Msk (0x1UL << GPIO_OUTCLR_PIN15_Pos) /*!< Bit mask of PIN15 field.                                 */
  #define GPIO_OUTCLR_PIN15_Min (0x0UL)              /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_OUTCLR_PIN15_Max (0x1UL)              /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_OUTCLR_PIN15_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN15_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN15_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_OUTCLR_PIN16_Pos (16UL)               /*!< Position of PIN16 field.                                             */
  #define GPIO_OUTCLR_PIN16_Msk (0x1UL << GPIO_OUTCLR_PIN16_Pos) /*!< Bit mask of PIN16 field.                                 */
  #define GPIO_OUTCLR_PIN16_Min (0x0UL)              /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_OUTCLR_PIN16_Max (0x1UL)              /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_OUTCLR_PIN16_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN16_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN16_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_OUTCLR_PIN17_Pos (17UL)               /*!< Position of PIN17 field.                                             */
  #define GPIO_OUTCLR_PIN17_Msk (0x1UL << GPIO_OUTCLR_PIN17_Pos) /*!< Bit mask of PIN17 field.                                 */
  #define GPIO_OUTCLR_PIN17_Min (0x0UL)              /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_OUTCLR_PIN17_Max (0x1UL)              /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_OUTCLR_PIN17_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN17_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN17_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

