NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* GPIOHSPADCTRL_BIAS: Bias control */
  #define GPIOHSPADCTRL_BIAS_ResetValue (0x00000000UL) /*!< Reset value of BIAS register.                                      */

/* HSBIAS @Bits 0..1 : Slew setting for high-speed pad (higher value is faster) */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Pos (0UL)        /*!< Position of HSBIAS field.                                            */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Msk (0x3UL << GPIOHSPADCTRL_BIAS_HSBIAS_Pos) /*!< Bit mask of HSBIAS field.                */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Min (0x0UL)      /*!< Min value of HSBIAS field.                                           */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Max (0x3UL)      /*!< Max size of HSBIAS field.                                            */

/* REPLICABIAS00 @Bit 2 : Slew setting for replica clock (used by the MSPI00 peripheral) */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Pos (2UL) /*!< Position of REPLICABIAS00 field.                                     */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Msk (0x1UL << GPIOHSPADCTRL_BIAS_REPLICABIAS00_Pos) /*!< Bit mask of REPLICABIAS00
                                                                            field.*/
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Min (0x0UL) /*!< Min value of REPLICABIAS00 field.                                  */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Max (0x1UL) /*!< Max size of REPLICABIAS00 field.                                   */

/* REPLICABIAS01 @Bit 3 : Slew setting for replica clock (used by the MSPI01 peripheral) */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Pos (3UL) /*!< Position of REPLICABIAS01 field.                                     */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Msk (0x1UL << GPIOHSPADCTRL_BIAS_REPLICABIAS01_Pos) /*!< Bit mask of REPLICABIAS01
                                                                            field.*/
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Min (0x0UL) /*!< Min value of REPLICABIAS01 field.                                  */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Max (0x1UL) /*!< Max size of REPLICABIAS01 field.                                   */


/* GPIOHSPADCTRL_CTRL: Input sampling and buffering control (used by the MSPI0n peripheral) */
  #define GPIOHSPADCTRL_CTRL_MaxCount (2UL)          /*!< Max size of CTRL[2] array.                                           */
  #define GPIOHSPADCTRL_CTRL_MaxIndex (1UL)          /*!< Max index of CTRL[2] array.                                          */
  #define GPIOHSPADCTRL_CTRL_MinIndex (0UL)          /*!< Min index of CTRL[2] array.                                          */
  #define GPIOHSPADCTRL_CTRL_ResetValue (0x00000000UL) /*!< Reset value of CTRL[2] register.                                   */

/* RXDELAY @Bits 0..2 : Delay selection */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Pos (0UL)       /*!< Position of RXDELAY field.                                           */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Msk (0x7UL << GPIOHSPADCTRL_CTRL_RXDELAY_Pos) /*!< Bit mask of RXDELAY field.             */

/* SCKEN @Bit 3 : Enable SCK */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Pos (3UL)         /*!< Position of SCKEN field.                                             */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKEN_Pos) /*!< Bit mask of SCKEN field.                   */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Min (0x0UL)       /*!< Min enumerator value of SCKEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Max (0x1UL)       /*!< Max enumerator value of SCKEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Disabled (0x0UL)  /*!< Delay chain is reset and delayed sampling is disabled                */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Enabled (0x1UL)   /*!< Delay chain and delayed sampling is active                           */

/* SCKPHASE @Bit 4 : SCK phase */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Pos (4UL)      /*!< Position of SCKPHASE field.                                          */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKPHASE_Pos) /*!< Bit mask of SCKPHASE field.          */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Min (0x0UL)    /*!< Min enumerator value of SCKPHASE field.                              */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Max (0x1UL)    /*!< Max enumerator value of SCKPHASE field.                              */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Inverted (0x0UL) /*!< Invert SCK phase                                                   */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_NonInverted (0x1UL) /*!< Non-inverted SCK phase                                          */

/* CSNEN @Bit 5 : Enable CSN synchronization of sampling */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Pos (5UL)         /*!< Position of CSNEN field.                                             */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_CSNEN_Pos) /*!< Bit mask of CSNEN field.                   */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Min (0x0UL)       /*!< Min enumerator value of CSNEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Max (0x1UL)       /*!< Max enumerator value of CSNEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Enabled (0x0UL)   /*!< Delay chain is reset on active edge of CSN                           */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Disabled (0x1UL)  /*!< Delay chain is not reset on active edge of CSN                       */

/* DATAENABLE @Bits 6..9 : Enable delayed sampling */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Pos (6UL)    /*!< Position of DATAENABLE field.                                        */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Msk (0xFUL << GPIOHSPADCTRL_CTRL_DATAENABLE_Pos) /*!< Bit mask of DATAENABLE field.    */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Min (0x0UL)  /*!< Min enumerator value of DATAENABLE field.                            */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Max (0xFUL)  /*!< Max enumerator value of DATAENABLE field.                            */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Disabled (0x0UL) /*!< Delayed sampling is disabled                                     */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Enabled (0xFUL) /*!< Delayed sampling is enabled                                       */

/* REPLICACLKLOAD @Bits 12..13 : Load capacitor used by replica clock pad */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Pos (12UL) /*!< Position of REPLICACLKLOAD field.                                  */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Msk (0x3UL << GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Pos) /*!< Bit mask of REPLICACLKLOAD
                                                                            field.*/
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Min (0x0UL) /*!< Min enumerator value of REPLICACLKLOAD field.                     */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Max (0x3UL) /*!< Max enumerator value of REPLICACLKLOAD field.                     */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap0p75 (0x0UL) /*!< Load capacitance of 0.75 pF                                   */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap1p50 (0x1UL) /*!< Load capacitance of 1.5 pF                                    */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap2p25 (0x2UL) /*!< Load capacitance of 2.25 pF                                   */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap3p00 (0x3UL) /*!< Load capacitance of 3.0 pF                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       GPIOINTERNAL                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* =================================================== Struct GPIOINTERNAL =================================================== */
/**
  * @brief GPIO Internal
  */
  typedef struct {                                   /*!< GPIOINTERNAL Structure                                               */
    __IM uint32_t RESERVED;
  } NRF_GPIOINTERNAL_Type;                           /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Non-secure port event                                 */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Secure port event                                     */
} NRF_GPIOTE_EVENTS_PORT_Type;                       /*!< Size = 8 (0x008)                                                     */
