NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* HFXO64M_EVENTS_STARTED: HFXO64M started */
  #define HFXO64M_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                        */

/* EVENTS_STARTED @Bit 0 : HFXO64M started */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                               */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                 */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                 */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define HFXO64M_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                         */


/* HFXO64M_EVENTS_STOPPED: HFXO64M stopped */
  #define HFXO64M_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                        */

/* EVENTS_STOPPED @Bit 0 : HFXO64M stopped */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                               */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                 */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                 */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define HFXO64M_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                         */


/* HFXO64M_EVENTS_ERRORBIAS: Error with BIAS setup */
  #define HFXO64M_EVENTS_ERRORBIAS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORBIAS register.                    */

/* EVENTS_ERRORBIAS @Bit 0 : Error with BIAS setup */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Pos (0UL) /*!< Position of EVENTS_ERRORBIAS field.                         */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Msk (0x1UL << HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORBIAS field.*/
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORBIAS field.           */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORBIAS field.           */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define HFXO64M_EVENTS_ERRORBIAS_EVENTS_ERRORBIAS_Generated (0x1UL) /*!< Event generated                                     */


/* HFXO64M_EVENTS_ERRORDETECTOR: Error with DETECTOR */
  #define HFXO64M_EVENTS_ERRORDETECTOR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORDETECTOR register.            */

/* EVENTS_ERRORDETECTOR @Bit 0 : Error with DETECTOR */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Pos (0UL) /*!< Position of EVENTS_ERRORDETECTOR field.             */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Msk (0x1UL << HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Pos)
                                                                            /*!< Bit mask of EVENTS_ERRORDETECTOR field.*/
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORDETECTOR
                                                                            field.*/
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORDETECTOR
                                                                            field.*/
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define HFXO64M_EVENTS_ERRORDETECTOR_EVENTS_ERRORDETECTOR_Generated (0x1UL) /*!< Event generated                             */


/* HFXO64M_EVENTS_ERRORTCXO: Error with TCXO startup */
  #define HFXO64M_EVENTS_ERRORTCXO_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORTCXO register.                    */

/* EVENTS_ERRORTCXO @Bit 0 : Error with TCXO startup */
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Pos (0UL) /*!< Position of EVENTS_ERRORTCXO field.                         */
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Msk (0x1UL << HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORTCXO field.*/
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORTCXO field.           */
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORTCXO field.           */
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define HFXO64M_EVENTS_ERRORTCXO_EVENTS_ERRORTCXO_Generated (0x1UL) /*!< Event generated                                     */


/* HFXO64M_EVENTS_STARTREQ: Clock start has been requested */
  #define HFXO64M_EVENTS_STARTREQ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTREQ register.                      */

/* EVENTS_STARTREQ @Bit 0 : Clock start has been requested */
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Pos (0UL) /*!< Position of EVENTS_STARTREQ field.                            */
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Msk (0x1UL << HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTREQ field.*/
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTREQ field.              */
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTREQ field.              */
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define HFXO64M_EVENTS_STARTREQ_EVENTS_STARTREQ_Generated (0x1UL) /*!< Event generated                                       */


/* HFXO64M_EVENTS_STOPREQ: Clock stop has been requested */
  #define HFXO64M_EVENTS_STOPREQ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPREQ register.                        */

