NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ERRORBIAS @Bit 2 : Write '1' to enable interrupt for event ERRORBIAS */
  #define HFXO64M_INTENSET_ERRORBIAS_Pos (2UL)       /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTENSET_ERRORBIAS_Msk (0x1UL << HFXO64M_INTENSET_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.           */
  #define HFXO64M_INTENSET_ERRORBIAS_Min (0x0UL)     /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENSET_ERRORBIAS_Max (0x1UL)     /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENSET_ERRORBIAS_Set (0x1UL)     /*!< Enable                                                               */
  #define HFXO64M_INTENSET_ERRORBIAS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENSET_ERRORBIAS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ERRORDETECTOR @Bit 3 : Write '1' to enable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Pos (3UL)   /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTENSET_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR
                                                                            field.*/
  #define HFXO64M_INTENSET_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Set (0x1UL) /*!< Enable                                                               */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define HFXO64M_INTENSET_ERRORDETECTOR_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* ERRORTCXO @Bit 4 : Write '1' to enable interrupt for event ERRORTCXO */
  #define HFXO64M_INTENSET_ERRORTCXO_Pos (4UL)       /*!< Position of ERRORTCXO field.                                         */
  #define HFXO64M_INTENSET_ERRORTCXO_Msk (0x1UL << HFXO64M_INTENSET_ERRORTCXO_Pos) /*!< Bit mask of ERRORTCXO field.           */
  #define HFXO64M_INTENSET_ERRORTCXO_Min (0x0UL)     /*!< Min enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTENSET_ERRORTCXO_Max (0x1UL)     /*!< Max enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTENSET_ERRORTCXO_Set (0x1UL)     /*!< Enable                                                               */
  #define HFXO64M_INTENSET_ERRORTCXO_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENSET_ERRORTCXO_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* STARTREQ @Bit 5 : Write '1' to enable interrupt for event STARTREQ */
  #define HFXO64M_INTENSET_STARTREQ_Pos (5UL)        /*!< Position of STARTREQ field.                                          */
  #define HFXO64M_INTENSET_STARTREQ_Msk (0x1UL << HFXO64M_INTENSET_STARTREQ_Pos) /*!< Bit mask of STARTREQ field.              */
  #define HFXO64M_INTENSET_STARTREQ_Min (0x0UL)      /*!< Min enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTENSET_STARTREQ_Max (0x1UL)      /*!< Max enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTENSET_STARTREQ_Set (0x1UL)      /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STARTREQ_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STARTREQ_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* STOPREQ @Bit 6 : Write '1' to enable interrupt for event STOPREQ */
  #define HFXO64M_INTENSET_STOPREQ_Pos (6UL)         /*!< Position of STOPREQ field.                                           */
  #define HFXO64M_INTENSET_STOPREQ_Msk (0x1UL << HFXO64M_INTENSET_STOPREQ_Pos) /*!< Bit mask of STOPREQ field.                 */
  #define HFXO64M_INTENSET_STOPREQ_Min (0x0UL)       /*!< Min enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTENSET_STOPREQ_Max (0x1UL)       /*!< Max enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTENSET_STOPREQ_Set (0x1UL)       /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STOPREQ_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STOPREQ_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* HFXO64M_INTENCLR: Disable interrupt */
  #define HFXO64M_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define HFXO64M_INTENCLR_STARTED_Pos (0UL)         /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTENCLR_STARTED_Msk (0x1UL << HFXO64M_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                 */
  #define HFXO64M_INTENCLR_STARTED_Min (0x0UL)       /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTENCLR_STARTED_Max (0x1UL)       /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTENCLR_STARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define HFXO64M_INTENCLR_STOPPED_Pos (1UL)         /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTENCLR_STOPPED_Msk (0x1UL << HFXO64M_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                 */
  #define HFXO64M_INTENCLR_STOPPED_Min (0x0UL)       /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENCLR_STOPPED_Max (0x1UL)       /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENCLR_STOPPED_Clear (0x1UL)     /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERRORBIAS @Bit 2 : Write '1' to disable interrupt for event ERRORBIAS */
  #define HFXO64M_INTENCLR_ERRORBIAS_Pos (2UL)       /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTENCLR_ERRORBIAS_Msk (0x1UL << HFXO64M_INTENCLR_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.           */
  #define HFXO64M_INTENCLR_ERRORBIAS_Min (0x0UL)     /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENCLR_ERRORBIAS_Max (0x1UL)     /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTENCLR_ERRORBIAS_Clear (0x1UL)   /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_ERRORBIAS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENCLR_ERRORBIAS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* ERRORDETECTOR @Bit 3 : Write '1' to disable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Pos (3UL)   /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTENCLR_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR
                                                                            field.*/
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Min (0x0UL) /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Max (0x1UL) /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Clear (0x1UL) /*!< Disable                                                            */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define HFXO64M_INTENCLR_ERRORDETECTOR_Enabled (0x1UL) /*!< Read: Enabled                                                    */

