NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ERRORTCXO @Bit 4 : Read pending status of interrupt for event ERRORTCXO */
  #define HFXO64M_INTPEND_ERRORTCXO_Pos (4UL)        /*!< Position of ERRORTCXO field.                                         */
  #define HFXO64M_INTPEND_ERRORTCXO_Msk (0x1UL << HFXO64M_INTPEND_ERRORTCXO_Pos) /*!< Bit mask of ERRORTCXO field.             */
  #define HFXO64M_INTPEND_ERRORTCXO_Min (0x0UL)      /*!< Min enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTPEND_ERRORTCXO_Max (0x1UL)      /*!< Max enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTPEND_ERRORTCXO_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define HFXO64M_INTPEND_ERRORTCXO_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* STARTREQ @Bit 5 : Read pending status of interrupt for event STARTREQ */
  #define HFXO64M_INTPEND_STARTREQ_Pos (5UL)         /*!< Position of STARTREQ field.                                          */
  #define HFXO64M_INTPEND_STARTREQ_Msk (0x1UL << HFXO64M_INTPEND_STARTREQ_Pos) /*!< Bit mask of STARTREQ field.                */
  #define HFXO64M_INTPEND_STARTREQ_Min (0x0UL)       /*!< Min enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTPEND_STARTREQ_Max (0x1UL)       /*!< Max enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTPEND_STARTREQ_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define HFXO64M_INTPEND_STARTREQ_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* STOPREQ @Bit 6 : Read pending status of interrupt for event STOPREQ */
  #define HFXO64M_INTPEND_STOPREQ_Pos (6UL)          /*!< Position of STOPREQ field.                                           */
  #define HFXO64M_INTPEND_STOPREQ_Msk (0x1UL << HFXO64M_INTPEND_STOPREQ_Pos) /*!< Bit mask of STOPREQ field.                   */
  #define HFXO64M_INTPEND_STOPREQ_Min (0x0UL)        /*!< Min enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTPEND_STOPREQ_Max (0x1UL)        /*!< Max enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTPEND_STOPREQ_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define HFXO64M_INTPEND_STOPREQ_Pending (0x1UL)    /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           IPCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct IPCT_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [IPCT_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) Overflow status for SEND tasks Write 0 to clear       */
} NRF_IPCT_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* IPCT_OVERFLOW_SEND: Overflow status for SEND tasks Write 0 to clear */
  #define IPCT_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

/* SEND0 @Bit 0 : Overflow status for SEND[0] task */
  #define IPCT_OVERFLOW_SEND_SEND0_Pos (0UL)         /*!< Position of SEND0 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND0_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND0_Pos) /*!< Bit mask of SEND0 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND0_Min (0x0UL)       /*!< Min enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Max (0x1UL)       /*!< Max enumerator value of SEND0 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND0_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND1 @Bit 1 : Overflow status for SEND[1] task */
  #define IPCT_OVERFLOW_SEND_SEND1_Pos (1UL)         /*!< Position of SEND1 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND1_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND1_Pos) /*!< Bit mask of SEND1 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND1_Min (0x0UL)       /*!< Min enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Max (0x1UL)       /*!< Max enumerator value of SEND1 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND1_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND2 @Bit 2 : Overflow status for SEND[2] task */
  #define IPCT_OVERFLOW_SEND_SEND2_Pos (2UL)         /*!< Position of SEND2 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND2_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND2_Pos) /*!< Bit mask of SEND2 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND2_Min (0x0UL)       /*!< Min enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Max (0x1UL)       /*!< Max enumerator value of SEND2 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND2_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */

/* SEND3 @Bit 3 : Overflow status for SEND[3] task */
  #define IPCT_OVERFLOW_SEND_SEND3_Pos (3UL)         /*!< Position of SEND3 field.                                             */
  #define IPCT_OVERFLOW_SEND_SEND3_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND3_Pos) /*!< Bit mask of SEND3 field.                   */
  #define IPCT_OVERFLOW_SEND_SEND3_Min (0x0UL)       /*!< Min enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Max (0x1UL)       /*!< Max enumerator value of SEND3 field.                                 */
  #define IPCT_OVERFLOW_SEND_SEND3_Overflow (0x1UL)  /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL) /*!< Task overflow has not happened                                      */


/* ======================================================= Struct IPCT ======================================================= */
/**
  * @brief IPCT APB registers
  */
  typedef struct {                                   /*!< IPCT Structure                                                       */
    __OM uint32_t TASKS_SEND[4];                     /*!< (@ 0x00000000) Trigger event on IPCT source channel n if there are no
                                                                         active signals present on that channel*/
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_FLUSH[4];                    /*!< (@ 0x00000040) Flush IPCT sink channel n. Any pending IPCT signal on
                                                                         that channel will re-trigger the RECEIVE[n] event. The
                                                                         flush can happen automatically by configuring the
                                                                         SHORTS register accordingly.*/
    __IM uint32_t RESERVED1[12];
    __IOM uint32_t SUBSCRIBE_SEND[4];                /*!< (@ 0x00000080) Subscribe configuration for task SEND[n]              */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_FLUSH[4];               /*!< (@ 0x000000C0) Subscribe configuration for task FLUSH[n]             */
    __IM uint32_t RESERVED3[12];
    __IOM uint32_t EVENTS_RECEIVE[4];                /*!< (@ 0x00000100) Event received on IPCT sink channel n                 */
    __IM uint32_t RESERVED4[12];
    __IOM uint32_t EVENTS_READY[4];                  /*!< (@ 0x00000140) Event received when hardware handshake of SEND task for
                                                                         IPCT source channel n is complete and a new signal can
                                                                         be triggered on that channel.*/
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t PUBLISH_RECEIVE[4];               /*!< (@ 0x00000180) Publish configuration for event RECEIVE[n]            */
    __IM uint32_t RESERVED6[12];
    __IOM uint32_t PUBLISH_READY[4];                 /*!< (@ 0x000001C0) Publish configuration for event READY[n]              */
    __IM uint32_t RESERVED7[12];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED8[63];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
    __IM uint32_t RESERVED9[48];
    __IOM NRF_IPCT_OVERFLOW_Type OVERFLOW;           /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_IPCT_Type;                                   /*!< Size = 1028 (0x404)                                                  */

/* IPCT_TASKS_SEND: Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_MaxCount (4UL)             /*!< Max size of TASKS_SEND[4] array.                                     */
  #define IPCT_TASKS_SEND_MaxIndex (3UL)             /*!< Max index of TASKS_SEND[4] array.                                    */
  #define IPCT_TASKS_SEND_MinIndex (0UL)             /*!< Min index of TASKS_SEND[4] array.                                    */
  #define IPCT_TASKS_SEND_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_SEND[4] register.                               */

/* TASKS_SEND @Bit 0 : Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_TASKS_SEND_Pos (0UL)       /*!< Position of TASKS_SEND field.                                        */
  #define IPCT_TASKS_SEND_TASKS_SEND_Msk (0x1UL << IPCT_TASKS_SEND_TASKS_SEND_Pos) /*!< Bit mask of TASKS_SEND field.          */
  #define IPCT_TASKS_SEND_TASKS_SEND_Min (0x1UL)     /*!< Min enumerator value of TASKS_SEND field.                            */
  #define IPCT_TASKS_SEND_TASKS_SEND_Max (0x1UL)     /*!< Max enumerator value of TASKS_SEND field.                            */
  #define IPCT_TASKS_SEND_TASKS_SEND_Trigger (0x1UL) /*!< Trigger task                                                         */


/* IPCT_TASKS_FLUSH: Flush IPCT sink channel n. Any pending IPCT signal on that channel will re-trigger the RECEIVE[n] event.
                      The flush can happen automatically by configuring the SHORTS register accordingly. */

  #define IPCT_TASKS_FLUSH_MaxCount (4UL)            /*!< Max size of TASKS_FLUSH[4] array.                                    */
  #define IPCT_TASKS_FLUSH_MaxIndex (3UL)            /*!< Max index of TASKS_FLUSH[4] array.                                   */
  #define IPCT_TASKS_FLUSH_MinIndex (0UL)            /*!< Min index of TASKS_FLUSH[4] array.                                   */
  #define IPCT_TASKS_FLUSH_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSH[4] register.                              */

