NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* EVENTS_METADATAREAD @Bit 0 : Key slot metadata has been read into METADATA register */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos (0UL) /*!< Position of EVENTS_METADATAREAD field.                    */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Msk (0x1UL << KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos) /*!< Bit
                                                                            mask of EVENTS_METADATAREAD field.*/
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Min (0x0UL) /*!< Min enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Max (0x1UL) /*!< Max enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Generated (0x1UL) /*!< Event generated                                   */


/* KMU_EVENTS_PUSHBLOCKED: The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PUSHBLOCKED register.                    */

/* EVENTS_PUSHBLOCKED @Bit 0 : The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos (0UL) /*!< Position of EVENTS_PUSHBLOCKED field.                       */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Msk (0x1UL << KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos) /*!< Bit mask
                                                                            of EVENTS_PUSHBLOCKED field.*/
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Generated (0x1UL) /*!< Event generated                                     */


/* KMU_EVENTS_BLOCKED: The BLOCK operation was successful */
  #define KMU_EVENTS_BLOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BLOCKED register.                            */

/* EVENTS_BLOCKED @Bit 0 : The BLOCK operation was successful */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Pos (0UL) /*!< Position of EVENTS_BLOCKED field.                                   */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Msk (0x1UL << KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Pos) /*!< Bit mask of EVENTS_BLOCKED
                                                                            field.*/
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_BLOCKED field.                     */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_BLOCKED field.                     */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Generated (0x1UL) /*!< Event generated                                             */


/* KMU_STATUS: KMU status register */
  #define KMU_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* STATUS @Bit 0 : KMU status */
  #define KMU_STATUS_STATUS_Pos (0UL)                /*!< Position of STATUS field.                                            */
  #define KMU_STATUS_STATUS_Msk (0x1UL << KMU_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                                */
  #define KMU_STATUS_STATUS_Min (0x0UL)              /*!< Min enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Max (0x1UL)              /*!< Max enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Ready (0x0UL)            /*!< KMU is ready for new operation                                       */
  #define KMU_STATUS_STATUS_Busy (0x1UL)             /*!< KMU is busy, an operation is in progress                             */


/* KMU_KEYSLOT: Select key slot to operate on */
  #define KMU_KEYSLOT_ResetValue (0x00000000UL)      /*!< Reset value of KEYSLOT register.                                     */

/* ID @Bits 0..7 : Select key slot ID to provision, push, read METADATA, revoke or block when the corresponding task is
                   triggered. */

  #define KMU_KEYSLOT_ID_Pos (0UL)                   /*!< Position of ID field.                                                */
  #define KMU_KEYSLOT_ID_Msk (0xFFUL << KMU_KEYSLOT_ID_Pos) /*!< Bit mask of ID field.                                         */
  #define KMU_KEYSLOT_ID_Min (0x00UL)                /*!< Min value of ID field.                                               */
  #define KMU_KEYSLOT_ID_Max (0xF9UL)                /*!< Max size of ID field.                                                */


/* KMU_SRC: Source address for provisioning */
  #define KMU_SRC_ResetValue (0x00000000UL)          /*!< Reset value of SRC register.                                         */

/* SRC @Bits 0..31 : Source address for TASKS_PROVISION. */
  #define KMU_SRC_SRC_Pos (0UL)                      /*!< Position of SRC field.                                               */
  #define KMU_SRC_SRC_Msk (0xFFFFFFFFUL << KMU_SRC_SRC_Pos) /*!< Bit mask of SRC field.                                        */


/* KMU_METADATA: Key slot metadata as read by TASKS_READMETADATA. */
  #define KMU_METADATA_ResetValue (0x00000000UL)     /*!< Reset value of METADATA register.                                    */

/* METADATA @Bits 0..31 : Read metadata. */
  #define KMU_METADATA_METADATA_Pos (0UL)            /*!< Position of METADATA field.                                          */
  #define KMU_METADATA_METADATA_Msk (0xFFFFFFFFUL << KMU_METADATA_METADATA_Pos) /*!< Bit mask of METADATA field.               */


/* KMU_METADATAEXT: Second word of key slot metadata as read by TASKS_READMETADATA. */
  #define KMU_METADATAEXT_ResetValue (0x00000000UL)  /*!< Reset value of METADATAEXT register.                                 */

/* METADATAEXT @Bits 0..31 : Read metadata. */
  #define KMU_METADATAEXT_METADATAEXT_Pos (0UL)      /*!< Position of METADATAEXT field.                                       */
  #define KMU_METADATAEXT_METADATAEXT_Msk (0xFFFFFFFFUL << KMU_METADATAEXT_METADATAEXT_Pos) /*!< Bit mask of METADATAEXT field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFRC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct LFRC_CAL ===================================================== */
/**
  * @brief CAL [LFRC_CAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LENGTH;                            /*!< (@ 0x00000000) Measurement cycle count length used while calibration */
} NRF_LFRC_CAL_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* LFRC_CAL_LENGTH: Measurement cycle count length used while calibration */
  #define LFRC_CAL_LENGTH_ResetValue (0x00000002UL)  /*!< Reset value of LENGTH register.                                      */

/* LENGTH @Bits 0..2 : Number of cycles */
  #define LFRC_CAL_LENGTH_LENGTH_Pos (0UL)           /*!< Position of LENGTH field.                                            */
  #define LFRC_CAL_LENGTH_LENGTH_Msk (0x7UL << LFRC_CAL_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field.                      */
  #define LFRC_CAL_LENGTH_LENGTH_Min (0x0UL)         /*!< Min enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_Max (0x3UL)         /*!< Max enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_N64 (0x0UL)         /*!< 64 cycles                                                            */
  #define LFRC_CAL_LENGTH_LENGTH_N128 (0x1UL)        /*!< 128 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N256 (0x2UL)        /*!< 256 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N512 (0x3UL)        /*!< 512 cycles                                                           */


