NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ======================================================= Struct LFRC ======================================================= */
/**
  * @brief LFRC peripheral
  */
  typedef struct {                                   /*!< LFRC Structure                                                       */
    __OM uint32_t TASKS_CAL;                         /*!< (@ 0x00000000) Start the calibration of RC oscillator                */
    __OM uint32_t TASKS_CANCELCAL;                   /*!< (@ 0x00000004) Cancel the calibration                                */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_CALDONE;                   /*!< (@ 0x00000100) Calibration done                                      */
    __IOM uint32_t EVENTS_TRIMDONE;                  /*!< (@ 0x00000104) Trim done                                             */
    __IOM uint32_t EVENTS_TRIMERROR;                 /*!< (@ 0x00000108) Trim error                                            */
    __IOM uint32_t EVENTS_CKSYNSTARTED;              /*!< (@ 0x0000010C) Synth clock started                                   */
    __IOM uint32_t EVENTS_CKLFRCSTARTED;             /*!< (@ 0x00000110) LFRC clock started                                    */
    __IM uint32_t RESERVED1[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[68];
    __IOM NRF_LFRC_CAL_Type CAL;                     /*!< (@ 0x00000420) (unspecified)                                         */
  } NRF_LFRC_Type;                                   /*!< Size = 1060 (0x424)                                                  */

/* LFRC_TASKS_CAL: Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_CAL register.                                   */

/* TASKS_CAL @Bit 0 : Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_TASKS_CAL_Pos (0UL)         /*!< Position of TASKS_CAL field.                                         */
  #define LFRC_TASKS_CAL_TASKS_CAL_Msk (0x1UL << LFRC_TASKS_CAL_TASKS_CAL_Pos) /*!< Bit mask of TASKS_CAL field.               */
  #define LFRC_TASKS_CAL_TASKS_CAL_Min (0x1UL)       /*!< Min enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Max (0x1UL)       /*!< Max enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Trigger (0x1UL)   /*!< Trigger task                                                         */


/* LFRC_TASKS_CANCELCAL: Cancel the calibration */
  #define LFRC_TASKS_CANCELCAL_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CANCELCAL register.                         */

/* TASKS_CANCELCAL @Bit 0 : Cancel the calibration */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Pos (0UL) /*!< Position of TASKS_CANCELCAL field.                               */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Msk (0x1UL << LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Pos) /*!< Bit mask of
                                                                            TASKS_CANCELCAL field.*/
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Min (0x1UL) /*!< Min enumerator value of TASKS_CANCELCAL field.                 */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Max (0x1UL) /*!< Max enumerator value of TASKS_CANCELCAL field.                 */
  #define LFRC_TASKS_CANCELCAL_TASKS_CANCELCAL_Trigger (0x1UL) /*!< Trigger task                                               */


/* LFRC_EVENTS_CALDONE: Calibration done */
  #define LFRC_EVENTS_CALDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CALDONE register.                           */

/* EVENTS_CALDONE @Bit 0 : Calibration done */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Pos (0UL) /*!< Position of EVENTS_CALDONE field.                                  */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Msk (0x1UL << LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_CALDONE field.*/
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_CALDONE field.                    */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_CALDONE field.                    */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define LFRC_EVENTS_CALDONE_EVENTS_CALDONE_Generated (0x1UL) /*!< Event generated                                            */


/* LFRC_EVENTS_TRIMDONE: Trim done */
  #define LFRC_EVENTS_TRIMDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIMDONE register.                         */

/* EVENTS_TRIMDONE @Bit 0 : Trim done */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Pos (0UL) /*!< Position of EVENTS_TRIMDONE field.                               */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Msk (0x1UL << LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIMDONE field.*/
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIMDONE field.                 */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIMDONE field.                 */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define LFRC_EVENTS_TRIMDONE_EVENTS_TRIMDONE_Generated (0x1UL) /*!< Event generated                                          */


