NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* LFRC_INTENSET: Enable interrupt */
  #define LFRC_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* CALDONE @Bit 0 : Write '1' to enable interrupt for event CALDONE */
  #define LFRC_INTENSET_CALDONE_Pos (0UL)            /*!< Position of CALDONE field.                                           */
  #define LFRC_INTENSET_CALDONE_Msk (0x1UL << LFRC_INTENSET_CALDONE_Pos) /*!< Bit mask of CALDONE field.                       */
  #define LFRC_INTENSET_CALDONE_Min (0x0UL)          /*!< Min enumerator value of CALDONE field.                               */
  #define LFRC_INTENSET_CALDONE_Max (0x1UL)          /*!< Max enumerator value of CALDONE field.                               */
  #define LFRC_INTENSET_CALDONE_Set (0x1UL)          /*!< Enable                                                               */
  #define LFRC_INTENSET_CALDONE_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LFRC_INTENSET_CALDONE_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TRIMDONE @Bit 1 : Write '1' to enable interrupt for event TRIMDONE */
  #define LFRC_INTENSET_TRIMDONE_Pos (1UL)           /*!< Position of TRIMDONE field.                                          */
  #define LFRC_INTENSET_TRIMDONE_Msk (0x1UL << LFRC_INTENSET_TRIMDONE_Pos) /*!< Bit mask of TRIMDONE field.                    */
  #define LFRC_INTENSET_TRIMDONE_Min (0x0UL)         /*!< Min enumerator value of TRIMDONE field.                              */
  #define LFRC_INTENSET_TRIMDONE_Max (0x1UL)         /*!< Max enumerator value of TRIMDONE field.                              */
  #define LFRC_INTENSET_TRIMDONE_Set (0x1UL)         /*!< Enable                                                               */
  #define LFRC_INTENSET_TRIMDONE_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define LFRC_INTENSET_TRIMDONE_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TRIMERROR @Bit 2 : Write '1' to enable interrupt for event TRIMERROR */
  #define LFRC_INTENSET_TRIMERROR_Pos (2UL)          /*!< Position of TRIMERROR field.                                         */
  #define LFRC_INTENSET_TRIMERROR_Msk (0x1UL << LFRC_INTENSET_TRIMERROR_Pos) /*!< Bit mask of TRIMERROR field.                 */
  #define LFRC_INTENSET_TRIMERROR_Min (0x0UL)        /*!< Min enumerator value of TRIMERROR field.                             */
  #define LFRC_INTENSET_TRIMERROR_Max (0x1UL)        /*!< Max enumerator value of TRIMERROR field.                             */
  #define LFRC_INTENSET_TRIMERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define LFRC_INTENSET_TRIMERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define LFRC_INTENSET_TRIMERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* CKSYNSTARTED @Bit 3 : Write '1' to enable interrupt for event CKSYNSTARTED */
  #define LFRC_INTENSET_CKSYNSTARTED_Pos (3UL)       /*!< Position of CKSYNSTARTED field.                                      */
  #define LFRC_INTENSET_CKSYNSTARTED_Msk (0x1UL << LFRC_INTENSET_CKSYNSTARTED_Pos) /*!< Bit mask of CKSYNSTARTED field.        */
  #define LFRC_INTENSET_CKSYNSTARTED_Min (0x0UL)     /*!< Min enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTENSET_CKSYNSTARTED_Max (0x1UL)     /*!< Max enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTENSET_CKSYNSTARTED_Set (0x1UL)     /*!< Enable                                                               */
  #define LFRC_INTENSET_CKSYNSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define LFRC_INTENSET_CKSYNSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CKLFRCSTARTED @Bit 4 : Write '1' to enable interrupt for event CKLFRCSTARTED */
  #define LFRC_INTENSET_CKLFRCSTARTED_Pos (4UL)      /*!< Position of CKLFRCSTARTED field.                                     */
  #define LFRC_INTENSET_CKLFRCSTARTED_Msk (0x1UL << LFRC_INTENSET_CKLFRCSTARTED_Pos) /*!< Bit mask of CKLFRCSTARTED field.     */
  #define LFRC_INTENSET_CKLFRCSTARTED_Min (0x0UL)    /*!< Min enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTENSET_CKLFRCSTARTED_Max (0x1UL)    /*!< Max enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTENSET_CKLFRCSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define LFRC_INTENSET_CKLFRCSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define LFRC_INTENSET_CKLFRCSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* LFRC_INTENCLR: Disable interrupt */
  #define LFRC_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* CALDONE @Bit 0 : Write '1' to disable interrupt for event CALDONE */
  #define LFRC_INTENCLR_CALDONE_Pos (0UL)            /*!< Position of CALDONE field.                                           */
  #define LFRC_INTENCLR_CALDONE_Msk (0x1UL << LFRC_INTENCLR_CALDONE_Pos) /*!< Bit mask of CALDONE field.                       */
  #define LFRC_INTENCLR_CALDONE_Min (0x0UL)          /*!< Min enumerator value of CALDONE field.                               */
  #define LFRC_INTENCLR_CALDONE_Max (0x1UL)          /*!< Max enumerator value of CALDONE field.                               */
  #define LFRC_INTENCLR_CALDONE_Clear (0x1UL)        /*!< Disable                                                              */
  #define LFRC_INTENCLR_CALDONE_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LFRC_INTENCLR_CALDONE_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TRIMDONE @Bit 1 : Write '1' to disable interrupt for event TRIMDONE */
  #define LFRC_INTENCLR_TRIMDONE_Pos (1UL)           /*!< Position of TRIMDONE field.                                          */
  #define LFRC_INTENCLR_TRIMDONE_Msk (0x1UL << LFRC_INTENCLR_TRIMDONE_Pos) /*!< Bit mask of TRIMDONE field.                    */
  #define LFRC_INTENCLR_TRIMDONE_Min (0x0UL)         /*!< Min enumerator value of TRIMDONE field.                              */
  #define LFRC_INTENCLR_TRIMDONE_Max (0x1UL)         /*!< Max enumerator value of TRIMDONE field.                              */
  #define LFRC_INTENCLR_TRIMDONE_Clear (0x1UL)       /*!< Disable                                                              */
  #define LFRC_INTENCLR_TRIMDONE_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define LFRC_INTENCLR_TRIMDONE_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TRIMERROR @Bit 2 : Write '1' to disable interrupt for event TRIMERROR */
  #define LFRC_INTENCLR_TRIMERROR_Pos (2UL)          /*!< Position of TRIMERROR field.                                         */
  #define LFRC_INTENCLR_TRIMERROR_Msk (0x1UL << LFRC_INTENCLR_TRIMERROR_Pos) /*!< Bit mask of TRIMERROR field.                 */
  #define LFRC_INTENCLR_TRIMERROR_Min (0x0UL)        /*!< Min enumerator value of TRIMERROR field.                             */
  #define LFRC_INTENCLR_TRIMERROR_Max (0x1UL)        /*!< Max enumerator value of TRIMERROR field.                             */
  #define LFRC_INTENCLR_TRIMERROR_Clear (0x1UL)      /*!< Disable                                                              */
  #define LFRC_INTENCLR_TRIMERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define LFRC_INTENCLR_TRIMERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

