NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* CKSYNSTARTED @Bit 3 : Write '1' to disable interrupt for event CKSYNSTARTED */
  #define LFRC_INTENCLR_CKSYNSTARTED_Pos (3UL)       /*!< Position of CKSYNSTARTED field.                                      */
  #define LFRC_INTENCLR_CKSYNSTARTED_Msk (0x1UL << LFRC_INTENCLR_CKSYNSTARTED_Pos) /*!< Bit mask of CKSYNSTARTED field.        */
  #define LFRC_INTENCLR_CKSYNSTARTED_Min (0x0UL)     /*!< Min enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTENCLR_CKSYNSTARTED_Max (0x1UL)     /*!< Max enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTENCLR_CKSYNSTARTED_Clear (0x1UL)   /*!< Disable                                                              */
  #define LFRC_INTENCLR_CKSYNSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define LFRC_INTENCLR_CKSYNSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CKLFRCSTARTED @Bit 4 : Write '1' to disable interrupt for event CKLFRCSTARTED */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Pos (4UL)      /*!< Position of CKLFRCSTARTED field.                                     */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Msk (0x1UL << LFRC_INTENCLR_CKLFRCSTARTED_Pos) /*!< Bit mask of CKLFRCSTARTED field.     */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Min (0x0UL)    /*!< Min enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Max (0x1UL)    /*!< Max enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define LFRC_INTENCLR_CKLFRCSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* LFRC_INTPEND: Pending interrupts */
  #define LFRC_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* CALDONE @Bit 0 : Read pending status of interrupt for event CALDONE */
  #define LFRC_INTPEND_CALDONE_Pos (0UL)             /*!< Position of CALDONE field.                                           */
  #define LFRC_INTPEND_CALDONE_Msk (0x1UL << LFRC_INTPEND_CALDONE_Pos) /*!< Bit mask of CALDONE field.                         */
  #define LFRC_INTPEND_CALDONE_Min (0x0UL)           /*!< Min enumerator value of CALDONE field.                               */
  #define LFRC_INTPEND_CALDONE_Max (0x1UL)           /*!< Max enumerator value of CALDONE field.                               */
  #define LFRC_INTPEND_CALDONE_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define LFRC_INTPEND_CALDONE_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* TRIMDONE @Bit 1 : Read pending status of interrupt for event TRIMDONE */
  #define LFRC_INTPEND_TRIMDONE_Pos (1UL)            /*!< Position of TRIMDONE field.                                          */
  #define LFRC_INTPEND_TRIMDONE_Msk (0x1UL << LFRC_INTPEND_TRIMDONE_Pos) /*!< Bit mask of TRIMDONE field.                      */
  #define LFRC_INTPEND_TRIMDONE_Min (0x0UL)          /*!< Min enumerator value of TRIMDONE field.                              */
  #define LFRC_INTPEND_TRIMDONE_Max (0x1UL)          /*!< Max enumerator value of TRIMDONE field.                              */
  #define LFRC_INTPEND_TRIMDONE_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define LFRC_INTPEND_TRIMDONE_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* TRIMERROR @Bit 2 : Read pending status of interrupt for event TRIMERROR */
  #define LFRC_INTPEND_TRIMERROR_Pos (2UL)           /*!< Position of TRIMERROR field.                                         */
  #define LFRC_INTPEND_TRIMERROR_Msk (0x1UL << LFRC_INTPEND_TRIMERROR_Pos) /*!< Bit mask of TRIMERROR field.                   */
  #define LFRC_INTPEND_TRIMERROR_Min (0x0UL)         /*!< Min enumerator value of TRIMERROR field.                             */
  #define LFRC_INTPEND_TRIMERROR_Max (0x1UL)         /*!< Max enumerator value of TRIMERROR field.                             */
  #define LFRC_INTPEND_TRIMERROR_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define LFRC_INTPEND_TRIMERROR_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* CKSYNSTARTED @Bit 3 : Read pending status of interrupt for event CKSYNSTARTED */
  #define LFRC_INTPEND_CKSYNSTARTED_Pos (3UL)        /*!< Position of CKSYNSTARTED field.                                      */
  #define LFRC_INTPEND_CKSYNSTARTED_Msk (0x1UL << LFRC_INTPEND_CKSYNSTARTED_Pos) /*!< Bit mask of CKSYNSTARTED field.          */
  #define LFRC_INTPEND_CKSYNSTARTED_Min (0x0UL)      /*!< Min enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTPEND_CKSYNSTARTED_Max (0x1UL)      /*!< Max enumerator value of CKSYNSTARTED field.                          */
  #define LFRC_INTPEND_CKSYNSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define LFRC_INTPEND_CKSYNSTARTED_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* CKLFRCSTARTED @Bit 4 : Read pending status of interrupt for event CKLFRCSTARTED */
  #define LFRC_INTPEND_CKLFRCSTARTED_Pos (4UL)       /*!< Position of CKLFRCSTARTED field.                                     */
  #define LFRC_INTPEND_CKLFRCSTARTED_Msk (0x1UL << LFRC_INTPEND_CKLFRCSTARTED_Pos) /*!< Bit mask of CKLFRCSTARTED field.       */
  #define LFRC_INTPEND_CKLFRCSTARTED_Min (0x0UL)     /*!< Min enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTPEND_CKLFRCSTARTED_Max (0x1UL)     /*!< Max enumerator value of CKLFRCSTARTED field.                         */
  #define LFRC_INTPEND_CKLFRCSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define LFRC_INTPEND_CKLFRCSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFXO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct LFXO ======================================================= */
/**
  * @brief LFXO peripheral
  */
  typedef struct {                                   /*!< LFXO Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MODECHANGED;               /*!< (@ 0x00000100) LFXO mode changed                                     */
    __IOM uint32_t EVENTS_ERRORSTARTING;             /*!< (@ 0x00000104) Error while starting the LFXO in PIERCE mode          */
    __IOM uint32_t EVENTS_ERRORRUNNING;              /*!< (@ 0x00000108) Error detected while LFXO was running                 */
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) LFXO status                                           */
    __IM uint32_t RESERVED3[32];
    __IOM uint32_t CLOAD;                            /*!< (@ 0x00000484) Internal capacitive load                              */
    __IOM uint32_t AMPLITUDECTRL;                    /*!< (@ 0x00000488) Amplitude control                                     */
    __IOM uint32_t PWRUPCTRL;                        /*!< (@ 0x0000048C) Power up control                                      */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000490) LFXO mode                                             */
  } NRF_LFXO_Type;                                   /*!< Size = 1172 (0x494)                                                  */

/* LFXO_EVENTS_MODECHANGED: LFXO mode changed */
  #define LFXO_EVENTS_MODECHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MODECHANGED register.                   */

/* EVENTS_MODECHANGED @Bit 0 : LFXO mode changed */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos (0UL) /*!< Position of EVENTS_MODECHANGED field.                      */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Msk (0x1UL << LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Pos) /*!< Bit mask
                                                                            of EVENTS_MODECHANGED field.*/
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_MODECHANGED field.        */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_MODECHANGED field.        */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_NotGenerated (0x0UL) /*!< Event not generated                             */
  #define LFXO_EVENTS_MODECHANGED_EVENTS_MODECHANGED_Generated (0x1UL) /*!< Event generated                                    */


/* LFXO_EVENTS_ERRORSTARTING: Error while starting the LFXO in PIERCE mode */
  #define LFXO_EVENTS_ERRORSTARTING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORSTARTING register.               */

/* EVENTS_ERRORSTARTING @Bit 0 : Error while starting the LFXO in PIERCE mode */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Pos (0UL) /*!< Position of EVENTS_ERRORSTARTING field.                */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Msk (0x1UL << LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Pos) /*!<
                                                                            Bit mask of EVENTS_ERRORSTARTING field.*/
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORSTARTING field.  */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORSTARTING field.  */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define LFXO_EVENTS_ERRORSTARTING_EVENTS_ERRORSTARTING_Generated (0x1UL) /*!< Event generated                                */


/* LFXO_EVENTS_ERRORRUNNING: Error detected while LFXO was running */
  #define LFXO_EVENTS_ERRORRUNNING_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERRORRUNNING register.                 */

/* EVENTS_ERRORRUNNING @Bit 0 : Error detected while LFXO was running */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos (0UL) /*!< Position of EVENTS_ERRORRUNNING field.                   */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Msk (0x1UL << LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Pos) /*!< Bit
                                                                            mask of EVENTS_ERRORRUNNING field.*/
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERRORRUNNING field.     */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERRORRUNNING field.     */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define LFXO_EVENTS_ERRORRUNNING_EVENTS_ERRORRUNNING_Generated (0x1UL) /*!< Event generated                                  */


/* LFXO_INTEN: Enable or disable interrupt */
  #define LFXO_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

