NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* LFXO_INTPEND: Pending interrupts */
  #define LFXO_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* MODECHANGED @Bit 0 : Read pending status of interrupt for event MODECHANGED */
  #define LFXO_INTPEND_MODECHANGED_Pos (0UL)         /*!< Position of MODECHANGED field.                                       */
  #define LFXO_INTPEND_MODECHANGED_Msk (0x1UL << LFXO_INTPEND_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.             */
  #define LFXO_INTPEND_MODECHANGED_Min (0x0UL)       /*!< Min enumerator value of MODECHANGED field.                           */
  #define LFXO_INTPEND_MODECHANGED_Max (0x1UL)       /*!< Max enumerator value of MODECHANGED field.                           */
  #define LFXO_INTPEND_MODECHANGED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define LFXO_INTPEND_MODECHANGED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* ERRORSTARTING @Bit 1 : Read pending status of interrupt for event ERRORSTARTING */
  #define LFXO_INTPEND_ERRORSTARTING_Pos (1UL)       /*!< Position of ERRORSTARTING field.                                     */
  #define LFXO_INTPEND_ERRORSTARTING_Msk (0x1UL << LFXO_INTPEND_ERRORSTARTING_Pos) /*!< Bit mask of ERRORSTARTING field.       */
  #define LFXO_INTPEND_ERRORSTARTING_Min (0x0UL)     /*!< Min enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTPEND_ERRORSTARTING_Max (0x1UL)     /*!< Max enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTPEND_ERRORSTARTING_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define LFXO_INTPEND_ERRORSTARTING_Pending (0x1UL) /*!< Read: Pending                                                        */

/* ERRORRUNNING @Bit 2 : Read pending status of interrupt for event ERRORRUNNING */
  #define LFXO_INTPEND_ERRORRUNNING_Pos (2UL)        /*!< Position of ERRORRUNNING field.                                      */
  #define LFXO_INTPEND_ERRORRUNNING_Msk (0x1UL << LFXO_INTPEND_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.          */
  #define LFXO_INTPEND_ERRORRUNNING_Min (0x0UL)      /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTPEND_ERRORRUNNING_Max (0x1UL)      /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTPEND_ERRORRUNNING_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define LFXO_INTPEND_ERRORRUNNING_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* LFXO_STATUS: LFXO status */
  #define LFXO_STATUS_ResetValue (0x00000000UL)      /*!< Reset value of STATUS register.                                      */

/* MODE @Bits 0..1 : Current mode */
  #define LFXO_STATUS_MODE_Pos (0UL)                 /*!< Position of MODE field.                                              */
  #define LFXO_STATUS_MODE_Msk (0x3UL << LFXO_STATUS_MODE_Pos) /*!< Bit mask of MODE field.                                    */
  #define LFXO_STATUS_MODE_Min (0x0UL)               /*!< Min enumerator value of MODE field.                                  */
  #define LFXO_STATUS_MODE_Max (0x3UL)               /*!< Max enumerator value of MODE field.                                  */
  #define LFXO_STATUS_MODE_Pierce (0x0UL)            /*!< Pierce mode                                                          */
  #define LFXO_STATUS_MODE_Pixo (0x1UL)              /*!< PIXO mode                                                            */
  #define LFXO_STATUS_MODE_ExternalSine (0x2UL)      /*!< External sine wave clock                                             */
  #define LFXO_STATUS_MODE_ExternalSquare (0x3UL)    /*!< External square wave clock                                           */

/* HPMODE @Bit 4 : High performance mode */
  #define LFXO_STATUS_HPMODE_Pos (4UL)               /*!< Position of HPMODE field.                                            */
  #define LFXO_STATUS_HPMODE_Msk (0x1UL << LFXO_STATUS_HPMODE_Pos) /*!< Bit mask of HPMODE field.                              */
  #define LFXO_STATUS_HPMODE_Min (0x0UL)             /*!< Min enumerator value of HPMODE field.                                */
  #define LFXO_STATUS_HPMODE_Max (0x1UL)             /*!< Max enumerator value of HPMODE field.                                */
  #define LFXO_STATUS_HPMODE_Disabled (0x0UL)        /*!< NA                                                                   */
  #define LFXO_STATUS_HPMODE_Enabled (0x1UL)         /*!< NA                                                                   */

/* RUNNING @Bit 5 : LFXO running status */
  #define LFXO_STATUS_RUNNING_Pos (5UL)              /*!< Position of RUNNING field.                                           */
  #define LFXO_STATUS_RUNNING_Msk (0x1UL << LFXO_STATUS_RUNNING_Pos) /*!< Bit mask of RUNNING field.                           */
  #define LFXO_STATUS_RUNNING_Min (0x0UL)            /*!< Min enumerator value of RUNNING field.                               */
  #define LFXO_STATUS_RUNNING_Max (0x1UL)            /*!< Max enumerator value of RUNNING field.                               */
  #define LFXO_STATUS_RUNNING_NotRunning (0x0UL)     /*!< LFXO not running                                                     */
  #define LFXO_STATUS_RUNNING_Running (0x1UL)        /*!< LFXO running                                                         */


/* LFXO_CLOAD: Internal capacitive load */
  #define LFXO_CLOAD_ResetValue (0x00000000UL)       /*!< Reset value of CLOAD register.                                       */

/* VAL0 @Bits 0..3 : Capacitive load value */
  #define LFXO_CLOAD_VAL0_Pos (0UL)                  /*!< Position of VAL0 field.                                              */
  #define LFXO_CLOAD_VAL0_Msk (0xFUL << LFXO_CLOAD_VAL0_Pos) /*!< Bit mask of VAL0 field.                                      */

