NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* VAL1 @Bit 4 : Capacitive load value */
  #define LFXO_CLOAD_VAL1_Pos (4UL)                  /*!< Position of VAL1 field.                                              */
  #define LFXO_CLOAD_VAL1_Msk (0x1UL << LFXO_CLOAD_VAL1_Pos) /*!< Bit mask of VAL1 field.                                      */
  #define LFXO_CLOAD_VAL1_Min (0x0UL)                /*!< Min value of VAL1 field.                                             */
  #define LFXO_CLOAD_VAL1_Max (0x1UL)                /*!< Max size of VAL1 field.                                              */


/* LFXO_AMPLITUDECTRL: Amplitude control */
  #define LFXO_AMPLITUDECTRL_ResetValue (0x0110010AUL) /*!< Reset value of AMPLITUDECTRL register.                             */

/* INTERVAL @Bits 0..4 : Amplitude check interval */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Pos (0UL)      /*!< Position of INTERVAL field.                                          */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Msk (0x1FUL << LFXO_AMPLITUDECTRL_INTERVAL_Pos) /*!< Bit mask of INTERVAL field.         */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Min (0x01UL)   /*!< Min value of INTERVAL field.                                         */
  #define LFXO_AMPLITUDECTRL_INTERVAL_Max (0x1FUL)   /*!< Max size of INTERVAL field.                                          */

/* STEP @Bits 8..10 : Step to adjust the IDAC when the peak detector triggers */
  #define LFXO_AMPLITUDECTRL_STEP_Pos (8UL)          /*!< Position of STEP field.                                              */
  #define LFXO_AMPLITUDECTRL_STEP_Msk (0x7UL << LFXO_AMPLITUDECTRL_STEP_Pos) /*!< Bit mask of STEP field.                      */
  #define LFXO_AMPLITUDECTRL_STEP_Min (0x0UL)        /*!< Min value of STEP field.                                             */
  #define LFXO_AMPLITUDECTRL_STEP_Max (0x7UL)        /*!< Max size of STEP field.                                              */

/* IDACINIT @Bits 16..20 : Initial IDAC code for the pierce oscillator */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Pos (16UL)     /*!< Position of IDACINIT field.                                          */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Msk (0x1FUL << LFXO_AMPLITUDECTRL_IDACINIT_Pos) /*!< Bit mask of IDACINIT field.         */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Min (0x00UL)   /*!< Min value of IDACINIT field.                                         */
  #define LFXO_AMPLITUDECTRL_IDACINIT_Max (0x1FUL)   /*!< Max size of IDACINIT field.                                          */

/* PDCTRL @Bit 24 : Peak detector control */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Pos (24UL)       /*!< Position of PDCTRL field.                                            */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Msk (0x1UL << LFXO_AMPLITUDECTRL_PDCTRL_Pos) /*!< Bit mask of PDCTRL field.                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Min (0x0UL)      /*!< Min enumerator value of PDCTRL field.                                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Max (0x1UL)      /*!< Max enumerator value of PDCTRL field.                                */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Disabled (0x0UL) /*!< Peak detector disabled                                               */
  #define LFXO_AMPLITUDECTRL_PDCTRL_Enabled (0x1UL)  /*!< Peak detector enabled                                                */


/* LFXO_PWRUPCTRL: Power up control */
  #define LFXO_PWRUPCTRL_ResetValue (0x00000000UL)   /*!< Reset value of PWRUPCTRL register.                                   */

/* CTRL @Bits 0..1 : Power up control */
  #define LFXO_PWRUPCTRL_CTRL_Pos (0UL)              /*!< Position of CTRL field.                                              */
  #define LFXO_PWRUPCTRL_CTRL_Msk (0x3UL << LFXO_PWRUPCTRL_CTRL_Pos) /*!< Bit mask of CTRL field.                              */
  #define LFXO_PWRUPCTRL_CTRL_Min (0x0UL)            /*!< Min enumerator value of CTRL field.                                  */
  #define LFXO_PWRUPCTRL_CTRL_Max (0x2UL)            /*!< Max enumerator value of CTRL field.                                  */
  #define LFXO_PWRUPCTRL_CTRL_Auto (0x0UL)           /*!< Automatically handled by the peripheral                              */
  #define LFXO_PWRUPCTRL_CTRL_PowerUp (0x1UL)        /*!< Power up                                                             */
  #define LFXO_PWRUPCTRL_CTRL_PowerDown (0x2UL)      /*!< Power down                                                           */


/* LFXO_MODE: LFXO mode */
  #define LFXO_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Mode */
  #define LFXO_MODE_MODE_Pos (0UL)                   /*!< Position of MODE field.                                              */
  #define LFXO_MODE_MODE_Msk (0x3UL << LFXO_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                        */
  #define LFXO_MODE_MODE_Min (0x0UL)                 /*!< Min enumerator value of MODE field.                                  */
  #define LFXO_MODE_MODE_Max (0x3UL)                 /*!< Max enumerator value of MODE field.                                  */
  #define LFXO_MODE_MODE_Pierce (0x0UL)              /*!< Pierce mode                                                          */
  #define LFXO_MODE_MODE_Pixo (0x1UL)                /*!< PIXO mode                                                            */
  #define LFXO_MODE_MODE_ExternalSine (0x2UL)        /*!< External sine wave clock                                             */
  #define LFXO_MODE_MODE_ExternalSquare (0x3UL)      /*!< External square wave clock                                           */

/* HPMODE @Bit 4 : High performance mode */
  #define LFXO_MODE_HPMODE_Pos (4UL)                 /*!< Position of HPMODE field.                                            */
  #define LFXO_MODE_HPMODE_Msk (0x1UL << LFXO_MODE_HPMODE_Pos) /*!< Bit mask of HPMODE field.                                  */
  #define LFXO_MODE_HPMODE_Min (0x0UL)               /*!< Min enumerator value of HPMODE field.                                */
  #define LFXO_MODE_HPMODE_Max (0x1UL)               /*!< Max enumerator value of HPMODE field.                                */
  #define LFXO_MODE_HPMODE_Disabled (0x0UL)          /*!< Disable high performance mode                                        */
  #define LFXO_MODE_HPMODE_Enabled (0x1UL)           /*!< Enable high performance mode                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LPCOMP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct LPCOMP ====================================================== */
/**
  * @brief Low-power comparator
  */
  typedef struct {                                   /*!< LPCOMP Structure                                                     */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value. This task requires that LPCOMP
                                                                         has been started by the START task.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) LPCOMP is ready and output is valid                   */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable LPCOMP                                         */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Input pin select                                      */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference select                                      */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t ANADETECT;                        /*!< (@ 0x00000520) Analog detect configuration                           */
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
  } NRF_LPCOMP_Type;                                 /*!< Size = 1340 (0x53C)                                                  */

/* LPCOMP_TASKS_START: Start comparator */
  #define LPCOMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                               */

