NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* LRCCONF_CLKCTRL_ALWAYSRUN: Force the clock [n] and tree running always */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_ResetValue (0x00000000UL) /*!< Reset value of ALWAYSRUN register.                          */

/* FORCE @Bit 0 : Force the clock always running */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Pos (0UL)  /*!< Position of FORCE field.                                             */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Msk (0x1UL << LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Pos) /*!< Bit mask of FORCE field.     */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Min (0x0UL) /*!< Min enumerator value of FORCE field.                                */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Max (0x1UL) /*!< Max enumerator value of FORCE field.                                */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Automatic (0x0UL) /*!< Automatic clock control enabled                               */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_AlwaysRun (0x1UL) /*!< Clock always running                                          */


/* LRCCONF_CLKCTRL_SRC: Select the clock source for clock [n] */
  #define LRCCONF_CLKCTRL_SRC_ResetValue (0x00000000UL) /*!< Reset value of SRC register.                                      */

/* SRC @Bit 0 : Clock source */
  #define LRCCONF_CLKCTRL_SRC_SRC_Pos (0UL)          /*!< Position of SRC field.                                               */
  #define LRCCONF_CLKCTRL_SRC_SRC_Msk (0x1UL << LRCCONF_CLKCTRL_SRC_SRC_Pos) /*!< Bit mask of SRC field.                       */
  #define LRCCONF_CLKCTRL_SRC_SRC_Min (0x0UL)        /*!< Min enumerator value of SRC field.                                   */
  #define LRCCONF_CLKCTRL_SRC_SRC_Max (0x1UL)        /*!< Max enumerator value of SRC field.                                   */
  #define LRCCONF_CLKCTRL_SRC_SRC_OpenLoop (0x0UL)   /*!< Open loop.                                                           */
  #define LRCCONF_CLKCTRL_SRC_SRC_ClosedLoop (0x1UL) /*!< Closed loop.                                                         */

/* BYPASS @Bit 1 : Clock source bypass */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Pos (1UL)       /*!< Position of BYPASS field.                                            */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Msk (0x1UL << LRCCONF_CLKCTRL_SRC_BYPASS_Pos) /*!< Bit mask of BYPASS field.              */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Min (0x0UL)     /*!< Min enumerator value of BYPASS field.                                */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Max (0x1UL)     /*!< Max enumerator value of BYPASS field.                                */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Disable (0x0UL) /*!< Disable the clock source bypass                                      */
  #define LRCCONF_CLKCTRL_SRC_BYPASS_Enable (0x1UL)  /*!< Enable the clock source bypass                                       */


/* ===================================================== Struct LRCCONF ====================================================== */
/**
  * @brief LRCCONF
  */
  typedef struct {                                   /*!< LRCCONF Structure                                                    */
    __OM uint32_t TASKS_REQCLKSRC[8];                /*!< (@ 0x00000000) Request the clock source for clock [n]                */
    __OM uint32_t TASKS_STOPREQCLKSRC[8];            /*!< (@ 0x00000020) Stop requesting the clock source for clock [n]        */
    __OM NRF_LRCCONF_TASKS_CONSTLAT_Type TASKS_CONSTLAT; /*!< (@ 0x00000040) Peripheral tasks.                                 */
    __OM NRF_LRCCONF_TASKS_SYSTEMOFF_Type TASKS_SYSTEMOFF; /*!< (@ 0x00000048) Peripheral tasks.                               */
    __OM uint32_t TASKS_REQHFXO;                     /*!< (@ 0x00000050) Request HFXO                                          */
    __OM uint32_t TASKS_STOPREQHFXO;                 /*!< (@ 0x00000054) Stop requesting HFXO                                  */
    __IM uint32_t RESERVED[42];
    __IOM uint32_t EVENTS_CLKSRCSTARTED[8];          /*!< (@ 0x00000100) Clock source is started for clock [n]                 */
    __IOM uint32_t EVENTS_HFXOSTARTED;               /*!< (@ 0x00000120) HFXO is started                                       */
    __IM uint32_t RESERVED1[183];
    __IOM NRF_LRCCONF_CLKSTAT_Type CLKSTAT[8];       /*!< (@ 0x00000400) (unspecified)                                         */
    __IOM NRF_LRCCONF_CLKCTRL_Type CLKCTRL[8];       /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t CONSTLATSTAT;                      /*!< (@ 0x00000480) Status of constant latency                            */
    __IM uint32_t RESERVED2[3];
    __IOM uint32_t POWERON;                          /*!< (@ 0x00000490) Force power domain ON                                 */
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000494) Retain power domain                                   */
    __IM uint32_t RESERVED3[26];
    __IOM uint32_t AX2XWAITSTATES[16];               /*!< (@ 0x00000500) AX2X bridge waitstates for the domain [n], where n is
                                                                         the Domain ID.*/
  } NRF_LRCCONF_Type;                                /*!< Size = 1344 (0x540)                                                  */

/* LRCCONF_TASKS_REQCLKSRC: Request the clock source for clock [n] */
  #define LRCCONF_TASKS_REQCLKSRC_MaxCount (8UL)     /*!< Max size of TASKS_REQCLKSRC[8] array.                                */
  #define LRCCONF_TASKS_REQCLKSRC_MaxIndex (7UL)     /*!< Max index of TASKS_REQCLKSRC[8] array.                               */
  #define LRCCONF_TASKS_REQCLKSRC_MinIndex (0UL)     /*!< Min index of TASKS_REQCLKSRC[8] array.                               */
  #define LRCCONF_TASKS_REQCLKSRC_ResetValue (0x00000000UL) /*!< Reset value of TASKS_REQCLKSRC[8] register.                   */

/* TASKS_REQCLKSRC @Bit 0 : Request the clock source for clock [n] */
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Pos (0UL) /*!< Position of TASKS_REQCLKSRC field.                            */
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Msk (0x1UL << LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Pos) /*!< Bit mask of
                                                                            TASKS_REQCLKSRC field.*/
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Min (0x1UL) /*!< Min enumerator value of TASKS_REQCLKSRC field.              */
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Max (0x1UL) /*!< Max enumerator value of TASKS_REQCLKSRC field.              */
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Trigger (0x1UL) /*!< Trigger task                                            */


/* LRCCONF_TASKS_STOPREQCLKSRC: Stop requesting the clock source for clock [n] */
  #define LRCCONF_TASKS_STOPREQCLKSRC_MaxCount (8UL) /*!< Max size of TASKS_STOPREQCLKSRC[8] array.                            */
  #define LRCCONF_TASKS_STOPREQCLKSRC_MaxIndex (7UL) /*!< Max index of TASKS_STOPREQCLKSRC[8] array.                           */
  #define LRCCONF_TASKS_STOPREQCLKSRC_MinIndex (0UL) /*!< Min index of TASKS_STOPREQCLKSRC[8] array.                           */
  #define LRCCONF_TASKS_STOPREQCLKSRC_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPREQCLKSRC[8] register.           */

/* TASKS_STOPREQCLKSRC @Bit 0 : Stop requesting the clock source for clock [n] */
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Pos (0UL) /*!< Position of TASKS_STOPREQCLKSRC field.                */
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Msk (0x1UL << LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Pos)
                                                                            /*!< Bit mask of TASKS_STOPREQCLKSRC field.*/
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPREQCLKSRC field.  */
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPREQCLKSRC field.  */
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Trigger (0x1UL) /*!< Trigger task                                    */


/* LRCCONF_TASKS_REQHFXO: Request HFXO */
  #define LRCCONF_TASKS_REQHFXO_ResetValue (0x00000000UL) /*!< Reset value of TASKS_REQHFXO register.                          */

/* TASKS_REQHFXO @Bit 0 : Request HFXO */
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Pos (0UL) /*!< Position of TASKS_REQHFXO field.                                  */
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Msk (0x1UL << LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Pos) /*!< Bit mask of
                                                                            TASKS_REQHFXO field.*/
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Min (0x1UL) /*!< Min enumerator value of TASKS_REQHFXO field.                    */
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Max (0x1UL) /*!< Max enumerator value of TASKS_REQHFXO field.                    */
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Trigger (0x1UL) /*!< Trigger task                                                */


/* LRCCONF_TASKS_STOPREQHFXO: Stop requesting HFXO */
  #define LRCCONF_TASKS_STOPREQHFXO_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPREQHFXO register.                  */

/* TASKS_STOPREQHFXO @Bit 0 : Stop requesting HFXO */
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Pos (0UL) /*!< Position of TASKS_STOPREQHFXO field.                      */
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Msk (0x1UL << LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Pos) /*!< Bit
                                                                            mask of TASKS_STOPREQHFXO field.*/
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPREQHFXO field.        */
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPREQHFXO field.        */
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Trigger (0x1UL) /*!< Trigger task                                        */


/* LRCCONF_EVENTS_CLKSRCSTARTED: Clock source is started for clock [n] */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MaxCount (8UL) /*!< Max size of EVENTS_CLKSRCSTARTED[8] array.                          */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MaxIndex (7UL) /*!< Max index of EVENTS_CLKSRCSTARTED[8] array.                         */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MinIndex (0UL) /*!< Min index of EVENTS_CLKSRCSTARTED[8] array.                         */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CLKSRCSTARTED[8] register.         */

/* EVENTS_CLKSRCSTARTED @Bit 0 : Clock source is started for clock [n] */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Pos (0UL) /*!< Position of EVENTS_CLKSRCSTARTED field.             */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Msk (0x1UL << LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Pos)
                                                                            /*!< Bit mask of EVENTS_CLKSRCSTARTED field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CLKSRCSTARTED
                                                                            field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CLKSRCSTARTED
                                                                            field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Generated (0x1UL) /*!< Event generated                             */


