NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ENABLE @Bit 31 : Enable the automatic power down feature. */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos (31UL) /*!< Position of ENABLE field.                                           */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Msk (0x1UL << MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Pos) /*!< Bit mask of ENABLE field.  */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                              */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Disable (0x0UL) /*!< Disable the automatic power down feature                       */
  #define MRAMC_POWER_AUTOPOWERDOWN_ENABLE_Enable (0x1UL) /*!< Enable the automatic power down feature                         */


/* MRAMC_POWER_STATUS: Status of the power up/down sequence. */
  #define MRAMC_POWER_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                    */

/* STATE @Bits 0..3 : The current power up/down state. */
  #define MRAMC_POWER_STATUS_STATE_Pos (0UL)         /*!< Position of STATE field.                                             */
  #define MRAMC_POWER_STATUS_STATE_Msk (0xFUL << MRAMC_POWER_STATUS_STATE_Pos) /*!< Bit mask of STATE field.                   */
  #define MRAMC_POWER_STATUS_STATE_Min (0x0UL)       /*!< Min enumerator value of STATE field.                                 */
  #define MRAMC_POWER_STATUS_STATE_Max (0x8UL)       /*!< Max enumerator value of STATE field.                                 */
  #define MRAMC_POWER_STATUS_STATE_Off (0x0UL)       /*!< MRAM is OFF                                                          */
  #define MRAMC_POWER_STATUS_STATE_PowerUpSeq (0x1UL) /*!< MRAM power up sequence is active                                    */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigSeq (0x2UL) /*!< Request for the MRAM trim configuration.                         */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigWait (0x3UL) /*!< Waiting for the MRAM trim configuration to complete.            */
  #define MRAMC_POWER_STATUS_STATE_TrimConfigDone (0x4UL) /*!< The MRAM trim configuration to completed (This is momentary
                                                               state).*/
  #define MRAMC_POWER_STATUS_STATE_Standby (0x5UL)   /*!< MRAM is in standby mode.                                             */
  #define MRAMC_POWER_STATUS_STATE_Active (0x6UL)    /*!< MRAM is in active mode (or in standby mode)                          */
  #define MRAMC_POWER_STATUS_STATE_PowerDownSeq (0x7UL) /*!< MRAM power down sequence is active                                */
  #define MRAMC_POWER_STATUS_STATE_OffTrimRetain (0x8UL) /*!< MRAM is OFF with trim configuration in retain                    */


/* MRAMC_POWER_POWERUPACK: Status of the power control signals acknowledgement during power up sequence. */
  #define MRAMC_POWER_POWERUPACK_ResetValue (0x00000000UL) /*!< Reset value of POWERUPACK register.                            */

/* VREFVPR @Bit 0 : Waiting for VREF and VPR up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Pos (0UL)   /*!< Position of VREFVPR field.                                           */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VREFVPR_Pos) /*!< Bit mask of VREFVPR field.     */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Min (0x0UL) /*!< Min enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Max (0x1UL) /*!< Max enumerator value of VREFVPR field.                               */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Busy (0x0UL) /*!< Busy                                                                */
  #define MRAMC_POWER_POWERUPACK_VREFVPR_Ready (0x1UL) /*!< Ready                                                              */

/* VDD @Bit 2 : Waiting for VDD up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDD_Pos (2UL)       /*!< Position of VDD field.                                               */
  #define MRAMC_POWER_POWERUPACK_VDD_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDD_Pos) /*!< Bit mask of VDD field.                 */
  #define MRAMC_POWER_POWERUPACK_VDD_Min (0x0UL)     /*!< Min enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERUPACK_VDD_Max (0x1UL)     /*!< Max enumerator value of VDD field.                                   */
  #define MRAMC_POWER_POWERUPACK_VDD_Busy (0x0UL)    /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDD_Ready (0x1UL)   /*!< Ready                                                                */

/* VDDCFG @Bit 3 : Waiting for VDD_CFG up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Pos (3UL)    /*!< Position of VDDCFG field.                                            */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDDCFG_Pos) /*!< Bit mask of VDDCFG field.        */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Min (0x0UL)  /*!< Min enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Max (0x1UL)  /*!< Max enumerator value of VDDCFG field.                                */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Busy (0x0UL) /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDDCFG_Ready (0x1UL) /*!< Ready                                                               */

/* VDDA @Bit 4 : Waiting for VDDA up ACK or not */
  #define MRAMC_POWER_POWERUPACK_VDDA_Pos (4UL)      /*!< Position of VDDA field.                                              */
  #define MRAMC_POWER_POWERUPACK_VDDA_Msk (0x1UL << MRAMC_POWER_POWERUPACK_VDDA_Pos) /*!< Bit mask of VDDA field.              */
  #define MRAMC_POWER_POWERUPACK_VDDA_Min (0x0UL)    /*!< Min enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERUPACK_VDDA_Max (0x1UL)    /*!< Max enumerator value of VDDA field.                                  */
  #define MRAMC_POWER_POWERUPACK_VDDA_Busy (0x0UL)   /*!< Busy                                                                 */
  #define MRAMC_POWER_POWERUPACK_VDDA_Ready (0x1UL)  /*!< Ready                                                                */


