NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* =================================================== Struct MRAMC_REGION =================================================== */
/**
  * @brief REGION [MRAMC_REGION] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_MRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define MRAMC_REGION_MaxCount (6UL)                /*!< Size of REGION[6] array.                                             */
  #define MRAMC_REGION_MaxIndex (5UL)                /*!< Max index of REGION[6] array.                                        */
  #define MRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[6] array.                                        */

/* MRAMC_REGION_ADDRESS: Region address */
  #define MRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

/* STARTADDR @Bits 0..31 : Start address of the region [n] */
  #define MRAMC_REGION_ADDRESS_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define MRAMC_REGION_ADDRESS_STARTADDR_Msk (0xFFFFFFFFUL << MRAMC_REGION_ADDRESS_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MRAMC_REGION_CONFIG: Region configuration */
  #define MRAMC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                   */

/* READ @Bit 0 : Read access */
  #define MRAMC_REGION_CONFIG_READ_Pos (0UL)         /*!< Position of READ field.                                              */
  #define MRAMC_REGION_CONFIG_READ_Msk (0x1UL << MRAMC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                    */
  #define MRAMC_REGION_CONFIG_READ_Min (0x0UL)       /*!< Min enumerator value of READ field.                                  */
  #define MRAMC_REGION_CONFIG_READ_Max (0x1UL)       /*!< Max enumerator value of READ field.                                  */
  #define MRAMC_REGION_CONFIG_READ_NotAllowed (0x0UL) /*!< Read access to override region [n] is not allowed                   */
  #define MRAMC_REGION_CONFIG_READ_Allowed (0x1UL)   /*!< Read access to override region [n] is allowed                        */

/* WRITE @Bit 1 : Write access */
  #define MRAMC_REGION_CONFIG_WRITE_Pos (1UL)        /*!< Position of WRITE field.                                             */
  #define MRAMC_REGION_CONFIG_WRITE_Msk (0x1UL << MRAMC_REGION_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                 */
  #define MRAMC_REGION_CONFIG_WRITE_Min (0x0UL)      /*!< Min enumerator value of WRITE field.                                 */
  #define MRAMC_REGION_CONFIG_WRITE_Max (0x1UL)      /*!< Max enumerator value of WRITE field.                                 */
  #define MRAMC_REGION_CONFIG_WRITE_NotAllowed (0x0UL) /*!< Write access to override region [n] is not allowed                 */
  #define MRAMC_REGION_CONFIG_WRITE_Allowed (0x1UL)  /*!< Write access to override region [n] is allowed                       */

/* EXECUTE @Bit 2 : Execute access */
  #define MRAMC_REGION_CONFIG_EXECUTE_Pos (2UL)      /*!< Position of EXECUTE field.                                           */
  #define MRAMC_REGION_CONFIG_EXECUTE_Msk (0x1UL << MRAMC_REGION_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.           */
  #define MRAMC_REGION_CONFIG_EXECUTE_Min (0x0UL)    /*!< Min enumerator value of EXECUTE field.                               */
  #define MRAMC_REGION_CONFIG_EXECUTE_Max (0x1UL)    /*!< Max enumerator value of EXECUTE field.                               */
  #define MRAMC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL) /*!< Execute access to override region [n] is not allowed             */
  #define MRAMC_REGION_CONFIG_EXECUTE_Allowed (0x1UL) /*!< Execute access to override region [n] is allowed                    */

/* SECURE @Bit 3 : Secure access */
  #define MRAMC_REGION_CONFIG_SECURE_Pos (3UL)       /*!< Position of SECURE field.                                            */
  #define MRAMC_REGION_CONFIG_SECURE_Msk (0x1UL << MRAMC_REGION_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.              */
  #define MRAMC_REGION_CONFIG_SECURE_Min (0x0UL)     /*!< Min enumerator value of SECURE field.                                */
  #define MRAMC_REGION_CONFIG_SECURE_Max (0x1UL)     /*!< Max enumerator value of SECURE field.                                */
  #define MRAMC_REGION_CONFIG_SECURE_NonSecure (0x0UL) /*!< Both Secure and non-Secure access to override region [n] is allowed*/
  #define MRAMC_REGION_CONFIG_SECURE_Secure (0x1UL)  /*!< Only secure access to override region [n] is allowed                 */

/* OWNER @Bits 4..7 : Owner ID */
  #define MRAMC_REGION_CONFIG_OWNER_Pos (4UL)        /*!< Position of OWNER field.                                             */
  #define MRAMC_REGION_CONFIG_OWNER_Msk (0xFUL << MRAMC_REGION_CONFIG_OWNER_Pos) /*!< Bit mask of OWNER field.                 */
  #define MRAMC_REGION_CONFIG_OWNER_Min (0x0UL)      /*!< Min enumerator value of OWNER field.                                 */
  #define MRAMC_REGION_CONFIG_OWNER_Max (0x0UL)      /*!< Max enumerator value of OWNER field.                                 */
  #define MRAMC_REGION_CONFIG_OWNER_NotEnforced (0x0UL) /*!< Owner ID protection is not enforced                               */

/* WRITEONCE @Bit 12 : Write-once */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Pos (12UL)   /*!< Position of WRITEONCE field.                                         */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Msk (0x1UL << MRAMC_REGION_CONFIG_WRITEONCE_Pos) /*!< Bit mask of WRITEONCE field.     */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Min (0x0UL)  /*!< Min enumerator value of WRITEONCE field.                             */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Max (0x1UL)  /*!< Max enumerator value of WRITEONCE field.                             */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Disabled (0x0UL) /*!< Write-once disabled                                              */
  #define MRAMC_REGION_CONFIG_WRITEONCE_Enabled (0x1UL) /*!< Write-once enabled                                                */

/* LOCK @Bit 13 : Enable lock */
  #define MRAMC_REGION_CONFIG_LOCK_Pos (13UL)        /*!< Position of LOCK field.                                              */
  #define MRAMC_REGION_CONFIG_LOCK_Msk (0x1UL << MRAMC_REGION_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define MRAMC_REGION_CONFIG_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define MRAMC_REGION_CONFIG_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define MRAMC_REGION_CONFIG_LOCK_Disabled (0x0UL)  /*!< Lock disabled for region [n]                                         */
  #define MRAMC_REGION_CONFIG_LOCK_Enabled (0x1UL)   /*!< Lock enabled for region [n]                                          */

/* SIZE @Bits 16..20 : Size in KBytes of region [n] */
  #define MRAMC_REGION_CONFIG_SIZE_Pos (16UL)        /*!< Position of SIZE field.                                              */
  #define MRAMC_REGION_CONFIG_SIZE_Msk (0x1FUL << MRAMC_REGION_CONFIG_SIZE_Pos) /*!< Bit mask of SIZE field.                   */


/* ====================================================== Struct MRAMC ======================================================= */
/**
  * @brief MRAM controller
  */
  typedef struct {                                   /*!< MRAMC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Current operation is completed                        */
    __IOM uint32_t EVENTS_READYNEXT;                 /*!< (@ 0x00000104) Ready to accept a new write operation                 */
    __IOM uint32_t EVENTS_ECCERROR;                  /*!< (@ 0x00000108) ECC error detected but not corrected.                 */
    __IOM uint32_t EVENTS_ECCERRORCORR;              /*!< (@ 0x0000010C) ECC error detected and corrected.                     */
    __IOM uint32_t EVENTS_TRIMCONFIGREQ;             /*!< (@ 0x00000110) MRAM trim configuration request. The MRAMC is ready for
                                                                         the MRAM trim configuration.*/
    __IOM uint32_t EVENTS_ACCESSERR;                 /*!< (@ 0x00000114) MRAM access error.                                    */
    __IM uint32_t RESERVED1[122];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) MRAMC current operation status.                       */
    __IM uint32_t READYNEXT;                         /*!< (@ 0x00000404) Ready next flag.                                      */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MRAMC_ECC_Type ECC;                    /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[56];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000500) Configuration register                                */
    __IOM uint32_t AUTOREADMODE;                     /*!< (@ 0x00000504) Automatically disables the write and erases on timeout
                                                                         and enters into read mode.*/
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000508) Waitstates for MRAM read access                       */
    __IOM uint32_t READYNEXTTIMEOUT;                 /*!< (@ 0x0000050C) Preload timeout value for waiting for a next write    */
    __IOM NRF_MRAMC_LOWAVGCURR_Type LOWAVGCURR;      /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM NRF_MRAMC_POWER_Type POWER;                /*!< (@ 0x00000520) (unspecified)                                         */
    __IM uint32_t RESERVED6[2];
    __IOM NRF_MRAMC_TRIM_Type TRIM;                  /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED7[2];
    __IOM NRF_MRAMC_ERASE_Type ERASE;                /*!< (@ 0x00000560) (unspecified)                                         */
    __IM uint32_t RESERVED8[3];
    __IOM NRF_MRAMC_CONFIGNVR_Type CONFIGNVR;        /*!< (@ 0x00000580) (unspecified)                                         */
    __IM uint32_t RESERVED9[4];
    __IOM NRF_MRAMC_REGION_Type REGION[6];           /*!< (@ 0x000005A0) (unspecified)                                         */
  } NRF_MRAMC_Type;                                  /*!< Size = 1488 (0x5D0)                                                  */

/* MRAMC_EVENTS_READY: Current operation is completed */
  #define MRAMC_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

