NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define MRAMC_INTEN_READY_Pos (0UL)                /*!< Position of READY field.                                             */
  #define MRAMC_INTEN_READY_Msk (0x1UL << MRAMC_INTEN_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define MRAMC_INTEN_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTEN_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTEN_READY_Disabled (0x0UL)         /*!< Disable                                                              */
  #define MRAMC_INTEN_READY_Enabled (0x1UL)          /*!< Enable                                                               */

/* READYNEXT @Bit 1 : Enable or disable interrupt for event READYNEXT */
  #define MRAMC_INTEN_READYNEXT_Pos (1UL)            /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTEN_READYNEXT_Msk (0x1UL << MRAMC_INTEN_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                     */
  #define MRAMC_INTEN_READYNEXT_Min (0x0UL)          /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTEN_READYNEXT_Max (0x1UL)          /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTEN_READYNEXT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MRAMC_INTEN_READYNEXT_Enabled (0x1UL)      /*!< Enable                                                               */

/* ECCERROR @Bit 2 : Enable or disable interrupt for event ECCERROR */
  #define MRAMC_INTEN_ECCERROR_Pos (2UL)             /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTEN_ECCERROR_Msk (0x1UL << MRAMC_INTEN_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                        */
  #define MRAMC_INTEN_ECCERROR_Min (0x0UL)           /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTEN_ECCERROR_Max (0x1UL)           /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTEN_ECCERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define MRAMC_INTEN_ECCERROR_Enabled (0x1UL)       /*!< Enable                                                               */

/* ECCERRORCORR @Bit 3 : Enable or disable interrupt for event ECCERRORCORR */
  #define MRAMC_INTEN_ECCERRORCORR_Pos (3UL)         /*!< Position of ECCERRORCORR field.                                      */
  #define MRAMC_INTEN_ECCERRORCORR_Msk (0x1UL << MRAMC_INTEN_ECCERRORCORR_Pos) /*!< Bit mask of ECCERRORCORR field.            */
  #define MRAMC_INTEN_ECCERRORCORR_Min (0x0UL)       /*!< Min enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTEN_ECCERRORCORR_Max (0x1UL)       /*!< Max enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTEN_ECCERRORCORR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define MRAMC_INTEN_ECCERRORCORR_Enabled (0x1UL)   /*!< Enable                                                               */

/* TRIMCONFIGREQ @Bit 4 : Enable or disable interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Pos (4UL)        /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTEN_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Min (0x0UL)      /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Max (0x1UL)      /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Disabled (0x0UL) /*!< Disable                                                              */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Enabled (0x1UL)  /*!< Enable                                                               */

/* ACCESSERR @Bit 5 : Enable or disable interrupt for event ACCESSERR */
  #define MRAMC_INTEN_ACCESSERR_Pos (5UL)            /*!< Position of ACCESSERR field.                                         */
  #define MRAMC_INTEN_ACCESSERR_Msk (0x1UL << MRAMC_INTEN_ACCESSERR_Pos) /*!< Bit mask of ACCESSERR field.                     */
  #define MRAMC_INTEN_ACCESSERR_Min (0x0UL)          /*!< Min enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTEN_ACCESSERR_Max (0x1UL)          /*!< Max enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTEN_ACCESSERR_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MRAMC_INTEN_ACCESSERR_Enabled (0x1UL)      /*!< Enable                                                               */


/* MRAMC_INTENSET: Enable interrupt */
  #define MRAMC_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define MRAMC_INTENSET_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define MRAMC_INTENSET_READY_Msk (0x1UL << MRAMC_INTENSET_READY_Pos) /*!< Bit mask of READY field.                           */
  #define MRAMC_INTENSET_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTENSET_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTENSET_READY_Set (0x1UL)           /*!< Enable                                                               */
  #define MRAMC_INTENSET_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to enable interrupt for event READYNEXT */
  #define MRAMC_INTENSET_READYNEXT_Pos (1UL)         /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTENSET_READYNEXT_Msk (0x1UL << MRAMC_INTENSET_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define MRAMC_INTENSET_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENSET_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENSET_READYNEXT_Set (0x1UL)       /*!< Enable                                                               */
  #define MRAMC_INTENSET_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ECCERROR @Bit 2 : Write '1' to enable interrupt for event ECCERROR */
  #define MRAMC_INTENSET_ECCERROR_Pos (2UL)          /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTENSET_ECCERROR_Msk (0x1UL << MRAMC_INTENSET_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                  */
  #define MRAMC_INTENSET_ECCERROR_Min (0x0UL)        /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENSET_ECCERROR_Max (0x1UL)        /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENSET_ECCERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define MRAMC_INTENSET_ECCERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_ECCERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ECCERRORCORR @Bit 3 : Write '1' to enable interrupt for event ECCERRORCORR */
  #define MRAMC_INTENSET_ECCERRORCORR_Pos (3UL)      /*!< Position of ECCERRORCORR field.                                      */
  #define MRAMC_INTENSET_ECCERRORCORR_Msk (0x1UL << MRAMC_INTENSET_ECCERRORCORR_Pos) /*!< Bit mask of ECCERRORCORR field.      */
  #define MRAMC_INTENSET_ECCERRORCORR_Min (0x0UL)    /*!< Min enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTENSET_ECCERRORCORR_Max (0x1UL)    /*!< Max enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTENSET_ECCERRORCORR_Set (0x1UL)    /*!< Enable                                                               */
  #define MRAMC_INTENSET_ECCERRORCORR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MRAMC_INTENSET_ECCERRORCORR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TRIMCONFIGREQ @Bit 4 : Write '1' to enable interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Pos (4UL)     /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTENSET_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.   */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Min (0x0UL)   /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Max (0x1UL)   /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Set (0x1UL)   /*!< Enable                                                               */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Enabled (0x1UL) /*!< Read: Enabled                                                      */

