NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ACCESSERR @Bit 5 : Write '1' to enable interrupt for event ACCESSERR */
  #define MRAMC_INTENSET_ACCESSERR_Pos (5UL)         /*!< Position of ACCESSERR field.                                         */
  #define MRAMC_INTENSET_ACCESSERR_Msk (0x1UL << MRAMC_INTENSET_ACCESSERR_Pos) /*!< Bit mask of ACCESSERR field.               */
  #define MRAMC_INTENSET_ACCESSERR_Min (0x0UL)       /*!< Min enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTENSET_ACCESSERR_Max (0x1UL)       /*!< Max enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTENSET_ACCESSERR_Set (0x1UL)       /*!< Enable                                                               */
  #define MRAMC_INTENSET_ACCESSERR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_ACCESSERR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* MRAMC_INTENCLR: Disable interrupt */
  #define MRAMC_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define MRAMC_INTENCLR_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define MRAMC_INTENCLR_READY_Msk (0x1UL << MRAMC_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                           */
  #define MRAMC_INTENCLR_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTENCLR_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTENCLR_READY_Clear (0x1UL)         /*!< Disable                                                              */
  #define MRAMC_INTENCLR_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to disable interrupt for event READYNEXT */
  #define MRAMC_INTENCLR_READYNEXT_Pos (1UL)         /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTENCLR_READYNEXT_Msk (0x1UL << MRAMC_INTENCLR_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define MRAMC_INTENCLR_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENCLR_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENCLR_READYNEXT_Clear (0x1UL)     /*!< Disable                                                              */
  #define MRAMC_INTENCLR_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ECCERROR @Bit 2 : Write '1' to disable interrupt for event ECCERROR */
  #define MRAMC_INTENCLR_ECCERROR_Pos (2UL)          /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTENCLR_ECCERROR_Msk (0x1UL << MRAMC_INTENCLR_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                  */
  #define MRAMC_INTENCLR_ECCERROR_Min (0x0UL)        /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENCLR_ECCERROR_Max (0x1UL)        /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENCLR_ECCERROR_Clear (0x1UL)      /*!< Disable                                                              */
  #define MRAMC_INTENCLR_ECCERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_ECCERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ECCERRORCORR @Bit 3 : Write '1' to disable interrupt for event ECCERRORCORR */
  #define MRAMC_INTENCLR_ECCERRORCORR_Pos (3UL)      /*!< Position of ECCERRORCORR field.                                      */
  #define MRAMC_INTENCLR_ECCERRORCORR_Msk (0x1UL << MRAMC_INTENCLR_ECCERRORCORR_Pos) /*!< Bit mask of ECCERRORCORR field.      */
  #define MRAMC_INTENCLR_ECCERRORCORR_Min (0x0UL)    /*!< Min enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTENCLR_ECCERRORCORR_Max (0x1UL)    /*!< Max enumerator value of ECCERRORCORR field.                          */
  #define MRAMC_INTENCLR_ECCERRORCORR_Clear (0x1UL)  /*!< Disable                                                              */
  #define MRAMC_INTENCLR_ECCERRORCORR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MRAMC_INTENCLR_ECCERRORCORR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TRIMCONFIGREQ @Bit 4 : Write '1' to disable interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Pos (4UL)     /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTENCLR_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.   */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Min (0x0UL)   /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Max (0x1UL)   /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Clear (0x1UL) /*!< Disable                                                              */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define MRAMC_INTENCLR_TRIMCONFIGREQ_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* ACCESSERR @Bit 5 : Write '1' to disable interrupt for event ACCESSERR */
  #define MRAMC_INTENCLR_ACCESSERR_Pos (5UL)         /*!< Position of ACCESSERR field.                                         */
  #define MRAMC_INTENCLR_ACCESSERR_Msk (0x1UL << MRAMC_INTENCLR_ACCESSERR_Pos) /*!< Bit mask of ACCESSERR field.               */
  #define MRAMC_INTENCLR_ACCESSERR_Min (0x0UL)       /*!< Min enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTENCLR_ACCESSERR_Max (0x1UL)       /*!< Max enumerator value of ACCESSERR field.                             */
  #define MRAMC_INTENCLR_ACCESSERR_Clear (0x1UL)     /*!< Disable                                                              */
  #define MRAMC_INTENCLR_ACCESSERR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_ACCESSERR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* MRAMC_INTPEND: Pending interrupts */
  #define MRAMC_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define MRAMC_INTPEND_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define MRAMC_INTPEND_READY_Msk (0x1UL << MRAMC_INTPEND_READY_Pos) /*!< Bit mask of READY field.                             */
  #define MRAMC_INTPEND_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTPEND_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTPEND_READY_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define MRAMC_INTPEND_READY_Pending (0x1UL)        /*!< Read: Pending                                                        */

