NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIG_WEN_Pos (0UL)                 /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIG_WEN_Msk (0x3UL << MRAMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                     */
  #define MRAMC_CONFIG_WEN_Min (0x0UL)               /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_Max (0x2UL)               /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_DisableWrite (0x0UL)      /*!< Write is disabled                                                    */
  #define MRAMC_CONFIG_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                              */
  #define MRAMC_CONFIG_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                              */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIG_EEN_Pos (4UL)                 /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIG_EEN_Msk (0x3UL << MRAMC_CONFIG_EEN_Pos) /*!< Bit mask of EEN field.                                     */
  #define MRAMC_CONFIG_EEN_Min (0x0UL)               /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_Max (0x2UL)               /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_DisableErase (0x0UL)      /*!< Erase is disabled but read is allowed                                */
  #define MRAMC_CONFIG_EEN_EnablePageErase (0x1UL)   /*!< Erase page and read are allowed                                      */
  #define MRAMC_CONFIG_EEN_EnableWordErase (0x2UL)   /*!< Erase word and read are allowed                                      */

/* ENABLEECCBUSFAULT @Bit 9 : Enable or disable bus fault on ECC failure during read. */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Pos (9UL)   /*!< Position of ENABLEECCBUSFAULT field.                                 */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Msk (0x1UL << MRAMC_CONFIG_ENABLEECCBUSFAULT_Pos) /*!< Bit mask of ENABLEECCBUSFAULT
                                                                            field.*/
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Min (0x0UL) /*!< Min enumerator value of ENABLEECCBUSFAULT field.                     */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Max (0x1UL) /*!< Max enumerator value of ENABLEECCBUSFAULT field.                     */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Enable (0x0UL) /*!< Enable bus fault on ECC failure during MRAM read                  */
  #define MRAMC_CONFIG_ENABLEECCBUSFAULT_Disable (0x1UL) /*!< Disable bus fault on ECC failure during MRAM read                */


/* MRAMC_AUTOREADMODE: Automatically disables the write and erases on timeout and enters into read mode. */
  #define MRAMC_AUTOREADMODE_ResetValue (0x00000000UL) /*!< Reset value of AUTOREADMODE register.                              */

/* VALUE @Bits 0..11 : Timeout value to disable write and erase. */
  #define MRAMC_AUTOREADMODE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define MRAMC_AUTOREADMODE_VALUE_Msk (0xFFFUL << MRAMC_AUTOREADMODE_VALUE_Pos) /*!< Bit mask of VALUE field.                 */
  #define MRAMC_AUTOREADMODE_VALUE_Min (0x000UL)     /*!< Min value of VALUE field.                                            */
  #define MRAMC_AUTOREADMODE_VALUE_Max (0xFFFUL)     /*!< Max size of VALUE field.                                             */


/* MRAMC_WAITSTATES: Waitstates for MRAM read access */
  #define MRAMC_WAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATENUM @Bits 0..4 : Register to read the current number of waitstate for the MRAM access and set a new value */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Pos (0UL)    /*!< Position of WAITSTATENUM field.                                      */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Msk (0x1FUL << MRAMC_WAITSTATES_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Min (0x03UL) /*!< Min value of WAITSTATENUM field.                                     */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Max (0x1FUL) /*!< Max size of WAITSTATENUM field.                                      */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_WAITSTATES_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_WAITSTATES_KEY_Msk (0xFFFFUL << MRAMC_WAITSTATES_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_WAITSTATES_KEY_Min (0x0000UL)        /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_WAITSTATES_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_READYNEXTTIMEOUT: Preload timeout value for waiting for a next write */
  #define MRAMC_READYNEXTTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of READYNEXTTIMEOUT register.                      */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Msk (0xFFFUL << MRAMC_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Min (0x000UL) /*!< Min value of VALUE field.                                            */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */

/* DW @Bit 31 : Triggers a write to MRAMC macro on the ready next timeout in direct write mode (CONFIG.WEN = 2) and some data
                written into the internal write buffer. */

  #define MRAMC_READYNEXTTIMEOUT_DW_Pos (31UL)       /*!< Position of DW field.                                                */
  #define MRAMC_READYNEXTTIMEOUT_DW_Msk (0x1UL << MRAMC_READYNEXTTIMEOUT_DW_Pos) /*!< Bit mask of DW field.                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Min (0x0UL)      /*!< Min enumerator value of DW field.                                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Max (0x1UL)      /*!< Max enumerator value of DW field.                                    */
  #define MRAMC_READYNEXTTIMEOUT_DW_Disable (0x0UL)  /*!< No write trigger                                                     */
  #define MRAMC_READYNEXTTIMEOUT_DW_Enable (0x1UL)   /*!< Write trigger                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MSPI                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =========================================== Struct MSPI_EVENTS_DMA_EVENTS_DONE ============================================ */
/**
  * @brief EVENTS_DONE [MSPI_EVENTS_DMA_EVENTS_DONE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000000) Descriptor list is complete.                          */
  __IOM uint32_t  LISTPART;                          /*!< (@ 0x00000004) Descriptor list is partially complete. Threshold in
                                                                         CONFIG.LISTPARTTHRESH register has been passed.*/
  __IOM uint32_t  SELECTJOB;                         /*!< (@ 0x00000008) Selected job is completed. Selection is done via
                                                                         CONFIG.SELECTJOBENABLE.*/
  __IOM uint32_t  DATA;                              /*!< (@ 0x0000000C) A job has been completed, i.e. the job's data has been
                                                                         completely transferred either to AXI or DMA bus,
                                                                         depending on direction.*/
  __IOM uint32_t  JOB;                               /*!< (@ 0x00000010) A job has been fetched from the joblist.              */
} NRF_MSPI_EVENTS_DMA_EVENTS_DONE_Type;              /*!< Size = 20 (0x014)                                                    */

/* MSPI_EVENTS_DMA_EVENTS_DONE_LIST: Descriptor list is complete. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                        */

/* LIST @Bit 0 : Descriptor list is complete. */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Pos (0UL) /*!< Position of LIST field.                                         */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Msk (0x1UL << MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Pos) /*!< Bit mask of LIST
                                                                            field.*/
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Min (0x0UL) /*!< Min enumerator value of LIST field.                           */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Max (0x1UL) /*!< Max enumerator value of LIST field.                           */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MSPI_EVENTS_DMA_EVENTS_DONE_LIST_LIST_Generated (0x1UL) /*!< Event generated                                         */


/* MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART: Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has
                                          been passed. */

  #define MSPI_EVENTS_DMA_EVENTS_DONE_LISTPART_ResetValue (0x00000000UL) /*!< Reset value of LISTPART register.                */

