NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* MSPI_EVENTS_DMA_PAUSED: DMA paused with task TASKS_PAUSE. */
  #define MSPI_EVENTS_DMA_PAUSED_ResetValue (0x00000000UL) /*!< Reset value of PAUSED register.                                */

/* PAUSED @Bit 0 : DMA paused with task TASKS_PAUSE. */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_Pos (0UL)    /*!< Position of PAUSED field.                                            */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_Msk (0x1UL << MSPI_EVENTS_DMA_PAUSED_PAUSED_Pos) /*!< Bit mask of PAUSED field.        */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_Min (0x0UL)  /*!< Min enumerator value of PAUSED field.                                */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_Max (0x1UL)  /*!< Max enumerator value of PAUSED field.                                */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define MSPI_EVENTS_DMA_PAUSED_PAUSED_Generated (0x1UL) /*!< Event generated                                                 */


/* MSPI_EVENTS_DMA_RESET: DMA reset with task TASKS_RESET. */
  #define MSPI_EVENTS_DMA_RESET_ResetValue (0x00000000UL) /*!< Reset value of RESET register.                                  */

/* RESET @Bit 0 : DMA reset with task TASKS_RESET. */
  #define MSPI_EVENTS_DMA_RESET_RESET_Pos (0UL)      /*!< Position of RESET field.                                             */
  #define MSPI_EVENTS_DMA_RESET_RESET_Msk (0x1UL << MSPI_EVENTS_DMA_RESET_RESET_Pos) /*!< Bit mask of RESET field.             */
  #define MSPI_EVENTS_DMA_RESET_RESET_Min (0x0UL)    /*!< Min enumerator value of RESET field.                                 */
  #define MSPI_EVENTS_DMA_RESET_RESET_Max (0x1UL)    /*!< Max enumerator value of RESET field.                                 */
  #define MSPI_EVENTS_DMA_RESET_RESET_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define MSPI_EVENTS_DMA_RESET_RESET_Generated (0x1UL) /*!< Event generated                                                   */


/* MSPI_EVENTS_DMA_DONE: DMA transfer done */
  #define MSPI_EVENTS_DMA_DONE_ResetValue (0x00000000UL) /*!< Reset value of DONE register.                                    */

/* DONE @Bit 0 : DMA transfer done */
  #define MSPI_EVENTS_DMA_DONE_DONE_Pos (0UL)        /*!< Position of DONE field.                                              */
  #define MSPI_EVENTS_DMA_DONE_DONE_Msk (0x1UL << MSPI_EVENTS_DMA_DONE_DONE_Pos) /*!< Bit mask of DONE field.                  */
  #define MSPI_EVENTS_DMA_DONE_DONE_Min (0x0UL)      /*!< Min enumerator value of DONE field.                                  */
  #define MSPI_EVENTS_DMA_DONE_DONE_Max (0x1UL)      /*!< Max enumerator value of DONE field.                                  */
  #define MSPI_EVENTS_DMA_DONE_DONE_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define MSPI_EVENTS_DMA_DONE_DONE_Generated (0x1UL) /*!< Event generated                                                     */


/* MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE: The MSPI core has gone into idle state at an unexpected time, this can happen if the TX
                                      buffer underflows, this event is followed by either DONE or ABORTED event. */

  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_ResetValue (0x00000000UL) /*!< Reset value of TXUNEXPECTEDIDLE register.            */

/* TXUNEXPECTEDIDLE @Bit 0 : The MSPI core has gone into idle state at an unexpected time, this can happen if the TX buffer
                             underflows, this event is followed by either DONE or ABORTED event. */

  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Pos (0UL) /*!< Position of TXUNEXPECTEDIDLE field.                 */
  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Pos)
                                                                            /*!< Bit mask of TXUNEXPECTEDIDLE field.*/
  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of TXUNEXPECTEDIDLE field.   */
  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of TXUNEXPECTEDIDLE field.   */
  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define MSPI_EVENTS_DMA_TXUNEXPECTEDIDLE_TXUNEXPECTEDIDLE_Generated (0x1UL) /*!< Event generated                             */


/* MSPI_EVENTS_DMA_INTERNALBUSERROR: An error occured during the transfer of data internally in the MSPI, followed by either
                                      DONE or ABORTED event. */

  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of INTERNALBUSERROR register.            */

/* INTERNALBUSERROR @Bit 0 : An error occured during the transfer of data internally in the MSPI, followed by either DONE or
                             ABORTED event. */

  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Pos (0UL) /*!< Position of INTERNALBUSERROR field.                 */
  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Msk (0x1UL << MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Pos)
                                                                            /*!< Bit mask of INTERNALBUSERROR field.*/
  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of INTERNALBUSERROR field.   */
  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of INTERNALBUSERROR field.   */
  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_NotGenerated (0x0UL) /*!< Event not generated                      */
  #define MSPI_EVENTS_DMA_INTERNALBUSERROR_INTERNALBUSERROR_Generated (0x1UL) /*!< Event generated                             */


/* MSPI_EVENTS_DMA_ABORTED: The MSPI DMA has aborted due to an error given in a separate event, and has attempted to complete
                             any ongoing transactions, and stopped. The MSPI DMA is ready for a new transaction. */

  #define MSPI_EVENTS_DMA_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of ABORTED register.                              */

