NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* ABORTED @Bit 0 : The MSPI DMA has aborted due to an error given in a separate event, and has attempted to complete any
                    ongoing transactions, and stopped. The MSPI DMA is ready for a new transaction. */

  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_Pos (0UL)  /*!< Position of ABORTED field.                                           */
  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_Msk (0x1UL << MSPI_EVENTS_DMA_ABORTED_ABORTED_Pos) /*!< Bit mask of ABORTED field.   */
  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_Min (0x0UL) /*!< Min enumerator value of ABORTED field.                              */
  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_Max (0x1UL) /*!< Max enumerator value of ABORTED field.                              */
  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define MSPI_EVENTS_DMA_ABORTED_ABORTED_Generated (0x1UL) /*!< Event generated                                               */



/* =================================================== Struct MSPI_CONFIG ==================================================== */
/**
  * @brief CONFIG [MSPI_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TXBURSTLENGTH;                     /*!< (@ 0x00000000) Transmit burst length                                 */
  __IOM uint32_t  RXBURSTLENGTH;                     /*!< (@ 0x00000004) Receive burst length                                  */
  __IOM uint32_t  RXTRANSFERLENGTH;                  /*!< (@ 0x00000008) Receive transfer full length                          */
  __IOM uint32_t  STOPON;                            /*!< (@ 0x0000000C) Stop the DMA if the CORE goes into any of the enabled
                                                                         states.*/
} NRF_MSPI_CONFIG_Type;                              /*!< Size = 16 (0x010)                                                    */

/* MSPI_CONFIG_TXBURSTLENGTH: Transmit burst length */
  #define MSPI_CONFIG_TXBURSTLENGTH_ResetValue (0x00000008UL) /*!< Reset value of TXBURSTLENGTH register.                      */

/* AMOUNT @Bits 0..4 : Number of buffer lines */
  #define MSPI_CONFIG_TXBURSTLENGTH_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                            */
  #define MSPI_CONFIG_TXBURSTLENGTH_AMOUNT_Msk (0x1FUL << MSPI_CONFIG_TXBURSTLENGTH_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */


/* MSPI_CONFIG_RXBURSTLENGTH: Receive burst length */
  #define MSPI_CONFIG_RXBURSTLENGTH_ResetValue (0x00000008UL) /*!< Reset value of RXBURSTLENGTH register.                      */

/* AMOUNT @Bits 0..4 : Number of buffer lines */
  #define MSPI_CONFIG_RXBURSTLENGTH_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                            */
  #define MSPI_CONFIG_RXBURSTLENGTH_AMOUNT_Msk (0x1FUL << MSPI_CONFIG_RXBURSTLENGTH_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */


/* MSPI_CONFIG_RXTRANSFERLENGTH: Receive transfer full length */
  #define MSPI_CONFIG_RXTRANSFERLENGTH_ResetValue (0x00000010UL) /*!< Reset value of RXTRANSFERLENGTH register.                */

/* AMOUNT @Bits 0..17 : Number of buffer lines */
  #define MSPI_CONFIG_RXTRANSFERLENGTH_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                         */
  #define MSPI_CONFIG_RXTRANSFERLENGTH_AMOUNT_Msk (0x3FFFFUL << MSPI_CONFIG_RXTRANSFERLENGTH_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/


/* MSPI_CONFIG_STOPON: Stop the DMA if the CORE goes into any of the enabled states. */
  #define MSPI_CONFIG_STOPON_ResetValue (0x00000003UL) /*!< Reset value of STOPON register.                                    */

/* TXUNEXPECTEDIDLE @Bit 0 : The CORE will go into idle if the CORE buffer is emptied, if the DMA still has data to transfer the
                             CORE is not expected to go into idle state. This constitutes a buffer underflow. The CORE migth
                             also go into idle if an error occurs. */

  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Pos (0UL) /*!< Position of TXUNEXPECTEDIDLE field.                               */
  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Pos) /*!< Bit mask of
                                                                            TXUNEXPECTEDIDLE field.*/
  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of TXUNEXPECTEDIDLE field.                 */
  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of TXUNEXPECTEDIDLE field.                 */
  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Disabled (0x0UL) /*!< Stop on tx unexpected idle disabled.                       */
  #define MSPI_CONFIG_STOPON_TXUNEXPECTEDIDLE_Enabled (0x1UL) /*!< Stop on tx unexpected idle enabled.                         */

/* RXOVERFLOW @Bit 1 : This condition occurrs if the DMA attempts to write to the RX buffer in the CORE, but the buffer is full.
                       When this bit is enabled the DMA will stop when the CORE buffer experiences a rx buffer overflow */

  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Pos (1UL)    /*!< Position of RXOVERFLOW field.                                        */
  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Msk (0x1UL << MSPI_CONFIG_STOPON_RXOVERFLOW_Pos) /*!< Bit mask of RXOVERFLOW field.    */
  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Min (0x0UL)  /*!< Min enumerator value of RXOVERFLOW field.                            */
  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Max (0x1UL)  /*!< Max enumerator value of RXOVERFLOW field.                            */
  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Disabled (0x0UL) /*!< Stop on rx overflow disabled.                                    */
  #define MSPI_CONFIG_STOPON_RXOVERFLOW_Enabled (0x1UL) /*!< Stop on rx overflow enabled.                                      */

/* INTERNALBUSERROR @Bit 2 : Terminate the transaction if a INTERNALBUSERROR event is detected. */
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Pos (2UL) /*!< Position of INTERNALBUSERROR field.                               */
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Msk (0x1UL << MSPI_CONFIG_STOPON_INTERNALBUSERROR_Pos) /*!< Bit mask of
                                                                            INTERNALBUSERROR field.*/
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of INTERNALBUSERROR field.                 */
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of INTERNALBUSERROR field.                 */
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Disabled (0x0UL) /*!< Disable                                                    */
  #define MSPI_CONFIG_STOPON_INTERNALBUSERROR_Enabled (0x1UL) /*!< Enable                                                      */

/* DMABUSERROR @Bit 3 : Terminate the transaction if a DMA.ERROR event is detected. */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Pos (3UL)   /*!< Position of DMABUSERROR field.                                       */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Msk (0x1UL << MSPI_CONFIG_STOPON_DMABUSERROR_Pos) /*!< Bit mask of DMABUSERROR field. */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Min (0x0UL) /*!< Min enumerator value of DMABUSERROR field.                           */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Max (0x1UL) /*!< Max enumerator value of DMABUSERROR field.                           */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Disabled (0x0UL) /*!< Disable                                                         */
  #define MSPI_CONFIG_STOPON_DMABUSERROR_Enabled (0x1UL) /*!< Enable                                                           */



/* =================================================== Struct MSPI_FORMAT ==================================================== */
/**
  * @brief FORMAT [MSPI_FORMAT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DFS;                               /*!< (@ 0x00000000) Data frame size                                       */
  __IOM uint32_t  BPP;                               /*!< (@ 0x00000004) Bits per pixel                                        */
  __IOM uint32_t  PIXELS;                            /*!< (@ 0x00000008) Number of pixels following the command                */
  __IOM uint32_t  CILEN;                             /*!< (@ 0x0000000C) Command/Instruction length                            */
  __IOM uint32_t  BITORDER;                          /*!< (@ 0x00000010) This register selects if the data collected from system
                                                                         memory is transmitted MSB first or LSB first.*/
} NRF_MSPI_FORMAT_Type;                              /*!< Size = 20 (0x014)                                                    */

/* MSPI_FORMAT_DFS: Data frame size */
  #define MSPI_FORMAT_DFS_ResetValue (0x00000000UL)  /*!< Reset value of DFS register.                                         */

