NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* MSPI_CONTROLLERCORE_CORE_MWCR: Microwire Control Register */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_ResetValue (0x00000000UL) /*!< Reset value of MWCR register.                           */

/* MWMOD @Bit 0 : Microwire Transfer Mode. */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_Pos (0UL) /*!< Position of MWMOD field.                                          */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_Pos) /*!< Bit mask of MWMOD
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_Min (0x0UL) /*!< Min enumerator value of MWMOD field.                            */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_Max (0x1UL) /*!< Max enumerator value of MWMOD field.                            */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_NONSEQUENTIAL (0x0UL) /*!< Non-Sequential Transfer                               */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MWMOD_SEQUENTIAL (0x1UL) /*!< Sequential Transfer                                      */

/* MDD @Bit 1 : Microwire Control. */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_Pos (1UL) /*!< Position of MDD field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_MWCR_MDD_Pos) /*!< Bit mask of MDD field.   */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_Min (0x0UL) /*!< Min enumerator value of MDD field.                                */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_Max (0x1UL) /*!< Max enumerator value of MDD field.                                */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_RECEIVE (0x0UL) /*!< SSI receives data                                             */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MDD_TRANSMIT (0x1UL) /*!< SSI transmits data                                           */

/* MHS @Bit 2 : Microwire Handshaking. */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_Pos (2UL) /*!< Position of MHS field.                                              */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_MWCR_MHS_Pos) /*!< Bit mask of MHS field.   */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_Min (0x0UL) /*!< Min enumerator value of MHS field.                                */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_Max (0x1UL) /*!< Max enumerator value of MHS field.                                */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_DISABLE (0x0UL) /*!< handshaking interface is disabled                             */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_MHS_ENABLED (0x1UL) /*!< handshaking interface is enabled                              */

/* RSVDMWCR @Bits 3..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_RSVDMWCR_Pos (3UL) /*!< Position of RSVDMWCR field.                                    */
  #define MSPI_CONTROLLERCORE_CORE_MWCR_RSVDMWCR_Msk (0x1FFFFFFFUL << MSPI_CONTROLLERCORE_CORE_MWCR_RSVDMWCR_Pos) /*!< Bit mask
                                                                            of RSVDMWCR field.*/


/* MSPI_CONTROLLERCORE_CORE_SER: Target Enable Register */
  #define MSPI_CONTROLLERCORE_CORE_SER_ResetValue (0x00000000UL) /*!< Reset value of SER register.                             */

/* SER @Bits 0..3 : Chip Select Enable Flag. */
  #define MSPI_CONTROLLERCORE_CORE_SER_SER_Pos (0UL) /*!< Position of SER field.                                               */
  #define MSPI_CONTROLLERCORE_CORE_SER_SER_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_SER_SER_Pos) /*!< Bit mask of SER field.     */

/* RSVDSER @Bits 4..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SER_RSVDSER_Pos (4UL) /*!< Position of RSVDSER field.                                       */
  #define MSPI_CONTROLLERCORE_CORE_SER_RSVDSER_Msk (0xFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_SER_RSVDSER_Pos) /*!< Bit mask of
                                                                            RSVDSER field.*/


/* MSPI_CONTROLLERCORE_CORE_BAUDR: Baud Rate Select */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_ResetValue (0x00000002UL) /*!< Reset value of BAUDR register.                         */

/* RSVDBAUDR0 @Bit 0 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR0_Pos (0UL) /*!< Position of RSVDBAUDR0 field.                               */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR0_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR0_Pos) /*!< Bit mask
                                                                            of RSVDBAUDR0 field.*/

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_SCKDV_Pos (1UL) /*!< Position of SCKDV field.                                         */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_SCKDV_Msk (0x7FFFUL << MSPI_CONTROLLERCORE_CORE_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV
                                                                            field.*/

/* RSVDBAUDR1631 @Bits 16..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR1631_Pos (16UL) /*!< Position of RSVDBAUDR1631 field.                        */
  #define MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR1631_Msk (0xFFFFUL << MSPI_CONTROLLERCORE_CORE_BAUDR_RSVDBAUDR1631_Pos) /*!<
                                                                            Bit mask of RSVDBAUDR1631 field.*/


/* MSPI_CONTROLLERCORE_CORE_TXFTLR: Transmit FIFO Threshold Level */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_ResetValue (0x00080000UL) /*!< Reset value of TXFTLR register.                       */

/* TFT @Bits 0..3 : Transmit FIFO Threshold. */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_TFT_Pos (0UL) /*!< Position of TFT field.                                            */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_TFT_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_TXFTLR_TFT_Pos) /*!< Bit mask of TFT
                                                                            field.*/

/* RSVDTXFTLR @Bits 4..15 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTLR_Pos (4UL) /*!< Position of RSVDTXFTLR field.                              */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTLR_Msk (0xFFFUL << MSPI_CONTROLLERCORE_CORE_TXFTLR_RSVDTXFTLR_Pos) /*!< Bit
                                                                            mask of RSVDTXFTLR field.*/

/* TXFTHR @Bits 16..19 : Transfer start FIFO level. */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_TXFTLR_TXFTHR_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_TXFTLR_TXFTHR_Pos) /*!< Bit mask of
                                                                            TXFTHR field.*/

