NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* DR @Bits 0..31 : Data Register. When writing to this register, you must right-justify the data. Read data are automatically
                    right-justified. */

  #define MSPI_CONTROLLERCORE_CORE_DR_DR_Pos (0UL)   /*!< Position of DR field.                                                */
  #define MSPI_CONTROLLERCORE_CORE_DR_DR_Msk (0xFFFFFFFFUL << MSPI_CONTROLLERCORE_CORE_DR_DR_Pos) /*!< Bit mask of DR field.   */


/* MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY: RX Sample Delay Register */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.         */

/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value
                    */

  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSD_Pos (0UL) /*!< Position of RSD field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSD_Msk (0xFFUL << MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSD_Pos) /*!< Bit
                                                                            mask of RSD field.*/

/* RSVD0RXSAMPLEDELAY @Bits 8..15 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Pos (8UL) /*!< Position of RSVD0RXSAMPLEDELAY field.       */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Msk (0xFFUL << MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Pos)
                                                                            /*!< Bit mask of RSVD0RXSAMPLEDELAY field.*/

/* SE @Bit 16 : Receive Data (rxd) Sampling Edge. This register is used to decide the sampling edge for RXD signal with ssi_clk.
                Then this bit is set to 1 then negative edge of ssi_clk will be used to sample the incoming data, otherwise
                positive edge will be used for sampling. */

  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_SE_Pos (16UL) /*!< Position of SE field.                                      */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_SE_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_SE_Pos) /*!< Bit mask
                                                                            of SE field.*/

/* RSVD1RXSAMPLEDELAY @Bits 17..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDELAY_Pos (17UL) /*!< Position of RSVD1RXSAMPLEDELAY field.      */
  #define MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDELAY_Msk (0x7FFFUL << MSPI_CONTROLLERCORE_CORE_RXSAMPLEDELAY_RSVD1RXSAMPLEDELAY_Pos)
                                                                            /*!< Bit mask of RSVD1RXSAMPLEDELAY field.*/


/* MSPI_CONTROLLERCORE_CORE_SPICTRLR0: SPI_CTRLR0 - SPI Control Register */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ResetValue (0x40000200UL) /*!< Reset value of SPICTRLR0 register.                 */

/* TRANSTYPE @Bits 0..1 : Address and instruction transfer format. */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_Pos (0UL) /*!< Position of TRANSTYPE field.                             */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_Msk (0x3UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_Pos) /*!< Bit
                                                                            mask of TRANSTYPE field.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.               */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.               */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_TT0 (0x0UL) /*!< Instruction and Address will be sent in Standard SPI
                                                                        Mode.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_TT1 (0x1UL) /*!< Instruction will be sent in Standard SPI Mode and
                                                                        Address will be sent in the mode specified by
                                                                        CTRLR0.SPI_FRF.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_TT2 (0x2UL) /*!< Both Instruction and Address will be sent in the mode
                                                                        specified by SPI_FRF.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_TRANSTYPE_TT3 (0x3UL) /*!< Dual Octal mode, the address and instruction are
                                                                        transferred in octal mode and data is transferred on 16
                                                                        data lines.*/

/* ADDRL @Bits 2..5 : This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the
                      FIFO the transfer can begin. */

  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_Pos (2UL) /*!< Position of ADDRL field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_Msk (0xFUL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                       */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                       */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL0 (0x0UL) /*!< No Address                                              */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL4 (0x1UL) /*!< 4 bit Address length                                    */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL8 (0x2UL) /*!< 8 bit Address length                                    */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL12 (0x3UL) /*!< 12 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL16 (0x4UL) /*!< 16 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL20 (0x5UL) /*!< 20 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL24 (0x6UL) /*!< 24 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL28 (0x7UL) /*!< 28 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL32 (0x8UL) /*!< 32 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL36 (0x9UL) /*!< 36 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL40 (0xAUL) /*!< 40 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL44 (0xBUL) /*!< 44 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL48 (0xCUL) /*!< 48 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL52 (0xDUL) /*!< 52 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL56 (0xEUL) /*!< 56 bit Address length                                  */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_ADDRL_ADDRL60 (0xFUL) /*!< 60 bit Address length                                  */

/* RSVDSPICTRLR06 @Bit 6 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR06_Pos (6UL) /*!< Position of RSVDSPICTRLR06 field.                   */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR06_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR06_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR06 field.*/

/* RSVDSPICTRLR07 @Bit 7 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR07_Pos (7UL) /*!< Position of RSVDSPICTRLR07 field.                   */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR07_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR07_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR07 field.*/

/* INSTL @Bits 8..9 : Enhanced SPI mode instruction length in bits. */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_Pos (8UL) /*!< Position of INSTL field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_Msk (0x3UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                       */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                       */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_INSTL0 (0x0UL) /*!< No Instruction                                          */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_INSTL4 (0x1UL) /*!< 4 bit Instruction length                                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_INSTL8 (0x2UL) /*!< 8 bit Instruction length                                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_INSTL_INSTL16 (0x3UL) /*!< 16 bit Instruction length                              */

/* RSVDSPICTRLR010 @Bit 10 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR010_Pos (10UL) /*!< Position of RSVDSPICTRLR010 field.                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR010_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR010_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR010 field.*/

/* WAITCYCLES @Bits 11..15 : Wait cycles in SPI mode between control frames transmit and data transmit/reception. Specified as
                             number of SPI clock cycles. */

  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_WAITCYCLES_Pos (11UL) /*!< Position of WAITCYCLES field.                          */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_WAITCYCLES_Msk (0x1FUL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_WAITCYCLES_Pos) /*!<
                                                                            Bit mask of WAITCYCLES field.*/

/* RSVDSPICTRLR016 @Bit 16 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR016_Pos (16UL) /*!< Position of RSVDSPICTRLR016 field.                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR016_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR016_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR016 field.*/

/* RSVDSPICTRLR017 @Bit 17 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR017_Pos (17UL) /*!< Position of RSVDSPICTRLR017 field.                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR017_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR017_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR017 field.*/

/* RSVDSPICTRLR018 @Bit 18 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR018_Pos (18UL) /*!< Position of RSVDSPICTRLR018 field.                */
  #define MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR018_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SPICTRLR0_RSVDSPICTRLR018_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR018 field.*/

