NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_Pos (2UL)  /*!< Position of TFE field.                                               */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_TFE_Pos) /*!< Bit mask of TFE field.       */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_Min (0x0UL) /*!< Min enumerator value of TFE field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_Max (0x1UL) /*!< Max enumerator value of TFE field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_NOTEMPTY (0x0UL) /*!< Transmit FIFO is not empty                                     */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFE_EMPTY (0x1UL) /*!< Transmit FIFO is empty                                            */

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_Pos (3UL) /*!< Position of RFNE field.                                              */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_RFNE_Pos) /*!< Bit mask of RFNE field.    */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_Min (0x0UL) /*!< Min enumerator value of RFNE field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_Max (0x1UL) /*!< Max enumerator value of RFNE field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_EMPTY (0x0UL) /*!< Receive FIFO is empty                                            */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFNE_NOTEMPTY (0x1UL) /*!< Receive FIFO is not empty                                     */

/* RFF @Bit 4 : Receive FIFO Full. */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_Pos (4UL)  /*!< Position of RFF field.                                               */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_RFF_Pos) /*!< Bit mask of RFF field.       */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_Min (0x0UL) /*!< Min enumerator value of RFF field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_Max (0x1UL) /*!< Max enumerator value of RFF field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_NOTFULL (0x0UL) /*!< Receive FIFO is not full                                        */
  #define MSPI_PERIPHERALCORE_CORE_SR_RFF_FULL (0x1UL) /*!< Receive FIFO is full                                               */

/* TXE @Bit 5 : Transmission Error. */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_Pos (5UL)  /*!< Position of TXE field.                                               */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_TXE_Pos) /*!< Bit mask of TXE field.       */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_Min (0x0UL) /*!< Min enumerator value of TXE field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_Max (0x1UL) /*!< Max enumerator value of TXE field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_NOERROR (0x0UL) /*!< No Error                                                        */
  #define MSPI_PERIPHERALCORE_CORE_SR_TXE_TXERROR (0x1UL) /*!< Transmission Error                                              */

/* DCOL @Bit 6 : Data Collision Error. */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_Pos (6UL) /*!< Position of DCOL field.                                              */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_DCOL_Pos) /*!< Bit mask of DCOL field.    */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_Min (0x0UL) /*!< Min enumerator value of DCOL field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_Max (0x1UL) /*!< Max enumerator value of DCOL field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_NOERRORCONDITION (0x0UL) /*!< No Error                                              */
  #define MSPI_PERIPHERALCORE_CORE_SR_DCOL_TXCOLLISIONERROR (0x1UL) /*!< Transmit Data Collision Error                         */

/* RSVDSR714 @Bits 7..14 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SR_RSVDSR714_Pos (7UL) /*!< Position of RSVDSR714 field.                                    */
  #define MSPI_PERIPHERALCORE_CORE_SR_RSVDSR714_Msk (0xFFUL << MSPI_PERIPHERALCORE_CORE_SR_RSVDSR714_Pos) /*!< Bit mask of
                                                                            RSVDSR714 field.*/

/* RSVDSR1531 @Bits 15..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SR_RSVDSR1531_Pos (15UL) /*!< Position of RSVDSR1531 field.                                 */
  #define MSPI_PERIPHERALCORE_CORE_SR_RSVDSR1531_Msk (0x1FFFFUL << MSPI_PERIPHERALCORE_CORE_SR_RSVDSR1531_Pos) /*!< Bit mask of
                                                                            RSVDSR1531 field.*/


/* MSPI_PERIPHERALCORE_CORE_IMR: Interrupt Mask Register */
  #define MSPI_PERIPHERALCORE_CORE_IMR_ResetValue (0x0000043FUL) /*!< Reset value of IMR register.                             */

/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_Pos (0UL) /*!< Position of TXEIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_Pos) /*!< Bit mask of TXEIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_Min (0x0UL) /*!< Min enumerator value of TXEIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_Max (0x1UL) /*!< Max enumerator value of TXEIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_MASKED (0x0UL) /*!< ssi_txe_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXEIM_UNMASKED (0x1UL) /*!< ssi_txe_intr interrupt is not masked                        */

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_Pos (1UL) /*!< Position of TXOIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_Pos) /*!< Bit mask of TXOIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_Min (0x0UL) /*!< Min enumerator value of TXOIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_Max (0x1UL) /*!< Max enumerator value of TXOIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_MASKED (0x0UL) /*!< ssi_txo_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_TXOIM_UNMASKED (0x1UL) /*!< ssi_txo_intr interrupt is not masked                        */

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_Pos (2UL) /*!< Position of RXUIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_Pos) /*!< Bit mask of RXUIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_Min (0x0UL) /*!< Min enumerator value of RXUIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_Max (0x1UL) /*!< Max enumerator value of RXUIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_MASKED (0x0UL) /*!< ssi_rxu_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXUIM_UNMASKED (0x1UL) /*!< ssi_rxu_intr interrupt is not masked                        */

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_Pos (3UL) /*!< Position of RXOIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_Pos) /*!< Bit mask of RXOIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_Min (0x0UL) /*!< Min enumerator value of RXOIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_Max (0x1UL) /*!< Max enumerator value of RXOIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_MASKED (0x0UL) /*!< ssi_rxo_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXOIM_UNMASKED (0x1UL) /*!< ssi_rxo_intr interrupt is not masked                        */

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_Pos (4UL) /*!< Position of RXFIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_Pos) /*!< Bit mask of RXFIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_Min (0x0UL) /*!< Min enumerator value of RXFIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_Max (0x1UL) /*!< Max enumerator value of RXFIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_MASKED (0x0UL) /*!< ssi_rxf_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RXFIM_UNMASKED (0x1UL) /*!< ssi_rxf_intr interrupt is not masked                        */

/* MSTIM @Bit 5 : Multi-Controller Contention Interrupt Mask. This bit field is not present if the MSPI CORE is configured as a
                  serial-target device. */

  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_Pos (5UL) /*!< Position of MSTIM field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_Pos) /*!< Bit mask of MSTIM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_Min (0x0UL) /*!< Min enumerator value of MSTIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_Max (0x1UL) /*!< Max enumerator value of MSTIM field.                             */
  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_MASKED (0x0UL) /*!< ssi_mst_intr interrupt is masked                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_MSTIM_UNMASKED (0x1UL) /*!< ssi_mst_intr interrupt is not masked                        */

/* RSVDIMR6 @Bit 6 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR6_Pos (6UL) /*!< Position of RSVDIMR6 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR6_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR6_Pos) /*!< Bit mask of
                                                                            RSVDIMR6 field.*/

/* RSVDIMR7 @Bit 7 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR7_Pos (7UL) /*!< Position of RSVDIMR7 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR7_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR7_Pos) /*!< Bit mask of
                                                                            RSVDIMR7 field.*/

/* RSVDIMR8 @Bit 8 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR8_Pos (8UL) /*!< Position of RSVDIMR8 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR8_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR8_Pos) /*!< Bit mask of
                                                                            RSVDIMR8 field.*/

/* RSVD9IMR @Bit 9 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVD9IMR_Pos (9UL) /*!< Position of RSVD9IMR field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVD9IMR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RSVD9IMR_Pos) /*!< Bit mask of
                                                                            RSVD9IMR field.*/

/* SPITEM @Bit 10 : SPI Transmit Error Interrupt Mask */
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_Pos (10UL) /*!< Position of SPITEM field.                                        */
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_Pos) /*!< Bit mask of SPITEM
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_Min (0x0UL) /*!< Min enumerator value of SPITEM field.                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_Max (0x1UL) /*!< Max enumerator value of SPITEM field.                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_MASKED (0x0UL) /*!< ssi_spite_intr interrupt is masked                           */
  #define MSPI_PERIPHERALCORE_CORE_IMR_SPITEM_UNMASKED (0x1UL) /*!< ssi_spite_intr interrupt is not masked                     */

/* RSVDIMR11 @Bit 11 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR11_Pos (11UL) /*!< Position of RSVDIMR11 field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR11_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_IMR_RSVDIMR11_Pos) /*!< Bit mask of
                                                                            RSVDIMR11 field.*/

/* RSVD1231IMR @Bits 12..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVD1231IMR_Pos (12UL) /*!< Position of RSVD1231IMR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_IMR_RSVD1231IMR_Msk (0xFFFFFUL << MSPI_PERIPHERALCORE_CORE_IMR_RSVD1231IMR_Pos) /*!< Bit mask
                                                                            of RSVD1231IMR field.*/


/* MSPI_PERIPHERALCORE_CORE_ISR: Interrupt Status Register */
  #define MSPI_PERIPHERALCORE_CORE_ISR_ResetValue (0x00000000UL) /*!< Reset value of ISR register.                             */

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_Pos (0UL) /*!< Position of TXEIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_Pos) /*!< Bit mask of TXEIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_Min (0x0UL) /*!< Min enumerator value of TXEIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_Max (0x1UL) /*!< Max enumerator value of TXEIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_INACTIVE (0x0UL) /*!< ssi_txe_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXEIS_ACTIVE (0x1UL) /*!< ssi_txe_intr interrupt is active after masking                */

