NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* RSVDRISR8 @Bit 8 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR8_Pos (8UL) /*!< Position of RSVDRISR8 field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR8_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR8_Pos) /*!< Bit mask of
                                                                            RSVDRISR8 field.*/

/* RSVD9RISR @Bit 9 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVD9RISR_Pos (9UL) /*!< Position of RSVD9RISR field.                                  */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVD9RISR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RISR_RSVD9RISR_Pos) /*!< Bit mask of
                                                                            RSVD9RISR field.*/

/* SPITER @Bit 10 : SPI Transmit Error Interrupt status. */
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_Pos (10UL) /*!< Position of SPITER field.                                       */
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RISR_SPITER_Pos) /*!< Bit mask of SPITER
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_Min (0x0UL) /*!< Min enumerator value of SPITER field.                          */
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_Max (0x1UL) /*!< Max enumerator value of SPITER field.                          */
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_INACTIVE (0x0UL) /*!< ssi_spite_intr interrupt is not active prior to masking   */
  #define MSPI_PERIPHERALCORE_CORE_RISR_SPITER_ACTIVE (0x1UL) /*!< ssi_spite_intr interrupt is active prior to masking         */

/* RSVDRISR11 @Bit 11 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR11_Pos (11UL) /*!< Position of RSVDRISR11 field.                               */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR11_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RISR_RSVDRISR11_Pos) /*!< Bit mask of
                                                                            RSVDRISR11 field.*/

/* RSVD1231RISR @Bits 12..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVD1231RISR_Pos (12UL) /*!< Position of RSVD1231RISR field.                           */
  #define MSPI_PERIPHERALCORE_CORE_RISR_RSVD1231RISR_Msk (0xFFFFFUL << MSPI_PERIPHERALCORE_CORE_RISR_RSVD1231RISR_Pos) /*!< Bit
                                                                            mask of RSVD1231RISR field.*/


/* MSPI_PERIPHERALCORE_CORE_TXEICR: Transmit FIFO Error Interrupt Clear Register Register */
  #define MSPI_PERIPHERALCORE_CORE_TXEICR_ResetValue (0x00000000UL) /*!< Reset value of TXEICR register.                       */

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define MSPI_PERIPHERALCORE_CORE_TXEICR_TXEICR_Pos (0UL) /*!< Position of TXEICR field.                                      */
  #define MSPI_PERIPHERALCORE_CORE_TXEICR_TXEICR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_TXEICR_TXEICR_Pos) /*!< Bit mask of
                                                                            TXEICR field.*/

/* RSVDTXEICR @Bits 1..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_TXEICR_RSVDTXEICR_Pos (1UL) /*!< Position of RSVDTXEICR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_TXEICR_RSVDTXEICR_Msk (0x7FFFFFFFUL << MSPI_PERIPHERALCORE_CORE_TXEICR_RSVDTXEICR_Pos) /*!<
                                                                            Bit mask of RSVDTXEICR field.*/


/* MSPI_PERIPHERALCORE_CORE_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define MSPI_PERIPHERALCORE_CORE_RXOICR_ResetValue (0x00000000UL) /*!< Reset value of RXOICR register.                       */

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define MSPI_PERIPHERALCORE_CORE_RXOICR_RXOICR_Pos (0UL) /*!< Position of RXOICR field.                                      */
  #define MSPI_PERIPHERALCORE_CORE_RXOICR_RXOICR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RXOICR_RXOICR_Pos) /*!< Bit mask of
                                                                            RXOICR field.*/

/* RSVDRXOICR @Bits 1..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RXOICR_RSVDRXOICR_Pos (1UL) /*!< Position of RSVDRXOICR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_RXOICR_RSVDRXOICR_Msk (0x7FFFFFFFUL << MSPI_PERIPHERALCORE_CORE_RXOICR_RSVDRXOICR_Pos) /*!<
                                                                            Bit mask of RSVDRXOICR field.*/


/* MSPI_PERIPHERALCORE_CORE_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define MSPI_PERIPHERALCORE_CORE_RXUICR_ResetValue (0x00000000UL) /*!< Reset value of RXUICR register.                       */

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define MSPI_PERIPHERALCORE_CORE_RXUICR_RXUICR_Pos (0UL) /*!< Position of RXUICR field.                                      */
  #define MSPI_PERIPHERALCORE_CORE_RXUICR_RXUICR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_RXUICR_RXUICR_Pos) /*!< Bit mask of
                                                                            RXUICR field.*/

/* RSVDRXUICR @Bits 1..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RXUICR_RSVDRXUICR_Pos (1UL) /*!< Position of RSVDRXUICR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_RXUICR_RSVDRXUICR_Msk (0x7FFFFFFFUL << MSPI_PERIPHERALCORE_CORE_RXUICR_RSVDRXUICR_Pos) /*!<
                                                                            Bit mask of RSVDRXUICR field.*/


/* MSPI_PERIPHERALCORE_CORE_MSTICR: Multi-Controller Interrupt Clear Register */
  #define MSPI_PERIPHERALCORE_CORE_MSTICR_ResetValue (0x00000000UL) /*!< Reset value of MSTICR register.                       */

/* MSTICR @Bit 0 : Clear Multi-Controller Contention Interrupt. */
  #define MSPI_PERIPHERALCORE_CORE_MSTICR_MSTICR_Pos (0UL) /*!< Position of MSTICR field.                                      */
  #define MSPI_PERIPHERALCORE_CORE_MSTICR_MSTICR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_MSTICR_MSTICR_Pos) /*!< Bit mask of
                                                                            MSTICR field.*/

/* RSVDMSTICR @Bits 1..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_MSTICR_RSVDMSTICR_Pos (1UL) /*!< Position of RSVDMSTICR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_MSTICR_RSVDMSTICR_Msk (0x7FFFFFFFUL << MSPI_PERIPHERALCORE_CORE_MSTICR_RSVDMSTICR_Pos) /*!<
                                                                            Bit mask of RSVDMSTICR field.*/


