NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* RSVDXIPCTRL8 @Bit 8 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL8_Pos (8UL) /*!< Position of RSVDXIPCTRL8 field.                                */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL8_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL8_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL8 field.*/

/* INSTL @Bits 9..10 : Enhanced SPI mode instruction length in bits. */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_Pos (9UL)  /*!< Position of INSTL field.                                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_Msk (0x3UL << MSPI_XIPCORE_CORE_XIPCTRL_INSTL_Pos) /*!< Bit mask of INSTL field.     */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                                */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                                */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_INSTL0 (0x0UL) /*!< No Instruction                                                   */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_INSTL4 (0x1UL) /*!< 4 bit Instruction length                                         */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_INSTL8 (0x2UL) /*!< 8 bit Instruction length                                         */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTL_INSTL16 (0x3UL) /*!< 16 bit Instruction length                                       */

/* RSVDSPICTRLR011 @Bit 11 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDSPICTRLR011_Pos (11UL) /*!< Position of RSVDSPICTRLR011 field.                         */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDSPICTRLR011_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDSPICTRLR011_Pos) /*!< Bit mask
                                                                            of RSVDSPICTRLR011 field.*/

/* MDBITSEN @Bit 12 : Mode bits enable in XIP mode. If this bit is set to 1, then in XIP mode of operation MSPI CORE will insert
                      mode bits after the address phase. These bits are set in register XIP_MODE_BITS register. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_MDBITSEN_Pos (12UL) /*!< Position of MDBITSEN field.                                       */
  #define MSPI_XIPCORE_CORE_XIPCTRL_MDBITSEN_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_MDBITSEN_Pos) /*!< Bit mask of MDBITSEN
                                                                            field.*/

/* WAITCYCLES @Bits 13..17 : Wait cycles in SPI mode between control frames transmit and data transmit/reception. Specified as
                             number of SPI clock cycles. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_WAITCYCLES_Pos (13UL) /*!< Position of WAITCYCLES field.                                   */
  #define MSPI_XIPCORE_CORE_XIPCTRL_WAITCYCLES_Msk (0x1FUL << MSPI_XIPCORE_CORE_XIPCTRL_WAITCYCLES_Pos) /*!< Bit mask of
                                                                            WAITCYCLES field.*/

/* DFSHC @Bit 18 : Fix DFS for XIP transfers. If this bit is set to 1 then data frame size for XIP transfers will be fixed to
                   the programmed value in CTRLR0.DFS. The number of data frames to fetch will be determined by HSIZE and HBURST
                   signals. If this bit is set to 0 then data frame size and number of data frames to fetch will be determined
                   by HSIZE and HBURST signals */

  #define MSPI_XIPCORE_CORE_XIPCTRL_DFSHC_Pos (18UL) /*!< Position of DFSHC field.                                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_DFSHC_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_DFSHC_Pos) /*!< Bit mask of DFSHC field.     */

/* RSVDXIPCTRL19 @Bit 19 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL19_Pos (19UL) /*!< Position of RSVDXIPCTRL19 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL19_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL19_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL19 field.*/

/* RSVDXIPCTRL20 @Bit 20 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL20_Pos (20UL) /*!< Position of RSVDXIPCTRL20 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL20_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL20_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL20 field.*/

/* RSVDXIPCTRL21 @Bit 21 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL21_Pos (21UL) /*!< Position of RSVDXIPCTRL21 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL21_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL21_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL21 field.*/

/* INSTEN @Bit 22 : XIP instruction enable bit. If this bit is set to 1 then XIP transfers will also have instruction phase. The
                    instruction op-codes will be chosen from XIP_INCR_INST or XIP_WRAP_INST registers bases on AHB transfer
                    type. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTEN_Pos (22UL) /*!< Position of INSTEN field.                                           */
  #define MSPI_XIPCORE_CORE_XIPCTRL_INSTEN_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_INSTEN_Pos) /*!< Bit mask of INSTEN field.  */

/* CONTXFEREN @Bit 23 : Enable continuous transfer in XIP mode. If this bit is set to 1 then continuous transfer mode in XIP
                        will be enabled, in this mode MSPI CORE will keep target selected until a non-XIP transfer is detected
                        on the AHB interface. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_CONTXFEREN_Pos (23UL) /*!< Position of CONTXFEREN field.                                   */
  #define MSPI_XIPCORE_CORE_XIPCTRL_CONTXFEREN_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_CONTXFEREN_Pos) /*!< Bit mask of
                                                                            CONTXFEREN field.*/

/* RSVDXIPCTRL24 @Bit 24 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL24_Pos (24UL) /*!< Position of RSVDXIPCTRL24 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL24_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL24_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL24 field.*/

