NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* IDLE @Bit 13 : Read pending status of interrupt for event IDLE */
  #define MSPI_INTPEND_IDLE_Pos (13UL)               /*!< Position of IDLE field.                                              */
  #define MSPI_INTPEND_IDLE_Msk (0x1UL << MSPI_INTPEND_IDLE_Pos) /*!< Bit mask of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_Min (0x0UL)              /*!< Min enumerator value of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_Max (0x1UL)              /*!< Max enumerator value of IDLE field.                                  */
  #define MSPI_INTPEND_IDLE_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_IDLE_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* OVERFLOW @Bit 14 : Read pending status of interrupt for event OVERFLOW */
  #define MSPI_INTPEND_OVERFLOW_Pos (14UL)           /*!< Position of OVERFLOW field.                                          */
  #define MSPI_INTPEND_OVERFLOW_Msk (0x1UL << MSPI_INTPEND_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                      */
  #define MSPI_INTPEND_OVERFLOW_Min (0x0UL)          /*!< Min enumerator value of OVERFLOW field.                              */
  #define MSPI_INTPEND_OVERFLOW_Max (0x1UL)          /*!< Max enumerator value of OVERFLOW field.                              */
  #define MSPI_INTPEND_OVERFLOW_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_OVERFLOW_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* ACQUIRED @Bit 16 : Read pending status of interrupt for event ACQUIRED */
  #define MSPI_INTPEND_ACQUIRED_Pos (16UL)           /*!< Position of ACQUIRED field.                                          */
  #define MSPI_INTPEND_ACQUIRED_Msk (0x1UL << MSPI_INTPEND_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                      */
  #define MSPI_INTPEND_ACQUIRED_Min (0x0UL)          /*!< Min enumerator value of ACQUIRED field.                              */
  #define MSPI_INTPEND_ACQUIRED_Max (0x1UL)          /*!< Max enumerator value of ACQUIRED field.                              */
  #define MSPI_INTPEND_ACQUIRED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_ACQUIRED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* MSPI_ENABLE: Enables the MSPI */
  #define MSPI_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable the MSPI */
  #define MSPI_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define MSPI_ENABLE_ENABLE_Msk (0x1UL << MSPI_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */


/* MSPI_TMOD: Transfer Mode of the MSPI when used as peripheral This register is exclusive to the 'peripheral' configuration */
  #define MSPI_TMOD_ResetValue (0x00000000UL)        /*!< Reset value of TMOD register.                                        */

/* TMOD @Bits 0..1 : (unspecified) */
  #define MSPI_TMOD_TMOD_Pos (0UL)                   /*!< Position of TMOD field.                                              */
  #define MSPI_TMOD_TMOD_Msk (0x3UL << MSPI_TMOD_TMOD_Pos) /*!< Bit mask of TMOD field.                                        */
  #define MSPI_TMOD_TMOD_Min (0x0UL)                 /*!< Min enumerator value of TMOD field.                                  */
  #define MSPI_TMOD_TMOD_Max (0x3UL)                 /*!< Max enumerator value of TMOD field.                                  */
  #define MSPI_TMOD_TMOD_TXANDRX (0x0UL)             /*!< Transmit & Receive; Not Applicable in enhanced SPI operating mode    */
  #define MSPI_TMOD_TMOD_TXONLY (0x1UL)              /*!< Transmit only mode; Or Write in enhanced SPI operating mode          */
  #define MSPI_TMOD_TMOD_RXONLY (0x2UL)              /*!< Receive only mode; Or Read in enhanced SPI operating mode            */
  #define MSPI_TMOD_TMOD_EEPROMREAD (0x3UL)          /*!< EEPROM Read mode; Not Applicable in enhanced SPI operating mode      */


/* MSPI_ENDON: End the DMA if the MSPI meets any of the defined states This task is exclusive to the 'peripheral' configuration
                */

  #define MSPI_ENDON_ResetValue (0x00000003UL)       /*!< Reset value of ENDON register.                                       */

/* TRANSFERLENGHT @Bit 0 : End the DMA transaction when the transferlength has been met */
  #define MSPI_ENDON_TRANSFERLENGHT_Pos (0UL)        /*!< Position of TRANSFERLENGHT field.                                    */
  #define MSPI_ENDON_TRANSFERLENGHT_Msk (0x1UL << MSPI_ENDON_TRANSFERLENGHT_Pos) /*!< Bit mask of TRANSFERLENGHT field.        */

/* CHIPSELECT @Bit 1 : End the DMA transaction when chip select goes inactive */
  #define MSPI_ENDON_CHIPSELECT_Pos (1UL)            /*!< Position of CHIPSELECT field.                                        */
  #define MSPI_ENDON_CHIPSELECT_Msk (0x1UL << MSPI_ENDON_CHIPSELECT_Pos) /*!< Bit mask of CHIPSELECT field.                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MVDMA                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

