NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
  #define MVDMA_SINK_JOBCOUNT_ResetValue (0x00000000UL) /*!< Reset value of JOBCOUNT register.                                 */

/* COUNT @Bits 0..31 : Sink job count */
  #define MVDMA_SINK_JOBCOUNT_COUNT_Pos (0UL)        /*!< Position of COUNT field.                                             */
  #define MVDMA_SINK_JOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_SINK_JOBCOUNT_COUNT_Pos) /*!< Bit mask of COUNT field.          */


/* ====================================================== Struct MVDMA ======================================================= */
/**
  * @brief MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each
            transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and
            they contain data buffer information, address pointers, buffer sizes and data type attributes.

  */
  typedef struct {                                   /*!< MVDMA Structure                                                      */
    __OM uint32_t TASKS_PAUSE;                       /*!< (@ 0x00000000) Pause operation.                                      */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000004) Reset operation.                                      */
    __OM uint32_t TASKS_START[8];                    /*!< (@ 0x00000008) Start operation of job list n. Base address for
                                                                         successive TASKS_STARTs.*/
    __IM uint32_t RESERVED[24];
    __IOM uint32_t SUBSCRIBE_START[8];               /*!< (@ 0x00000088) Subscribe configuration for task START[n]             */
    __IM uint32_t RESERVED1[22];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000100) Event indicating that Sink data descriptor list has
                                                                         been completed.*/
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000104) Event indicating that the source list processing has
                                                                         started.*/
    __IOM uint32_t EVENTS_PAUSED;                    /*!< (@ 0x00000108) Event indicating that the data transfer has been
                                                                         paused.*/
    __IOM uint32_t EVENTS_RESET;                     /*!< (@ 0x0000010C) Event indicating that the peripheral has been reset.  */
    __IOM NRF_MVDMA_EVENTS_SOURCE_Type EVENTS_SOURCE; /*!< (@ 0x00000110) Peripheral events.                                   */
    __IOM NRF_MVDMA_EVENTS_SINK_Type EVENTS_SINK;    /*!< (@ 0x00000118) Peripheral events.                                    */
    __IOM uint32_t EVENTS_COMPLETED[8];              /*!< (@ 0x00000120) Event indicating that the operation started by the task
                                                                         START[n] has been completed. Base address for
                                                                         successive EVENTS_COMPLETED.*/
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000180) Publish configuration for event END                   */
    __IM uint32_t RESERVED3[3];
    __IOM NRF_MVDMA_PUBLISH_SOURCE_Type PUBLISH_SOURCE; /*!< (@ 0x00000190) Publish configuration for events                   */
    __IOM NRF_MVDMA_PUBLISH_SINK_Type PUBLISH_SINK;  /*!< (@ 0x00000198) Publish configuration for events                      */
    __IOM uint32_t PUBLISH_COMPLETED[8];             /*!< (@ 0x000001A0) Publish configuration for event COMPLETED[n]          */
    __IM uint32_t RESERVED4[80];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IOM NRF_MVDMA_STATUS_Type STATUS;              /*!< (@ 0x00000400) MVDMA status registers.                               */
    __IM uint32_t RESERVED6[61];
    __IOM NRF_MVDMA_CONFIG_Type CONFIG;              /*!< (@ 0x00000500) MVDMA configuration registers.                        */
    __IM uint32_t RESERVED7[62];
    __IOM NRF_MVDMA_SOURCE_Type SOURCE;              /*!< (@ 0x00000600) Source channel configuration and status.              */
    __IM uint32_t RESERVED8[4];
    __IOM NRF_MVDMA_SINK_Type SINK;                  /*!< (@ 0x00000620) Sink channel configuration and status.                */
  } NRF_MVDMA_Type;                                  /*!< Size = 1584 (0x630)                                                  */

/* MVDMA_TASKS_PAUSE: Pause operation. */
  #define MVDMA_TASKS_PAUSE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PAUSE register.                                */

/* TASKS_PAUSE @Bit 0 : Pause operation. */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos (0UL)    /*!< Position of TASKS_PAUSE field.                                       */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Msk (0x1UL << MVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos) /*!< Bit mask of TASKS_PAUSE field.   */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Min (0x1UL)  /*!< Min enumerator value of TASKS_PAUSE field.                           */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Max (0x1UL)  /*!< Max enumerator value of TASKS_PAUSE field.                           */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Trigger (0x1UL) /*!< Trigger task                                                      */


/* MVDMA_TASKS_RESET: Reset operation. */
  #define MVDMA_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                                */

