NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define MVDMA_INTENSET_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define MVDMA_INTENSET_STARTED_Msk (0x1UL << MVDMA_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define MVDMA_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define MVDMA_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define MVDMA_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define MVDMA_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* PAUSED @Bit 2 : Write '1' to enable interrupt for event PAUSED */
  #define MVDMA_INTENSET_PAUSED_Pos (2UL)            /*!< Position of PAUSED field.                                            */
  #define MVDMA_INTENSET_PAUSED_Msk (0x1UL << MVDMA_INTENSET_PAUSED_Pos) /*!< Bit mask of PAUSED field.                        */
  #define MVDMA_INTENSET_PAUSED_Min (0x0UL)          /*!< Min enumerator value of PAUSED field.                                */
  #define MVDMA_INTENSET_PAUSED_Max (0x1UL)          /*!< Max enumerator value of PAUSED field.                                */
  #define MVDMA_INTENSET_PAUSED_Set (0x1UL)          /*!< Enable                                                               */
  #define MVDMA_INTENSET_PAUSED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_PAUSED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RESET @Bit 3 : Write '1' to enable interrupt for event RESET */
  #define MVDMA_INTENSET_RESET_Pos (3UL)             /*!< Position of RESET field.                                             */
  #define MVDMA_INTENSET_RESET_Msk (0x1UL << MVDMA_INTENSET_RESET_Pos) /*!< Bit mask of RESET field.                           */
  #define MVDMA_INTENSET_RESET_Min (0x0UL)           /*!< Min enumerator value of RESET field.                                 */
  #define MVDMA_INTENSET_RESET_Max (0x1UL)           /*!< Max enumerator value of RESET field.                                 */
  #define MVDMA_INTENSET_RESET_Set (0x1UL)           /*!< Enable                                                               */
  #define MVDMA_INTENSET_RESET_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_RESET_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* SOURCEBUSERROR @Bit 4 : Write '1' to enable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Pos (4UL)    /*!< Position of SOURCEBUSERROR field.                                    */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SOURCEBUSERROR_Pos) /*!< Bit mask of SOURCEBUSERROR field.*/
  #define MVDMA_INTENSET_SOURCEBUSERROR_Min (0x0UL)  /*!< Min enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Max (0x1UL)  /*!< Max enumerator value of SOURCEBUSERROR field.                        */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Set (0x1UL)  /*!< Enable                                                               */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SOURCESELECTJOBDONE @Bit 5 : Write '1' to enable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos (5UL) /*!< Position of SOURCESELECTJOBDONE field.                             */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SOURCESELECTJOBDONE field.               */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Set (0x1UL) /*!< Enable                                                           */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                              */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                */

/* SINKBUSERROR @Bit 6 : Write '1' to enable interrupt for event SINKBUSERROR */
  #define MVDMA_INTENSET_SINKBUSERROR_Pos (6UL)      /*!< Position of SINKBUSERROR field.                                      */
  #define MVDMA_INTENSET_SINKBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SINKBUSERROR_Pos) /*!< Bit mask of SINKBUSERROR field.      */
  #define MVDMA_INTENSET_SINKBUSERROR_Min (0x0UL)    /*!< Min enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENSET_SINKBUSERROR_Max (0x1UL)    /*!< Max enumerator value of SINKBUSERROR field.                          */
  #define MVDMA_INTENSET_SINKBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define MVDMA_INTENSET_SINKBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define MVDMA_INTENSET_SINKBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* SINKSELECTJOBDONE @Bit 7 : Write '1' to enable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Pos (7UL) /*!< Position of SINKSELECTJOBDONE field.                                 */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SINKSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SINKSELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SINKSELECTJOBDONE field.                   */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Set (0x1UL) /*!< Enable                                                             */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Disabled (0x0UL) /*!< Read: Disabled                                                */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Enabled (0x1UL) /*!< Read: Enabled                                                  */

/* COMPLETED0 @Bit 8 : Write '1' to enable interrupt for event COMPLETED[0] */
  #define MVDMA_INTENSET_COMPLETED0_Pos (8UL)        /*!< Position of COMPLETED0 field.                                        */
  #define MVDMA_INTENSET_COMPLETED0_Msk (0x1UL << MVDMA_INTENSET_COMPLETED0_Pos) /*!< Bit mask of COMPLETED0 field.            */
  #define MVDMA_INTENSET_COMPLETED0_Min (0x0UL)      /*!< Min enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTENSET_COMPLETED0_Max (0x1UL)      /*!< Max enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTENSET_COMPLETED0_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED0_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED0_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED1 @Bit 9 : Write '1' to enable interrupt for event COMPLETED[1] */
  #define MVDMA_INTENSET_COMPLETED1_Pos (9UL)        /*!< Position of COMPLETED1 field.                                        */
  #define MVDMA_INTENSET_COMPLETED1_Msk (0x1UL << MVDMA_INTENSET_COMPLETED1_Pos) /*!< Bit mask of COMPLETED1 field.            */
  #define MVDMA_INTENSET_COMPLETED1_Min (0x0UL)      /*!< Min enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTENSET_COMPLETED1_Max (0x1UL)      /*!< Max enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTENSET_COMPLETED1_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED2 @Bit 10 : Write '1' to enable interrupt for event COMPLETED[2] */
  #define MVDMA_INTENSET_COMPLETED2_Pos (10UL)       /*!< Position of COMPLETED2 field.                                        */
  #define MVDMA_INTENSET_COMPLETED2_Msk (0x1UL << MVDMA_INTENSET_COMPLETED2_Pos) /*!< Bit mask of COMPLETED2 field.            */
  #define MVDMA_INTENSET_COMPLETED2_Min (0x0UL)      /*!< Min enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTENSET_COMPLETED2_Max (0x1UL)      /*!< Max enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTENSET_COMPLETED2_Set (0x1UL)      /*!< Enable                                                               */
  #define MVDMA_INTENSET_COMPLETED2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENSET_COMPLETED2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

