NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* COMPLETED2 @Bit 10 : Write '1' to disable interrupt for event COMPLETED[2] */
  #define MVDMA_INTENCLR_COMPLETED2_Pos (10UL)       /*!< Position of COMPLETED2 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED2_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED2_Pos) /*!< Bit mask of COMPLETED2 field.            */
  #define MVDMA_INTENCLR_COMPLETED2_Min (0x0UL)      /*!< Min enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTENCLR_COMPLETED2_Max (0x1UL)      /*!< Max enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTENCLR_COMPLETED2_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED3 @Bit 11 : Write '1' to disable interrupt for event COMPLETED[3] */
  #define MVDMA_INTENCLR_COMPLETED3_Pos (11UL)       /*!< Position of COMPLETED3 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED3_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED3_Pos) /*!< Bit mask of COMPLETED3 field.            */
  #define MVDMA_INTENCLR_COMPLETED3_Min (0x0UL)      /*!< Min enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTENCLR_COMPLETED3_Max (0x1UL)      /*!< Max enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTENCLR_COMPLETED3_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED4 @Bit 12 : Write '1' to disable interrupt for event COMPLETED[4] */
  #define MVDMA_INTENCLR_COMPLETED4_Pos (12UL)       /*!< Position of COMPLETED4 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED4_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED4_Pos) /*!< Bit mask of COMPLETED4 field.            */
  #define MVDMA_INTENCLR_COMPLETED4_Min (0x0UL)      /*!< Min enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTENCLR_COMPLETED4_Max (0x1UL)      /*!< Max enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTENCLR_COMPLETED4_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED4_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED4_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED5 @Bit 13 : Write '1' to disable interrupt for event COMPLETED[5] */
  #define MVDMA_INTENCLR_COMPLETED5_Pos (13UL)       /*!< Position of COMPLETED5 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED5_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED5_Pos) /*!< Bit mask of COMPLETED5 field.            */
  #define MVDMA_INTENCLR_COMPLETED5_Min (0x0UL)      /*!< Min enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTENCLR_COMPLETED5_Max (0x1UL)      /*!< Max enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTENCLR_COMPLETED5_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED5_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED5_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED6 @Bit 14 : Write '1' to disable interrupt for event COMPLETED[6] */
  #define MVDMA_INTENCLR_COMPLETED6_Pos (14UL)       /*!< Position of COMPLETED6 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED6_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED6_Pos) /*!< Bit mask of COMPLETED6 field.            */
  #define MVDMA_INTENCLR_COMPLETED6_Min (0x0UL)      /*!< Min enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTENCLR_COMPLETED6_Max (0x1UL)      /*!< Max enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTENCLR_COMPLETED6_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED6_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED6_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPLETED7 @Bit 15 : Write '1' to disable interrupt for event COMPLETED[7] */
  #define MVDMA_INTENCLR_COMPLETED7_Pos (15UL)       /*!< Position of COMPLETED7 field.                                        */
  #define MVDMA_INTENCLR_COMPLETED7_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED7_Pos) /*!< Bit mask of COMPLETED7 field.            */
  #define MVDMA_INTENCLR_COMPLETED7_Min (0x0UL)      /*!< Min enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTENCLR_COMPLETED7_Max (0x1UL)      /*!< Max enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTENCLR_COMPLETED7_Clear (0x1UL)    /*!< Disable                                                              */
  #define MVDMA_INTENCLR_COMPLETED7_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MVDMA_INTENCLR_COMPLETED7_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* MVDMA_INTPEND: Pending interrupts */
  #define MVDMA_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* END @Bit 0 : Read pending status of interrupt for event END */
  #define MVDMA_INTPEND_END_Pos (0UL)                /*!< Position of END field.                                               */
  #define MVDMA_INTPEND_END_Msk (0x1UL << MVDMA_INTPEND_END_Pos) /*!< Bit mask of END field.                                   */
  #define MVDMA_INTPEND_END_Min (0x0UL)              /*!< Min enumerator value of END field.                                   */
  #define MVDMA_INTPEND_END_Max (0x1UL)              /*!< Max enumerator value of END field.                                   */
  #define MVDMA_INTPEND_END_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define MVDMA_INTPEND_END_Pending (0x1UL)          /*!< Read: Pending                                                        */

