NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* COMPLETED0 @Bit 8 : Read pending status of interrupt for event COMPLETED[0] */
  #define MVDMA_INTPEND_COMPLETED0_Pos (8UL)         /*!< Position of COMPLETED0 field.                                        */
  #define MVDMA_INTPEND_COMPLETED0_Msk (0x1UL << MVDMA_INTPEND_COMPLETED0_Pos) /*!< Bit mask of COMPLETED0 field.              */
  #define MVDMA_INTPEND_COMPLETED0_Min (0x0UL)       /*!< Min enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTPEND_COMPLETED0_Max (0x1UL)       /*!< Max enumerator value of COMPLETED0 field.                            */
  #define MVDMA_INTPEND_COMPLETED0_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED0_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED1 @Bit 9 : Read pending status of interrupt for event COMPLETED[1] */
  #define MVDMA_INTPEND_COMPLETED1_Pos (9UL)         /*!< Position of COMPLETED1 field.                                        */
  #define MVDMA_INTPEND_COMPLETED1_Msk (0x1UL << MVDMA_INTPEND_COMPLETED1_Pos) /*!< Bit mask of COMPLETED1 field.              */
  #define MVDMA_INTPEND_COMPLETED1_Min (0x0UL)       /*!< Min enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTPEND_COMPLETED1_Max (0x1UL)       /*!< Max enumerator value of COMPLETED1 field.                            */
  #define MVDMA_INTPEND_COMPLETED1_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED1_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED2 @Bit 10 : Read pending status of interrupt for event COMPLETED[2] */
  #define MVDMA_INTPEND_COMPLETED2_Pos (10UL)        /*!< Position of COMPLETED2 field.                                        */
  #define MVDMA_INTPEND_COMPLETED2_Msk (0x1UL << MVDMA_INTPEND_COMPLETED2_Pos) /*!< Bit mask of COMPLETED2 field.              */
  #define MVDMA_INTPEND_COMPLETED2_Min (0x0UL)       /*!< Min enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTPEND_COMPLETED2_Max (0x1UL)       /*!< Max enumerator value of COMPLETED2 field.                            */
  #define MVDMA_INTPEND_COMPLETED2_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED2_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED3 @Bit 11 : Read pending status of interrupt for event COMPLETED[3] */
  #define MVDMA_INTPEND_COMPLETED3_Pos (11UL)        /*!< Position of COMPLETED3 field.                                        */
  #define MVDMA_INTPEND_COMPLETED3_Msk (0x1UL << MVDMA_INTPEND_COMPLETED3_Pos) /*!< Bit mask of COMPLETED3 field.              */
  #define MVDMA_INTPEND_COMPLETED3_Min (0x0UL)       /*!< Min enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTPEND_COMPLETED3_Max (0x1UL)       /*!< Max enumerator value of COMPLETED3 field.                            */
  #define MVDMA_INTPEND_COMPLETED3_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED3_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED4 @Bit 12 : Read pending status of interrupt for event COMPLETED[4] */
  #define MVDMA_INTPEND_COMPLETED4_Pos (12UL)        /*!< Position of COMPLETED4 field.                                        */
  #define MVDMA_INTPEND_COMPLETED4_Msk (0x1UL << MVDMA_INTPEND_COMPLETED4_Pos) /*!< Bit mask of COMPLETED4 field.              */
  #define MVDMA_INTPEND_COMPLETED4_Min (0x0UL)       /*!< Min enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTPEND_COMPLETED4_Max (0x1UL)       /*!< Max enumerator value of COMPLETED4 field.                            */
  #define MVDMA_INTPEND_COMPLETED4_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED4_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED5 @Bit 13 : Read pending status of interrupt for event COMPLETED[5] */
  #define MVDMA_INTPEND_COMPLETED5_Pos (13UL)        /*!< Position of COMPLETED5 field.                                        */
  #define MVDMA_INTPEND_COMPLETED5_Msk (0x1UL << MVDMA_INTPEND_COMPLETED5_Pos) /*!< Bit mask of COMPLETED5 field.              */
  #define MVDMA_INTPEND_COMPLETED5_Min (0x0UL)       /*!< Min enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTPEND_COMPLETED5_Max (0x1UL)       /*!< Max enumerator value of COMPLETED5 field.                            */
  #define MVDMA_INTPEND_COMPLETED5_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED5_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED6 @Bit 14 : Read pending status of interrupt for event COMPLETED[6] */
  #define MVDMA_INTPEND_COMPLETED6_Pos (14UL)        /*!< Position of COMPLETED6 field.                                        */
  #define MVDMA_INTPEND_COMPLETED6_Msk (0x1UL << MVDMA_INTPEND_COMPLETED6_Pos) /*!< Bit mask of COMPLETED6 field.              */
  #define MVDMA_INTPEND_COMPLETED6_Min (0x0UL)       /*!< Min enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTPEND_COMPLETED6_Max (0x1UL)       /*!< Max enumerator value of COMPLETED6 field.                            */
  #define MVDMA_INTPEND_COMPLETED6_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED6_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* COMPLETED7 @Bit 15 : Read pending status of interrupt for event COMPLETED[7] */
  #define MVDMA_INTPEND_COMPLETED7_Pos (15UL)        /*!< Position of COMPLETED7 field.                                        */
  #define MVDMA_INTPEND_COMPLETED7_Msk (0x1UL << MVDMA_INTPEND_COMPLETED7_Pos) /*!< Bit mask of COMPLETED7 field.              */
  #define MVDMA_INTPEND_COMPLETED7_Min (0x0UL)       /*!< Min enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTPEND_COMPLETED7_Max (0x1UL)       /*!< Max enumerator value of COMPLETED7 field.                            */
  #define MVDMA_INTPEND_COMPLETED7_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MVDMA_INTPEND_COMPLETED7_Pending (0x1UL)   /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           NFCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct NFCT_FRAMESTATUS ================================================= */
/**
  * @brief FRAMESTATUS [NFCT_FRAMESTATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RX;                                /*!< (@ 0x00000000) Result of last incoming frame                         */
} NRF_NFCT_FRAMESTATUS_Type;                         /*!< Size = 4 (0x004)                                                     */

/* NFCT_FRAMESTATUS_RX: Result of last incoming frame */
  #define NFCT_FRAMESTATUS_RX_ResetValue (0x00000000UL) /*!< Reset value of RX register.                                       */

/* CRCERROR @Bit 0 : No valid end of frame (EoF) detected */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Pos (0UL)     /*!< Position of CRCERROR field.                                          */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Msk (0x1UL << NFCT_FRAMESTATUS_RX_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.        */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Min (0x0UL)   /*!< Min enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Max (0x1UL)   /*!< Max enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCCorrect (0x0UL) /*!< Valid CRC detected                                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCError (0x1UL) /*!< CRC received does not match local check                           */

/* PARITYSTATUS @Bit 2 : Parity status of received frame */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos (2UL) /*!< Position of PARITYSTATUS field.                                      */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Msk (0x1UL << NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos) /*!< Bit mask of PARITYSTATUS
                                                                            field.*/
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Min (0x0UL) /*!< Min enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Max (0x1UL) /*!< Max enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityOK (0x0UL) /*!< Frame received with parity OK                                 */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityError (0x1UL) /*!< Frame received with parity error                           */

/* OVERRUN @Bit 3 : Overrun detected */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Pos (3UL)      /*!< Position of OVERRUN field.                                           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Msk (0x1UL << NFCT_FRAMESTATUS_RX_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Min (0x0UL)    /*!< Min enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Max (0x1UL)    /*!< Max enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_NoOverrun (0x0UL) /*!< No overrun detected                                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Overrun (0x1UL) /*!< Overrun error                                                       */



