NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* STARTED @Bit 20 : Write '1' to enable interrupt for event STARTED */
  #define NFCT_INTENSET_STARTED_Pos (20UL)           /*!< Position of STARTED field.                                           */
  #define NFCT_INTENSET_STARTED_Msk (0x1UL << NFCT_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define NFCT_INTENSET_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define NFCT_INTENSET_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define NFCT_INTENSET_STARTED_Set (0x1UL)          /*!< Enable                                                               */
  #define NFCT_INTENSET_STARTED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_STARTED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* NFCT_INTENCLR: Disable interrupt */
  #define NFCT_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define NFCT_INTENCLR_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define NFCT_INTENCLR_READY_Msk (0x1UL << NFCT_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                             */
  #define NFCT_INTENCLR_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define NFCT_INTENCLR_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define NFCT_INTENCLR_READY_Clear (0x1UL)          /*!< Disable                                                              */
  #define NFCT_INTENCLR_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* FIELDDETECTED @Bit 1 : Write '1' to disable interrupt for event FIELDDETECTED */
  #define NFCT_INTENCLR_FIELDDETECTED_Pos (1UL)      /*!< Position of FIELDDETECTED field.                                     */
  #define NFCT_INTENCLR_FIELDDETECTED_Msk (0x1UL << NFCT_INTENCLR_FIELDDETECTED_Pos) /*!< Bit mask of FIELDDETECTED field.     */
  #define NFCT_INTENCLR_FIELDDETECTED_Min (0x0UL)    /*!< Min enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENCLR_FIELDDETECTED_Max (0x1UL)    /*!< Max enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENCLR_FIELDDETECTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define NFCT_INTENCLR_FIELDDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define NFCT_INTENCLR_FIELDDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* FIELDLOST @Bit 2 : Write '1' to disable interrupt for event FIELDLOST */
  #define NFCT_INTENCLR_FIELDLOST_Pos (2UL)          /*!< Position of FIELDLOST field.                                         */
  #define NFCT_INTENCLR_FIELDLOST_Msk (0x1UL << NFCT_INTENCLR_FIELDLOST_Pos) /*!< Bit mask of FIELDLOST field.                 */
  #define NFCT_INTENCLR_FIELDLOST_Min (0x0UL)        /*!< Min enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENCLR_FIELDLOST_Max (0x1UL)        /*!< Max enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENCLR_FIELDLOST_Clear (0x1UL)      /*!< Disable                                                              */
  #define NFCT_INTENCLR_FIELDLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_FIELDLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TXFRAMESTART @Bit 3 : Write '1' to disable interrupt for event TXFRAMESTART */
  #define NFCT_INTENCLR_TXFRAMESTART_Pos (3UL)       /*!< Position of TXFRAMESTART field.                                      */
  #define NFCT_INTENCLR_TXFRAMESTART_Msk (0x1UL << NFCT_INTENCLR_TXFRAMESTART_Pos) /*!< Bit mask of TXFRAMESTART field.        */
  #define NFCT_INTENCLR_TXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENCLR_TXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENCLR_TXFRAMESTART_Clear (0x1UL)   /*!< Disable                                                              */
  #define NFCT_INTENCLR_TXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENCLR_TXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* TXFRAMEEND @Bit 4 : Write '1' to disable interrupt for event TXFRAMEEND */
  #define NFCT_INTENCLR_TXFRAMEEND_Pos (4UL)         /*!< Position of TXFRAMEEND field.                                        */
  #define NFCT_INTENCLR_TXFRAMEEND_Msk (0x1UL << NFCT_INTENCLR_TXFRAMEEND_Pos) /*!< Bit mask of TXFRAMEEND field.              */
  #define NFCT_INTENCLR_TXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENCLR_TXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENCLR_TXFRAMEEND_Clear (0x1UL)     /*!< Disable                                                              */
  #define NFCT_INTENCLR_TXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_TXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXFRAMESTART @Bit 5 : Write '1' to disable interrupt for event RXFRAMESTART */
  #define NFCT_INTENCLR_RXFRAMESTART_Pos (5UL)       /*!< Position of RXFRAMESTART field.                                      */
  #define NFCT_INTENCLR_RXFRAMESTART_Msk (0x1UL << NFCT_INTENCLR_RXFRAMESTART_Pos) /*!< Bit mask of RXFRAMESTART field.        */
  #define NFCT_INTENCLR_RXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENCLR_RXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENCLR_RXFRAMESTART_Clear (0x1UL)   /*!< Disable                                                              */
  #define NFCT_INTENCLR_RXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENCLR_RXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* RXFRAMEEND @Bit 6 : Write '1' to disable interrupt for event RXFRAMEEND */
  #define NFCT_INTENCLR_RXFRAMEEND_Pos (6UL)         /*!< Position of RXFRAMEEND field.                                        */
  #define NFCT_INTENCLR_RXFRAMEEND_Msk (0x1UL << NFCT_INTENCLR_RXFRAMEEND_Pos) /*!< Bit mask of RXFRAMEEND field.              */
  #define NFCT_INTENCLR_RXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENCLR_RXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENCLR_RXFRAMEEND_Clear (0x1UL)     /*!< Disable                                                              */
  #define NFCT_INTENCLR_RXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENCLR_RXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

