NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* SOFTCYCLES @Bits 14..17 : Custom number of cycles for soft gain/mute function 32*(Multiplication+1) steps */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Pos (14UL)      /*!< Position of SOFTCYCLES field.                                        */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Msk (0xFUL << PDM_FILTER_CTRL_SOFTCYCLES_Pos) /*!< Bit mask of SOFTCYCLES field.          */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Min (0x0UL)     /*!< Min value of SOFTCYCLES field.                                       */
  #define PDM_FILTER_CTRL_SOFTCYCLES_Max (0xFUL)     /*!< Max size of SOFTCYCLES field.                                        */

/* DATASAMPLEDELAY @Bits 19..20 : Input data sampling point delay in PDM_CLK cycels */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Pos (19UL) /*!< Position of DATASAMPLEDELAY field.                                   */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Msk (0x3UL << PDM_FILTER_CTRL_DATASAMPLEDELAY_Pos) /*!< Bit mask of DATASAMPLEDELAY
                                                                            field.*/
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Min (0x0UL) /*!< Min enumerator value of DATASAMPLEDELAY field.                      */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_Max (0x3UL) /*!< Max enumerator value of DATASAMPLEDELAY field.                      */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_NoDelay (0x0UL) /*!< No added delay                                                  */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnLeft (0x1UL) /*!< 1 clock cycle delay on left channel                         */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnRight (0x2UL) /*!< 1 clock cycle delay on right channel                       */
  #define PDM_FILTER_CTRL_DATASAMPLEDELAY_DelayOnBoth (0x3UL) /*!< 1 clock cycle delay on both channels                        */

/* CICFILTERMSBCUSTOM @Bits 21..24 : Defines MSB for CIC fliter when RATIO is set to 'Custom' */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Pos (21UL) /*!< Position of CICFILTERMSBCUSTOM field.                             */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Msk (0xFUL << PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Pos) /*!< Bit mask of
                                                                            CICFILTERMSBCUSTOM field.*/
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Min (0x0UL) /*!< Min enumerator value of CICFILTERMSBCUSTOM field.                */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Max (0xFUL) /*!< Max enumerator value of CICFILTERMSBCUSTOM field.                */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range0 (0x0UL) /*!< OSR range low 4 OSR range high 32                             */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range1 (0x1UL) /*!< OSR range low 34 OSR range high 36                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range2 (0x2UL) /*!< OSR range low 38 OSR range high 42                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range3 (0x3UL) /*!< OSR range low 44 OSR range high 48                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range4 (0x4UL) /*!< OSR range low 50 OSR range high 54                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range5 (0x5UL) /*!< OSR range low 56 OSR range high 64                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range6 (0x6UL) /*!< OSR range low 66 OSR range high 72                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range7 (0x7UL) /*!< OSR range low 74 OSR range high 84                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range8 (0x8UL) /*!< OSR range low 86 OSR range high 96                            */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range9 (0x9UL) /*!< OSR range low 98 OSR range high 110                           */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range10 (0xAUL) /*!< OSR range low 112 OSR range high 128                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range11 (0xBUL) /*!< OSR range low 130 OSR range high 146                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range12 (0xCUL) /*!< OSR range low 148 OSR range high 168                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range13 (0xDUL) /*!< OSR range low 170 OSR range high 194                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range14 (0xEUL) /*!< OSR range low 196 OSR range high 222                         */
  #define PDM_FILTER_CTRL_CICFILTERMSBCUSTOM_Range15 (0xFUL) /*!< OSR range low 224 OSR range high 256                         */

/* DECRATIO @Bits 25..31 : Configures decimation ratio to any even number between 6 and 256 */
  #define PDM_FILTER_CTRL_DECRATIO_Pos (25UL)        /*!< Position of DECRATIO field.                                          */
  #define PDM_FILTER_CTRL_DECRATIO_Msk (0x7FUL << PDM_FILTER_CTRL_DECRATIO_Pos) /*!< Bit mask of DECRATIO field.               */
  #define PDM_FILTER_CTRL_DECRATIO_Min (0x02UL)      /*!< Min value of DECRATIO field.                                         */
  #define PDM_FILTER_CTRL_DECRATIO_Max (0x7FUL)      /*!< Max size of DECRATIO field.                                          */


/* PDM_FILTER_HPPOLE: Settings for the high-pass filter */
  #define PDM_FILTER_HPPOLE_ResetValue (0x00000005UL) /*!< Reset value of HPPOLE register.                                     */

/* HPPOLE @Bits 0..3 : Settings for the high-pass filter -3dB gain pole, assuming filter source clock of 16KHz */
  #define PDM_FILTER_HPPOLE_HPPOLE_Pos (0UL)         /*!< Position of HPPOLE field.                                            */
  #define PDM_FILTER_HPPOLE_HPPOLE_Msk (0xFUL << PDM_FILTER_HPPOLE_HPPOLE_Pos) /*!< Bit mask of HPPOLE field.                  */
  #define PDM_FILTER_HPPOLE_HPPOLE_Min (0x1UL)       /*!< Min enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_Max (0xFUL)       /*!< Max enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p16 (0xFUL)     /*!< 0.16 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p32 (0xEUL)     /*!< 0.32 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p64 (0xDUL)     /*!< 0.64 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p1p25 (0xCUL)     /*!< 1.25 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p2p5 (0xBUL)      /*!< 2.5 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p5 (0xAUL)        /*!< 5 Hz                                                                 */
  #define PDM_FILTER_HPPOLE_HPPOLE_p10 (0x9UL)       /*!< 10 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p20 (0x8UL)       /*!< 20 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p40 (0x7UL)       /*!< 40 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p79 (0x6UL)       /*!< 79 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p157 (0x5UL)      /*!< 157 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p310 (0x4UL)      /*!< 310 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p603 (0x3UL)      /*!< 603 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p1152 (0x2UL)     /*!< 1152 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p2110 (0x1UL)     /*!< 2110 Hz                                                              */


/* PDM_FILTER_HPDISABLE: High pass filter disable */
  #define PDM_FILTER_HPDISABLE_ResetValue (0x00000001UL) /*!< Reset value of HPDISABLE register.                               */

