NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* END @Bit 2 : Write '1' to disable interrupt for event END */
  #define PDM_INTENCLR_END_Pos (2UL)                 /*!< Position of END field.                                               */
  #define PDM_INTENCLR_END_Msk (0x1UL << PDM_INTENCLR_END_Pos) /*!< Bit mask of END field.                                     */
  #define PDM_INTENCLR_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define PDM_INTENCLR_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define PDM_INTENCLR_END_Clear (0x1UL)             /*!< Disable                                                              */
  #define PDM_INTENCLR_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define PDM_INTENCLR_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* DMABUSERROR @Bit 4 : Write '1' to disable interrupt for event DMABUSERROR */
  #define PDM_INTENCLR_DMABUSERROR_Pos (4UL)         /*!< Position of DMABUSERROR field.                                       */
  #define PDM_INTENCLR_DMABUSERROR_Msk (0x1UL << PDM_INTENCLR_DMABUSERROR_Pos) /*!< Bit mask of DMABUSERROR field.             */
  #define PDM_INTENCLR_DMABUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMABUSERROR field.                           */
  #define PDM_INTENCLR_DMABUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMABUSERROR field.                           */
  #define PDM_INTENCLR_DMABUSERROR_Clear (0x1UL)     /*!< Disable                                                              */
  #define PDM_INTENCLR_DMABUSERROR_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define PDM_INTENCLR_DMABUSERROR_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* PDM_INTPEND: Pending interrupts */
  #define PDM_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define PDM_INTPEND_STARTED_Pos (0UL)              /*!< Position of STARTED field.                                           */
  #define PDM_INTPEND_STARTED_Msk (0x1UL << PDM_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define PDM_INTPEND_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define PDM_INTPEND_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define PDM_INTPEND_STARTED_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define PDM_INTPEND_STARTED_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define PDM_INTPEND_STOPPED_Pos (1UL)              /*!< Position of STOPPED field.                                           */
  #define PDM_INTPEND_STOPPED_Msk (0x1UL << PDM_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define PDM_INTPEND_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define PDM_INTPEND_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define PDM_INTPEND_STOPPED_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define PDM_INTPEND_STOPPED_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* END @Bit 2 : Read pending status of interrupt for event END */
  #define PDM_INTPEND_END_Pos (2UL)                  /*!< Position of END field.                                               */
  #define PDM_INTPEND_END_Msk (0x1UL << PDM_INTPEND_END_Pos) /*!< Bit mask of END field.                                       */
  #define PDM_INTPEND_END_Min (0x0UL)                /*!< Min enumerator value of END field.                                   */
  #define PDM_INTPEND_END_Max (0x1UL)                /*!< Max enumerator value of END field.                                   */
  #define PDM_INTPEND_END_NotPending (0x0UL)         /*!< Read: Not pending                                                    */
  #define PDM_INTPEND_END_Pending (0x1UL)            /*!< Read: Pending                                                        */

/* DMABUSERROR @Bit 4 : Read pending status of interrupt for event DMABUSERROR */
  #define PDM_INTPEND_DMABUSERROR_Pos (4UL)          /*!< Position of DMABUSERROR field.                                       */
  #define PDM_INTPEND_DMABUSERROR_Msk (0x1UL << PDM_INTPEND_DMABUSERROR_Pos) /*!< Bit mask of DMABUSERROR field.               */
  #define PDM_INTPEND_DMABUSERROR_Min (0x0UL)        /*!< Min enumerator value of DMABUSERROR field.                           */
  #define PDM_INTPEND_DMABUSERROR_Max (0x1UL)        /*!< Max enumerator value of DMABUSERROR field.                           */
  #define PDM_INTPEND_DMABUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define PDM_INTPEND_DMABUSERROR_Pending (0x1UL)    /*!< Read: Pending                                                        */


/* PDM_ENABLE: PDM module enable register */
  #define PDM_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable or disable PDM module */
  #define PDM_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define PDM_ENABLE_ENABLE_Msk (0x1UL << PDM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define PDM_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define PDM_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define PDM_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


/* PDM_MODE: Defines the routing of the connected PDM microphone signals */
  #define PDM_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

