NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* SEND1 @Bit 1 : The status for tasks overflow at SUBSCRIBE_SEND[1]. */
  #define PPIB_OVERFLOW_SEND_SEND1_Pos (1UL)         /*!< Position of SEND1 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND1_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND1_Pos) /*!< Bit mask of SEND1 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND1_Min (0x0UL)       /*!< Min enumerator value of SEND1 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND1_Max (0x1UL)       /*!< Max enumerator value of SEND1 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND1_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND2 @Bit 2 : The status for tasks overflow at SUBSCRIBE_SEND[2]. */
  #define PPIB_OVERFLOW_SEND_SEND2_Pos (2UL)         /*!< Position of SEND2 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND2_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND2_Pos) /*!< Bit mask of SEND2 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND2_Min (0x0UL)       /*!< Min enumerator value of SEND2 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND2_Max (0x1UL)       /*!< Max enumerator value of SEND2 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND2_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND3 @Bit 3 : The status for tasks overflow at SUBSCRIBE_SEND[3]. */
  #define PPIB_OVERFLOW_SEND_SEND3_Pos (3UL)         /*!< Position of SEND3 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND3_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND3_Pos) /*!< Bit mask of SEND3 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND3_Min (0x0UL)       /*!< Min enumerator value of SEND3 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND3_Max (0x1UL)       /*!< Max enumerator value of SEND3 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND3_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND4 @Bit 4 : The status for tasks overflow at SUBSCRIBE_SEND[4]. */
  #define PPIB_OVERFLOW_SEND_SEND4_Pos (4UL)         /*!< Position of SEND4 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND4_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND4_Pos) /*!< Bit mask of SEND4 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND4_Min (0x0UL)       /*!< Min enumerator value of SEND4 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND4_Max (0x1UL)       /*!< Max enumerator value of SEND4 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND4_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND4_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND5 @Bit 5 : The status for tasks overflow at SUBSCRIBE_SEND[5]. */
  #define PPIB_OVERFLOW_SEND_SEND5_Pos (5UL)         /*!< Position of SEND5 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND5_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND5_Pos) /*!< Bit mask of SEND5 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND5_Min (0x0UL)       /*!< Min enumerator value of SEND5 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND5_Max (0x1UL)       /*!< Max enumerator value of SEND5 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND5_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND5_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND6 @Bit 6 : The status for tasks overflow at SUBSCRIBE_SEND[6]. */
  #define PPIB_OVERFLOW_SEND_SEND6_Pos (6UL)         /*!< Position of SEND6 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND6_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND6_Pos) /*!< Bit mask of SEND6 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND6_Min (0x0UL)       /*!< Min enumerator value of SEND6 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND6_Max (0x1UL)       /*!< Max enumerator value of SEND6 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND6_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND6_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND7 @Bit 7 : The status for tasks overflow at SUBSCRIBE_SEND[7]. */
  #define PPIB_OVERFLOW_SEND_SEND7_Pos (7UL)         /*!< Position of SEND7 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND7_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND7_Pos) /*!< Bit mask of SEND7 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND7_Min (0x0UL)       /*!< Min enumerator value of SEND7 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND7_Max (0x1UL)       /*!< Max enumerator value of SEND7 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND7_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND7_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

/* SEND8 @Bit 8 : The status for tasks overflow at SUBSCRIBE_SEND[8]. */
  #define PPIB_OVERFLOW_SEND_SEND8_Pos (8UL)         /*!< Position of SEND8 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND8_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND8_Pos) /*!< Bit mask of SEND8 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND8_Min (0x0UL)       /*!< Min enumerator value of SEND8 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND8_Max (0x1UL)       /*!< Max enumerator value of SEND8 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND8_Overflow (0x1UL)  /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND8_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                      */

