NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* SPU_FEATURE_DPPIC_CHG: Security configuration for channel group n of DPPIC */
  #define SPU_FEATURE_DPPIC_CHG_MaxCount (8UL)       /*!< Max size of CHG[8] array.                                            */
  #define SPU_FEATURE_DPPIC_CHG_MaxIndex (7UL)       /*!< Max index of CHG[8] array.                                           */
  #define SPU_FEATURE_DPPIC_CHG_MinIndex (0UL)       /*!< Min index of CHG[8] array.                                           */
  #define SPU_FEATURE_DPPIC_CHG_ResetValue (0x00100010UL) /*!< Reset value of CHG[8] register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Pos (4UL)    /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                       */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                               */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field. */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                            */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                            */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                */
  #define SPU_FEATURE_DPPIC_CHG_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                     */



/* ================================================ Struct SPU_FEATURE_GPIOTE ================================================ */
/**
  * @brief GPIOTE [SPU_FEATURE_GPIOTE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[8];                             /*!< (@ 0x00000000) Security configuration for channel o of GPIOTE[n]     */
  __IOM uint32_t  INTERRUPT[8];                      /*!< (@ 0x00000020) Security configuration for interrupt o of GPIOTE[n]   */
} NRF_SPU_FEATURE_GPIOTE_Type;                       /*!< Size = 64 (0x040)                                                    */
  #define SPU_FEATURE_GPIOTE_MaxCount (2UL)          /*!< Size of GPIOTE[2] array.                                             */
  #define SPU_FEATURE_GPIOTE_MaxIndex (1UL)          /*!< Max index of GPIOTE[2] array.                                        */
  #define SPU_FEATURE_GPIOTE_MinIndex (0UL)          /*!< Min index of GPIOTE[2] array.                                        */

/* SPU_FEATURE_GPIOTE_CH: Security configuration for channel o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_CH_MaxCount (8UL)       /*!< Max size of CH[8] array.                                             */
  #define SPU_FEATURE_GPIOTE_CH_MaxIndex (7UL)       /*!< Max index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_MinIndex (0UL)       /*!< Min index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_ResetValue (0x00100010UL) /*!< Reset value of CH[8] register.                                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Pos (4UL)    /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                               */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */

/* PRIVLATTR @Bit 11 : PRIVLATTR feature */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Pos (11UL) /*!< Position of PRIVLATTR field.                                         */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Pos) /*!< Bit mask of PRIVLATTR field. */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Min (0x0UL) /*!< Min enumerator value of PRIVLATTR field.                            */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Max (0x1UL) /*!< Max enumerator value of PRIVLATTR field.                            */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Unprivileged (0x0UL) /*!< Feature is available for Unprivileged usage                */
  #define SPU_FEATURE_GPIOTE_CH_PRIVLATTR_Privileged (0x1UL) /*!< Feature is reserved for Privileged usage                     */


/* SPU_FEATURE_GPIOTE_INTERRUPT: Security configuration for interrupt o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxCount (8UL) /*!< Max size of INTERRUPT[8] array.                                     */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxIndex (7UL) /*!< Max index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MinIndex (0UL) /*!< Min index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_ResetValue (0x00100010UL) /*!< Reset value of INTERRUPT[8] register.                    */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

