NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* Rx7Enable @Bit 7 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Pos (7UL) /*!< Position of Rx7Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Pos) /*!< Bit mask of Rx7Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Min (0x0UL) /*!< Min enumerator value of Rx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Max (0x1UL) /*!< Max enumerator value of Rx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx7Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Tx0Enable @Bit 16 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Pos (16UL) /*!< Position of Tx0Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Pos) /*!< Bit mask of Tx0Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Min (0x0UL) /*!< Min enumerator value of Tx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Max (0x1UL) /*!< Max enumerator value of Tx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx0Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx1Enable @Bit 17 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Pos (17UL) /*!< Position of Tx1Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Pos) /*!< Bit mask of Tx1Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Min (0x0UL) /*!< Min enumerator value of Tx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Max (0x1UL) /*!< Max enumerator value of Tx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx1Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx2Enable @Bit 18 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Pos (18UL) /*!< Position of Tx2Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Pos) /*!< Bit mask of Tx2Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Min (0x0UL) /*!< Min enumerator value of Tx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Max (0x1UL) /*!< Max enumerator value of Tx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx2Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx3Enable @Bit 19 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Pos (19UL) /*!< Position of Tx3Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Pos) /*!< Bit mask of Tx3Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Min (0x0UL) /*!< Min enumerator value of Tx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Max (0x1UL) /*!< Max enumerator value of Tx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx3Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx4Enable @Bit 20 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Pos (20UL) /*!< Position of Tx4Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Pos) /*!< Bit mask of Tx4Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Min (0x0UL) /*!< Min enumerator value of Tx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Max (0x1UL) /*!< Max enumerator value of Tx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx4Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx5Enable @Bit 21 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Pos (21UL) /*!< Position of Tx5Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Pos) /*!< Bit mask of Tx5Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Min (0x0UL) /*!< Min enumerator value of Tx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Max (0x1UL) /*!< Max enumerator value of Tx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx5Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx6Enable @Bit 22 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Pos (22UL) /*!< Position of Tx6Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Pos) /*!< Bit mask of Tx6Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Min (0x0UL) /*!< Min enumerator value of Tx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Max (0x1UL) /*!< Max enumerator value of Tx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx6Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */

/* Tx7Enable @Bit 23 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Pos (23UL) /*!< Position of Tx7Enable field.                                       */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Pos) /*!< Bit mask of Tx7Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Min (0x0UL) /*!< Min enumerator value of Tx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Max (0x1UL) /*!< Max enumerator value of Tx7Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Disable (0x0UL) /*!< Disable Tx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Tx7Enable_Enable (0x1UL) /*!< Enable Tx channel data.                                        */


