NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* COMPARE4 @Bit 20 : Write '1' to disable interrupt for event COMPARE[4] */
  #define TIMER_INTENCLR_COMPARE4_Pos (20UL)         /*!< Position of COMPARE4 field.                                          */
  #define TIMER_INTENCLR_COMPARE4_Msk (0x1UL << TIMER_INTENCLR_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                  */
  #define TIMER_INTENCLR_COMPARE4_Min (0x0UL)        /*!< Min enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENCLR_COMPARE4_Max (0x1UL)        /*!< Max enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENCLR_COMPARE4_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE5 @Bit 21 : Write '1' to disable interrupt for event COMPARE[5] */
  #define TIMER_INTENCLR_COMPARE5_Pos (21UL)         /*!< Position of COMPARE5 field.                                          */
  #define TIMER_INTENCLR_COMPARE5_Msk (0x1UL << TIMER_INTENCLR_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                  */
  #define TIMER_INTENCLR_COMPARE5_Min (0x0UL)        /*!< Min enumerator value of COMPARE5 field.                              */
  #define TIMER_INTENCLR_COMPARE5_Max (0x1UL)        /*!< Max enumerator value of COMPARE5 field.                              */
  #define TIMER_INTENCLR_COMPARE5_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE5_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE5_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE6 @Bit 22 : Write '1' to disable interrupt for event COMPARE[6] */
  #define TIMER_INTENCLR_COMPARE6_Pos (22UL)         /*!< Position of COMPARE6 field.                                          */
  #define TIMER_INTENCLR_COMPARE6_Msk (0x1UL << TIMER_INTENCLR_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                  */
  #define TIMER_INTENCLR_COMPARE6_Min (0x0UL)        /*!< Min enumerator value of COMPARE6 field.                              */
  #define TIMER_INTENCLR_COMPARE6_Max (0x1UL)        /*!< Max enumerator value of COMPARE6 field.                              */
  #define TIMER_INTENCLR_COMPARE6_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE6_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE6_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE7 @Bit 23 : Write '1' to disable interrupt for event COMPARE[7] */
  #define TIMER_INTENCLR_COMPARE7_Pos (23UL)         /*!< Position of COMPARE7 field.                                          */
  #define TIMER_INTENCLR_COMPARE7_Msk (0x1UL << TIMER_INTENCLR_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                  */
  #define TIMER_INTENCLR_COMPARE7_Min (0x0UL)        /*!< Min enumerator value of COMPARE7 field.                              */
  #define TIMER_INTENCLR_COMPARE7_Max (0x1UL)        /*!< Max enumerator value of COMPARE7 field.                              */
  #define TIMER_INTENCLR_COMPARE7_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE7_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE7_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* TIMER_MODE: Timer mode selection */
  #define TIMER_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Timer mode */
  #define TIMER_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define TIMER_MODE_MODE_Msk (0x3UL << TIMER_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define TIMER_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define TIMER_MODE_MODE_Max (0x2UL)                /*!< Max enumerator value of MODE field.                                  */
  #define TIMER_MODE_MODE_Timer (0x0UL)              /*!< Select Timer mode                                                    */
  #define TIMER_MODE_MODE_Counter (0x1UL)            /*!< Select Counter mode                                                  */
  #define TIMER_MODE_MODE_LowPowerCounter (0x2UL)    /*!< Select Low Power Counter mode                                        */


/* TIMER_BITMODE: Configure the number of bits used by the TIMER */
  #define TIMER_BITMODE_ResetValue (0x00000000UL)    /*!< Reset value of BITMODE register.                                     */

/* BITMODE @Bits 0..1 : Timer bit width */
  #define TIMER_BITMODE_BITMODE_Pos (0UL)            /*!< Position of BITMODE field.                                           */
  #define TIMER_BITMODE_BITMODE_Msk (0x3UL << TIMER_BITMODE_BITMODE_Pos) /*!< Bit mask of BITMODE field.                       */
  #define TIMER_BITMODE_BITMODE_Min (0x0UL)          /*!< Min enumerator value of BITMODE field.                               */
  #define TIMER_BITMODE_BITMODE_Max (0x3UL)          /*!< Max enumerator value of BITMODE field.                               */
  #define TIMER_BITMODE_BITMODE_16Bit (0x0UL)        /*!< 16 bit timer bit width                                               */
  #define TIMER_BITMODE_BITMODE_08Bit (0x1UL)        /*!< 8 bit timer bit width                                                */
  #define TIMER_BITMODE_BITMODE_24Bit (0x2UL)        /*!< 24 bit timer bit width                                               */
  #define TIMER_BITMODE_BITMODE_32Bit (0x3UL)        /*!< 32 bit timer bit width                                               */


/* TIMER_PRESCALER: Timer prescaler register */
  #define TIMER_PRESCALER_ResetValue (0x00000004UL)  /*!< Reset value of PRESCALER register.                                   */

