NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* TWIS_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos) /*!< Bit mask of EN field.        */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                               */


/* TWIS_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define TWIS_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)   /*!< Max size of MATCH[4] array.                                          */
  #define TWIS_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)   /*!< Max index of MATCH[4] array.                                         */
  #define TWIS_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)   /*!< Min index of MATCH[4] array.                                         */
  #define TWIS_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL) /*!< Reset value of MATCH[4] register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_MATCH_EN_Pos) /*!< Bit mask of EN field.              */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */



/* =============================================== Struct TWIS_PUBLISH_DMA_TX ================================================ */
/**
  * @brief TX [TWIS_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Publish configuration for event END                   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Publish configuration for event READY                 */
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) Publish configuration for event BUSERROR              */
} NRF_TWIS_PUBLISH_DMA_TX_Type;                      /*!< Size = 12 (0x00C)                                                    */

/* TWIS_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define TWIS_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                  */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_END_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TWIS_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define TWIS_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_READY_EN_Pos) /*!< Bit mask of EN field.              */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* TWIS_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos) /*!< Bit mask of EN field.        */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                             */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                               */



/* ================================================= Struct TWIS_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [TWIS_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_TWIS_PUBLISH_DMA_RX_Type RX;             /*!< (@ 0x00000000) Publish configuration for events                      */
  __IOM NRF_TWIS_PUBLISH_DMA_TX_Type TX;             /*!< (@ 0x0000001C) Publish configuration for events                      */
} NRF_TWIS_PUBLISH_DMA_Type;                         /*!< Size = 40 (0x028)                                                    */


/* ==================================================== Struct TWIS_PSEL ===================================================== */
/**
  * @brief PSEL [TWIS_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                               /*!< (@ 0x00000000) Pin select for SCL signal                             */
  __IOM uint32_t  SDA;                               /*!< (@ 0x00000004) Pin select for SDA signal                             */
} NRF_TWIS_PSEL_Type;                                /*!< Size = 8 (0x008)                                                     */

/* TWIS_PSEL_SCL: Pin select for SCL signal */
  #define TWIS_PSEL_SCL_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SCL register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SCL_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define TWIS_PSEL_SCL_PIN_Msk (0x1FUL << TWIS_PSEL_SCL_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define TWIS_PSEL_SCL_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define TWIS_PSEL_SCL_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TWIS_PSEL_SCL_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define TWIS_PSEL_SCL_PORT_Msk (0x7UL << TWIS_PSEL_SCL_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define TWIS_PSEL_SCL_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define TWIS_PSEL_SCL_PORT_Max (0x7UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SCL_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define TWIS_PSEL_SCL_CONNECT_Msk (0x1UL << TWIS_PSEL_SCL_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define TWIS_PSEL_SCL_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SCL_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SCL_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define TWIS_PSEL_SCL_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* TWIS_PSEL_SDA: Pin select for SDA signal */
  #define TWIS_PSEL_SDA_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SDA register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SDA_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define TWIS_PSEL_SDA_PIN_Msk (0x1FUL << TWIS_PSEL_SDA_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define TWIS_PSEL_SDA_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define TWIS_PSEL_SDA_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TWIS_PSEL_SDA_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define TWIS_PSEL_SDA_PORT_Msk (0x7UL << TWIS_PSEL_SDA_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define TWIS_PSEL_SDA_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define TWIS_PSEL_SDA_PORT_Max (0x7UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SDA_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define TWIS_PSEL_SDA_CONNECT_Msk (0x1UL << TWIS_PSEL_SDA_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define TWIS_PSEL_SDA_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SDA_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define TWIS_PSEL_SDA_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define TWIS_PSEL_SDA_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ================================================ Struct TWIS_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [TWIS_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Configure individual match events                     */
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_TWIS_DMA_RX_MATCH_Type;                        /*!< Size = 20 (0x014)                                                    */

/* TWIS_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define TWIS_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                              */

