NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
  #define UICR_USER_ROT_AUTHOPKEY_MaxCount (4UL)     /*!< Size of AUTHOPKEY[4] array.                                          */
  #define UICR_USER_ROT_AUTHOPKEY_MaxIndex (3UL)     /*!< Max index of AUTHOPKEY[4] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_MinIndex (0UL)     /*!< Min index of AUTHOPKEY[4] array.                                     */

/* UICR_USER_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].
                                    */

  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                     */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* UICR_USER_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxIndex (2UL) /*!< Max index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                     */

/* STATUS @Bits 0..31 : Revocation status. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                       */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                */



/* ================================================== Struct UICR_USER_ROT =================================================== */
/**
  * @brief ROT [UICR_USER_ROT] Assets installed to establish initial Root of Trust in the device.
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_PUBKEY_Type PUBKEY[4];     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_USER_ROT_AUTHOPKEY_Type AUTHOPKEY[4]; /*!< (@ 0x000000B0) (unspecified)                                       */
} NRF_UICR_USER_ROT_Type;                            /*!< Size = 352 (0x160)                                                   */


/* ==================================================== Struct UICR_USER ===================================================== */
/**
  * @brief USER [UICR_USER] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_Type ROT;                  /*!< (@ 0x00000000) Assets installed to establish initial Root of Trust in
                                                                         the device.*/
} NRF_UICR_USER_Type;                                /*!< Size = 352 (0x160)                                                   */


/* =================================================== Struct UICR_SUPPLY ==================================================== */
/**
  * @brief SUPPLY [UICR_SUPPLY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG1V8;                         /*!< (@ 0x00000000) configuration of VDD_AO_1V8 supply                    */
} NRF_UICR_SUPPLY_Type;                              /*!< Size = 4 (0x004)                                                     */

/* UICR_SUPPLY_CONFIG1V8: configuration of VDD_AO_1V8 supply */
  #define UICR_SUPPLY_CONFIG1V8_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG1V8 register.                              */

/* CONFIG @Bits 0..1 : Configuration */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Pos (0UL)     /*!< Position of CONFIG field.                                            */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Msk (0x3UL << UICR_SUPPLY_CONFIG1V8_CONFIG_Pos) /*!< Bit mask of CONFIG field.          */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Min (0x0UL)   /*!< Min enumerator value of CONFIG field.                                */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Max (0x2UL)   /*!< Max enumerator value of CONFIG field.                                */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_NORMAL (0x0UL) /*!< Autonomous control                                                  */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_EXTERNAL (0x1UL) /*!< 1V8 is supplied externally, disable LDO_VBAT_1V8 regulator        */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_HIGHLOAD (0x2UL) /*!< Up to 10mA consumed from the 1V8 supply for other devices / IO.
                                                             Keep LDO_VBAT_1V8 in high power mode at all times (including system
                                                             OFF).*/


/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User Information Configuration Registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_APPROTECT_Type APPROTECT[1];      /*!< (@ 0x00000000) Access Port Protection Registers                      */
    __IOM NRF_UICR_SECUREAPPROTECT_Type SECUREAPPROTECT; /*!< (@ 0x00000020) Access Port Protection Registers                  */
    __IOM NRF_UICR_AUXAPPROTECT_Type AUXAPPROTECT;   /*!< (@ 0x00000040) Access Port Protection Registers                      */
    __IOM NRF_UICR_ERASEPROTECT_Type ERASEPROTECT[1]; /*!< (@ 0x00000060) Erase Protection Registers                           */
    __IOM uint32_t BOOTCONF;                         /*!< (@ 0x00000080) Immutable boot region configuration.                  */
    __IM uint32_t RESERVED[95];
    __IOM NRF_UICR_USER_Type USER;                   /*!< (@ 0x00000200) (unspecified)                                         */
    __IM uint32_t RESERVED1[40];
    __IOM NRF_UICR_SUPPLY_Type SUPPLY;               /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t OTP[320];                         /*!< (@ 0x00000500) One time programmable memory                          */
  } NRF_UICR_Type;                                   /*!< Size = 2560 (0xA00)                                                  */

