NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* CHGDET @Bit 1 : (unspecified) */
  #define USBHS_PHY_BATTCHRGSTATUS_CHGDET_Pos (1UL)  /*!< Position of CHGDET field.                                            */
  #define USBHS_PHY_BATTCHRGSTATUS_CHGDET_Msk (0x1UL << USBHS_PHY_BATTCHRGSTATUS_CHGDET_Pos) /*!< Bit mask of CHGDET field.    */

/* FSVPLUS @Bit 2 : (unspecified) */
  #define USBHS_PHY_BATTCHRGSTATUS_FSVPLUS_Pos (2UL) /*!< Position of FSVPLUS field.                                           */
  #define USBHS_PHY_BATTCHRGSTATUS_FSVPLUS_Msk (0x1UL << USBHS_PHY_BATTCHRGSTATUS_FSVPLUS_Pos) /*!< Bit mask of FSVPLUS field. */

/* FSVMINUS @Bit 3 : (unspecified) */
  #define USBHS_PHY_BATTCHRGSTATUS_FSVMINUS_Pos (3UL) /*!< Position of FSVMINUS field.                                         */
  #define USBHS_PHY_BATTCHRGSTATUS_FSVMINUS_Msk (0x1UL << USBHS_PHY_BATTCHRGSTATUS_FSVMINUS_Pos) /*!< Bit mask of FSVMINUS
                                                                            field.*/


/* USBHS_PHY_INPUTOVERRIDE: Enables overriding of individual signals to the PHY, the override values are set in
                             PHY.OVERRIDEVALUES */

  #define USBHS_PHY_INPUTOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of INPUTOVERRIDE register.                        */

/* OPMODE0 @Bits 18..19 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_OPMODE0_Pos (18UL) /*!< Position of OPMODE0 field.                                           */
  #define USBHS_PHY_INPUTOVERRIDE_OPMODE0_Msk (0x3UL << USBHS_PHY_INPUTOVERRIDE_OPMODE0_Pos) /*!< Bit mask of OPMODE0 field.   */

/* XCVRSEL0 @Bits 20..21 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_XCVRSEL0_Pos (20UL) /*!< Position of XCVRSEL0 field.                                         */
  #define USBHS_PHY_INPUTOVERRIDE_XCVRSEL0_Msk (0x3UL << USBHS_PHY_INPUTOVERRIDE_XCVRSEL0_Pos) /*!< Bit mask of XCVRSEL0 field.*/

/* DPPULLDOWN @Bit 23 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_DPPULLDOWN_Pos (23UL) /*!< Position of DPPULLDOWN field.                                     */
  #define USBHS_PHY_INPUTOVERRIDE_DPPULLDOWN_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_DPPULLDOWN_Pos) /*!< Bit mask of DPPULLDOWN
                                                                            field.*/

/* DMPULLDOWN @Bit 24 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Pos (24UL) /*!< Position of DMPULLDOWN field.                                     */
  #define USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_DMPULLDOWN_Pos) /*!< Bit mask of DMPULLDOWN
                                                                            field.*/

/* SUSPENDM0 @Bit 25 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_SUSPENDM0_Pos (25UL) /*!< Position of SUSPENDM0 field.                                       */
  #define USBHS_PHY_INPUTOVERRIDE_SUSPENDM0_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_SUSPENDM0_Pos) /*!< Bit mask of SUSPENDM0
                                                                            field.*/

/* VBUSVALID @Bit 30 : (unspecified) */
  #define USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Pos (30UL) /*!< Position of VBUSVALID field.                                       */
  #define USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_VBUSVALID_Pos) /*!< Bit mask of VBUSVALID
                                                                            field.*/

/* ID @Bit 31 : Overrides OTG ID pin signal */
  #define USBHS_PHY_INPUTOVERRIDE_ID_Pos (31UL)      /*!< Position of ID field.                                                */
  #define USBHS_PHY_INPUTOVERRIDE_ID_Msk (0x1UL << USBHS_PHY_INPUTOVERRIDE_ID_Pos) /*!< Bit mask of ID field.                  */


/* USBHS_PHY_OVERRIDEVALUES: Values that are used to override the input signals to the PHY. */
  #define USBHS_PHY_OVERRIDEVALUES_ResetValue (0x02000000UL) /*!< Reset value of OVERRIDEVALUES register.                      */

/* OPMODE0 @Bits 18..19 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_OPMODE0_Pos (18UL) /*!< Position of OPMODE0 field.                                          */
  #define USBHS_PHY_OVERRIDEVALUES_OPMODE0_Msk (0x3UL << USBHS_PHY_OVERRIDEVALUES_OPMODE0_Pos) /*!< Bit mask of OPMODE0 field. */

/* XCVRSEL0 @Bits 20..21 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Pos (20UL) /*!< Position of XCVRSEL0 field.                                        */
  #define USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Msk (0x3UL << USBHS_PHY_OVERRIDEVALUES_XCVRSEL0_Pos) /*!< Bit mask of XCVRSEL0
                                                                            field.*/

/* DPPULLDOWN @Bit 23 : This field controls the pull-down resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos (23UL) /*!< Position of DPPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos) /*!< Bit mask of DPPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D+ is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D+ is disabled                    */

/* DMPULLDOWN @Bit 24 : This field controls the pull-down resistor on D- */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos (24UL) /*!< Position of DMPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos) /*!< Bit mask of DMPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D- is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D- is disabled                    */

/* SUSPENDM0 @Bit 25 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Pos (25UL) /*!< Position of SUSPENDM0 field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_SUSPENDM0_Pos) /*!< Bit mask of SUSPENDM0
                                                                            field.*/

/* VBUSVALID @Bit 30 : Signals to the PHY that VBUS is valid, and enables the pull-up resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos (30UL) /*!< Position of VBUSVALID field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos) /*!< Bit mask of VBUSVALID
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Min (0x0UL) /*!< Min enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Max (0x1UL) /*!< Max enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Valid (0x1UL) /*!< VBUS is valid, and the pull-up resistor on D+ is enabled       */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_NotValid (0x0UL) /*!< VBUS is not valid, and the pull-up resistor on D+ is
                                                                   disabled.*/

