NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* CONNECTDET @Bit 13 : ConnectDet */
  #define USBHSCORE_GPWRDN_CONNECTDET_Pos (13UL)     /*!< Position of CONNECTDET field.                                        */
  #define USBHSCORE_GPWRDN_CONNECTDET_Msk (0x1UL << USBHSCORE_GPWRDN_CONNECTDET_Pos) /*!< Bit mask of CONNECTDET field.        */
  #define USBHSCORE_GPWRDN_CONNECTDET_Min (0x0UL)    /*!< Min enumerator value of CONNECTDET field.                            */
  #define USBHSCORE_GPWRDN_CONNECTDET_Max (0x1UL)    /*!< Max enumerator value of CONNECTDET field.                            */
  #define USBHSCORE_GPWRDN_CONNECTDET_DISABLED (0x0UL) /*!< Connect not detected                                               */
  #define USBHSCORE_GPWRDN_CONNECTDET_ENABLED (0x1UL) /*!< Connect detected                                                    */

/* CONNDETMSK @Bit 14 : ConnDetMsk */
  #define USBHSCORE_GPWRDN_CONNDETMSK_Pos (14UL)     /*!< Position of CONNDETMSK field.                                        */
  #define USBHSCORE_GPWRDN_CONNDETMSK_Msk (0x1UL << USBHSCORE_GPWRDN_CONNDETMSK_Pos) /*!< Bit mask of CONNDETMSK field.        */
  #define USBHSCORE_GPWRDN_CONNDETMSK_Min (0x0UL)    /*!< Min enumerator value of CONNDETMSK field.                            */
  #define USBHSCORE_GPWRDN_CONNDETMSK_Max (0x1UL)    /*!< Max enumerator value of CONNDETMSK field.                            */
  #define USBHSCORE_GPWRDN_CONNDETMSK_NOMASK (0x0UL) /*!< No ConnectDet Interrupt Mask                                         */
  #define USBHSCORE_GPWRDN_CONNDETMSK_MASK (0x1UL)   /*!< Mask for ConnectDet Interrupt                                        */

/* SRPDETECT @Bit 15 : SRPDetect */
  #define USBHSCORE_GPWRDN_SRPDETECT_Pos (15UL)      /*!< Position of SRPDETECT field.                                         */
  #define USBHSCORE_GPWRDN_SRPDETECT_Msk (0x1UL << USBHSCORE_GPWRDN_SRPDETECT_Pos) /*!< Bit mask of SRPDETECT field.           */
  #define USBHSCORE_GPWRDN_SRPDETECT_Min (0x0UL)     /*!< Min enumerator value of SRPDETECT field.                             */
  #define USBHSCORE_GPWRDN_SRPDETECT_Max (0x1UL)     /*!< Max enumerator value of SRPDETECT field.                             */
  #define USBHSCORE_GPWRDN_SRPDETECT_DISABLED (0x0UL) /*!< SRP not detected                                                    */
  #define USBHSCORE_GPWRDN_SRPDETECT_ENABLED (0x1UL) /*!< SRP detected                                                         */

/* SRPDETECTMSK @Bit 16 : SRPDetectMsk */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Pos (16UL)   /*!< Position of SRPDETECTMSK field.                                      */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_SRPDETECTMSK_Pos) /*!< Bit mask of SRPDETECTMSK field.  */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Min (0x0UL)  /*!< Min enumerator value of SRPDETECTMSK field.                          */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Max (0x1UL)  /*!< Max enumerator value of SRPDETECTMSK field.                          */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_NOMASK (0x0UL) /*!< No SRPDetect Interrupt Mask                                        */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_MASK (0x1UL) /*!< Mask for SRPDetect Interrupt                                         */

/* STSCHNGINT @Bit 17 : Status Change Interrupt (StsChngInt) */
  #define USBHSCORE_GPWRDN_STSCHNGINT_Pos (17UL)     /*!< Position of STSCHNGINT field.                                        */
  #define USBHSCORE_GPWRDN_STSCHNGINT_Msk (0x1UL << USBHSCORE_GPWRDN_STSCHNGINT_Pos) /*!< Bit mask of STSCHNGINT field.        */
  #define USBHSCORE_GPWRDN_STSCHNGINT_Min (0x0UL)    /*!< Min enumerator value of STSCHNGINT field.                            */
  #define USBHSCORE_GPWRDN_STSCHNGINT_Max (0x1UL)    /*!< Max enumerator value of STSCHNGINT field.                            */
  #define USBHSCORE_GPWRDN_STSCHNGINT_DISABLED (0x0UL) /*!< No Status change                                                   */
  #define USBHSCORE_GPWRDN_STSCHNGINT_ENABLED (0x1UL) /*!< Status change detected                                              */

/* STSCHNGINTMSK @Bit 18 : StsChngIntMsk */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Pos (18UL)  /*!< Position of STSCHNGINTMSK field.                                     */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_STSCHNGINTMSK_Pos) /*!< Bit mask of STSCHNGINTMSK
                                                                            field.*/
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Min (0x0UL) /*!< Min enumerator value of STSCHNGINTMSK field.                         */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Max (0x1UL) /*!< Max enumerator value of STSCHNGINTMSK field.                         */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_MASK (0x0UL) /*!< Mask for Status Change Interrupt                                    */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_NOMASK (0x1UL) /*!< No Status Change Interrupt Mask                                   */

/* LINESTATE @Bits 19..20 : LineState */
  #define USBHSCORE_GPWRDN_LINESTATE_Pos (19UL)      /*!< Position of LINESTATE field.                                         */
  #define USBHSCORE_GPWRDN_LINESTATE_Msk (0x3UL << USBHSCORE_GPWRDN_LINESTATE_Pos) /*!< Bit mask of LINESTATE field.           */
  #define USBHSCORE_GPWRDN_LINESTATE_Min (0x0UL)     /*!< Min enumerator value of LINESTATE field.                             */
  #define USBHSCORE_GPWRDN_LINESTATE_Max (0x3UL)     /*!< Max enumerator value of LINESTATE field.                             */
  #define USBHSCORE_GPWRDN_LINESTATE_LS1 (0x0UL)     /*!< Linestate on USB: DM = 0, DP = 0                                     */
  #define USBHSCORE_GPWRDN_LINESTATE_LS2 (0x1UL)     /*!< Linestate on USB: DM = 0, DP = 1                                     */
  #define USBHSCORE_GPWRDN_LINESTATE_LS3 (0x2UL)     /*!< Linestate on USB: DM = 1, DP = 0                                     */
  #define USBHSCORE_GPWRDN_LINESTATE_LS4 (0x3UL)     /*!< Linestate on USB: Not-defined                                        */

/* IDDIG @Bit 21 : This bit indicates the status of the signal IDDIG. The application must read this bit after receiving
                   GPWRDN.StsChngInt and decode based on the previous value stored by the application. */

  #define USBHSCORE_GPWRDN_IDDIG_Pos (21UL)          /*!< Position of IDDIG field.                                             */
  #define USBHSCORE_GPWRDN_IDDIG_Msk (0x1UL << USBHSCORE_GPWRDN_IDDIG_Pos) /*!< Bit mask of IDDIG field.                       */
  #define USBHSCORE_GPWRDN_IDDIG_Min (0x0UL)         /*!< Min enumerator value of IDDIG field.                                 */
  #define USBHSCORE_GPWRDN_IDDIG_Max (0x1UL)         /*!< Max enumerator value of IDDIG field.                                 */
  #define USBHSCORE_GPWRDN_IDDIG_DISABLED (0x0UL)    /*!< Host Mode                                                            */
  #define USBHSCORE_GPWRDN_IDDIG_ENABLED (0x1UL)     /*!< Device Mode                                                          */

