NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* FSLSSUPP @Bit 2 : FS- and LS-Only Support (FSLSSupp) */
  #define USBHSCORE_HCFG_FSLSSUPP_Pos (2UL)          /*!< Position of FSLSSUPP field.                                          */
  #define USBHSCORE_HCFG_FSLSSUPP_Msk (0x1UL << USBHSCORE_HCFG_FSLSSUPP_Pos) /*!< Bit mask of FSLSSUPP field.                  */
  #define USBHSCORE_HCFG_FSLSSUPP_Min (0x0UL)        /*!< Min enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_Max (0x1UL)        /*!< Max enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_HSFSLS (0x0UL)     /*!< HS/FS/LS, based on the maximum speed supported by the connected
                                                          device*/
  #define USBHSCORE_HCFG_FSLSSUPP_FSLS (0x1UL)       /*!< FS/LS-only, even if the connected device can support HS              */

/* ENA32KHZS @Bit 7 : Enable 32 KHz Suspend mode (Ena32KHzS) */
  #define USBHSCORE_HCFG_ENA32KHZS_Pos (7UL)         /*!< Position of ENA32KHZS field.                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_Msk (0x1UL << USBHSCORE_HCFG_ENA32KHZS_Pos) /*!< Bit mask of ENA32KHZS field.               */
  #define USBHSCORE_HCFG_ENA32KHZS_Min (0x0UL)       /*!< Min enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_Max (0x1UL)       /*!< Max enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_DISABLED (0x0UL)  /*!< 32 KHz Suspend mode disabled                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_ENABLED (0x1UL)   /*!< 32 KHz Suspend mode enabled                                          */

/* RESVALID @Bits 8..15 : Resume Validation Period (ResValid) */
  #define USBHSCORE_HCFG_RESVALID_Pos (8UL)          /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_HCFG_RESVALID_Msk (0xFFUL << USBHSCORE_HCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */

/* DISTXIPGAPDLYCHECK @Bit 16 : Disable Linestate check for Token to Token/Data interpacket gap delay calculation
                                (dis_tx_ipgap_dly_check) */

  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_Pos (16UL) /*!< Position of DISTXIPGAPDLYCHECK field.                              */
  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_Msk (0x1UL << USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_Pos) /*!< Bit mask of
                                                                            DISTXIPGAPDLYCHECK field.*/
  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_Min (0x0UL) /*!< Min enumerator value of DISTXIPGAPDLYCHECK field.                 */
  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_Max (0x1UL) /*!< Max enumerator value of DISTXIPGAPDLYCHECK field.                 */
  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_DISABLE (0x0UL) /*!< Enable Linestate check                                        */
  #define USBHSCORE_HCFG_DISTXIPGAPDLYCHECK_ENABLE (0x1UL) /*!< Disable Linestate check                                        */

/* DESCDMA @Bit 23 : Enable Scatter/gather DMA in Host mode (DescDMA) */
  #define USBHSCORE_HCFG_DESCDMA_Pos (23UL)          /*!< Position of DESCDMA field.                                           */
  #define USBHSCORE_HCFG_DESCDMA_Msk (0x1UL << USBHSCORE_HCFG_DESCDMA_Pos) /*!< Bit mask of DESCDMA field.                     */
  #define USBHSCORE_HCFG_DESCDMA_Min (0x0UL)         /*!< Min enumerator value of DESCDMA field.                               */
  #define USBHSCORE_HCFG_DESCDMA_Max (0x1UL)         /*!< Max enumerator value of DESCDMA field.                               */
  #define USBHSCORE_HCFG_DESCDMA_DISABLED (0x0UL)    /*!< Scatter/Gather DMA in Host mode is disabled                          */
  #define USBHSCORE_HCFG_DESCDMA_ENABLED (0x1UL)     /*!< Scatter/Gather DMA selected                                          */

/* FRLISTEN @Bits 24..25 : Frame List Entries(FrListEn) */
  #define USBHSCORE_HCFG_FRLISTEN_Pos (24UL)         /*!< Position of FRLISTEN field.                                          */
  #define USBHSCORE_HCFG_FRLISTEN_Msk (0x3UL << USBHSCORE_HCFG_FRLISTEN_Pos) /*!< Bit mask of FRLISTEN field.                  */
  #define USBHSCORE_HCFG_FRLISTEN_Min (0x0UL)        /*!< Min enumerator value of FRLISTEN field.                              */
  #define USBHSCORE_HCFG_FRLISTEN_Max (0x3UL)        /*!< Max enumerator value of FRLISTEN field.                              */
  #define USBHSCORE_HCFG_FRLISTEN_ENTRY8 (0x0UL)     /*!< 8 Entries                                                            */
  #define USBHSCORE_HCFG_FRLISTEN_ENTRY16 (0x1UL)    /*!< 16 Entries                                                           */
  #define USBHSCORE_HCFG_FRLISTEN_ENTRY32 (0x2UL)    /*!< 32 Entries                                                           */
  #define USBHSCORE_HCFG_FRLISTEN_ENTRY63 (0x3UL)    /*!< 64 Entries                                                           */

/* PERSCHEDENA @Bit 26 : Enable Periodic Scheduling (PerSchedEna): */
  #define USBHSCORE_HCFG_PERSCHEDENA_Pos (26UL)      /*!< Position of PERSCHEDENA field.                                       */
  #define USBHSCORE_HCFG_PERSCHEDENA_Msk (0x1UL << USBHSCORE_HCFG_PERSCHEDENA_Pos) /*!< Bit mask of PERSCHEDENA field.         */
  #define USBHSCORE_HCFG_PERSCHEDENA_Min (0x0UL)     /*!< Min enumerator value of PERSCHEDENA field.                           */
  #define USBHSCORE_HCFG_PERSCHEDENA_Max (0x1UL)     /*!< Max enumerator value of PERSCHEDENA field.                           */
  #define USBHSCORE_HCFG_PERSCHEDENA_DISABLED (0x0UL) /*!< Disables periodic scheduling within the core                        */
  #define USBHSCORE_HCFG_PERSCHEDENA_ENABLED (0x1UL) /*!< Enables periodic scheduling within the core                          */

/* MODECHTIMEN @Bit 31 : Mode Change Ready Timer Enable (ModeChTimEn) */
  #define USBHSCORE_HCFG_MODECHTIMEN_Pos (31UL)      /*!< Position of MODECHTIMEN field.                                       */
  #define USBHSCORE_HCFG_MODECHTIMEN_Msk (0x1UL << USBHSCORE_HCFG_MODECHTIMEN_Pos) /*!< Bit mask of MODECHTIMEN field.         */
  #define USBHSCORE_HCFG_MODECHTIMEN_Min (0x0UL)     /*!< Min enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_Max (0x1UL)     /*!< Max enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_ENABLED (0x0UL) /*!< The Host core waits for either 200 PHY clock cycles or a linestate of
                                                          SE0 at the end of resume to change the opmode from 0x2 to 0x0*/
  #define USBHSCORE_HCFG_MODECHTIMEN_DISABLED (0x1UL) /*!< The Host core waits only for a linestate of SE0 at the end of resume
                                                           to change the opmode from 0x2 to 0x0*/


/* USBHSCORE_HFIR: Host Frame Interval Register */
  #define USBHSCORE_HFIR_ResetValue (0x0000EA60UL)   /*!< Reset value of HFIR register.                                        */

