NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* USBHSCORE_DTXFSTS8: Device IN Endpoint Transmit FIFO Status Register 8 */
  #define USBHSCORE_DTXFSTS8_ResetValue (0x00000C00UL) /*!< Reset value of DTXFSTS8 register.                                  */

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Pos (0UL) /*!< Position of INEPTXFSPCAVAIL field.                                 */
  #define USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS8_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DIEPDMAB8: Device IN Endpoint Buffer Address Register 8 */
  #define USBHSCORE_DIEPDMAB8_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMAB8 register.                                */

/* DMABUFFERADDR @Bits 0..31 : Holds the current buffer address.This register is updated as and when the data */
  #define USBHSCORE_DIEPDMAB8_DMABUFFERADDR_Pos (0UL) /*!< Position of DMABUFFERADDR field.                                    */
  #define USBHSCORE_DIEPDMAB8_DMABUFFERADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMAB8_DMABUFFERADDR_Pos) /*!< Bit mask of
                                                                            DMABUFFERADDR field.*/


/* USBHSCORE_DIEPCTL9: Device Control IN Endpoint Control Register 9 */
  #define USBHSCORE_DIEPCTL9_ResetValue (0x00000000UL) /*!< Reset value of DIEPCTL9 register.                                  */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL9_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DIEPCTL9_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL9_MPS_Pos) /*!< Bit mask of MPS field.                       */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL9_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Min (0x0UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL9_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL9_USBACTEP_DISABLED (0x0UL) /*!< Not Active                                                         */
  #define USBHSCORE_DIEPCTL9_USBACTEP_ENABLED (0x1UL) /*!< USB Active Endpoint                                                 */

/* DPID @Bit 16 : (unspecified) */
  #define USBHSCORE_DIEPCTL9_DPID_Pos (16UL)         /*!< Position of DPID field.                                              */
  #define USBHSCORE_DIEPCTL9_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL9_DPID_Pos) /*!< Bit mask of DPID field.                      */
  #define USBHSCORE_DIEPCTL9_DPID_Min (0x0UL)        /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL9_DPID_Max (0x1UL)        /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL9_DPID_DATA0EVENFRM (0x0UL) /*!< DATA0 or Even Frame                                                */
  #define USBHSCORE_DIEPCTL9_DPID_DATA1ODDFRM (0x1UL) /*!< DATA1 or Odd Frame                                                  */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL9_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL9_NAKSTS_NONNAK (0x0UL)   /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DIEPCTL9_NAKSTS_NAK (0x1UL)      /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL9_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_Max (0x3UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL9_EPTYPE_CONTROL (0x0UL)  /*!< Control                                                              */
  #define USBHSCORE_DIEPCTL9_EPTYPE_ISOCHRONOUS (0x1UL) /*!< Isochronous                                                       */
  #define USBHSCORE_DIEPCTL9_EPTYPE_BULK (0x2UL)     /*!< Bulk                                                                 */
  #define USBHSCORE_DIEPCTL9_EPTYPE_INTERRUP (0x3UL) /*!< Interrupt                                                            */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL9_STALL_Pos (21UL)        /*!< Position of STALL field.                                             */
  #define USBHSCORE_DIEPCTL9_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL9_STALL_Pos) /*!< Bit mask of STALL field.                   */
  #define USBHSCORE_DIEPCTL9_STALL_Min (0x0UL)       /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL9_STALL_Max (0x1UL)       /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL9_STALL_INACTIVE (0x0UL)  /*!< STALL All non-active tokens                                          */
  #define USBHSCORE_DIEPCTL9_STALL_ACTIVE (0x1UL)    /*!< STALL All Active Tokens                                              */

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL9_TXFNUM_Pos (22UL)       /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL9_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.                */
  #define USBHSCORE_DIEPCTL9_TXFNUM_Min (0x0UL)      /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL9_TXFNUM_Max (0xFUL)      /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO0 (0x0UL)  /*!< Tx FIFO 0                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO1 (0x1UL)  /*!< Tx FIFO 1                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO2 (0x2UL)  /*!< Tx FIFO 2                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO3 (0x3UL)  /*!< Tx FIFO 3                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO4 (0x4UL)  /*!< Tx FIFO 4                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO5 (0x5UL)  /*!< Tx FIFO 5                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO6 (0x6UL)  /*!< Tx FIFO 6                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO7 (0x7UL)  /*!< Tx FIFO 7                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO8 (0x8UL)  /*!< Tx FIFO 8                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO9 (0x9UL)  /*!< Tx FIFO 9                                                            */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO10 (0xAUL) /*!< Tx FIFO 10                                                           */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO11 (0xBUL) /*!< Tx FIFO 11                                                           */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO12 (0xCUL) /*!< Tx FIFO 12                                                           */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO13 (0xDUL) /*!< Tx FIFO 13                                                           */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO14 (0xEUL) /*!< Tx FIFO 14                                                           */
  #define USBHSCORE_DIEPCTL9_TXFNUM_TXFIFO15 (0xFUL) /*!< Tx FIFO 15                                                           */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DIEPCTL9_CNAK_Pos (26UL)         /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DIEPCTL9_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL9_CNAK_Pos) /*!< Bit mask of CNAK field.                      */
  #define USBHSCORE_DIEPCTL9_CNAK_Min (0x0UL)        /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL9_CNAK_Max (0x1UL)        /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL9_CNAK_INACTIVE (0x0UL)   /*!< No Clear NAK                                                         */
  #define USBHSCORE_DIEPCTL9_CNAK_ACTIVE (0x1UL)     /*!< Clear NAK                                                            */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DIEPCTL9_SNAK_Pos (27UL)         /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DIEPCTL9_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL9_SNAK_Pos) /*!< Bit mask of SNAK field.                      */
  #define USBHSCORE_DIEPCTL9_SNAK_Min (0x0UL)        /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL9_SNAK_Max (0x1UL)        /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL9_SNAK_INACTIVE (0x0UL)   /*!< No Set NAK                                                           */
  #define USBHSCORE_DIEPCTL9_SNAK_ACTIVE (0x1UL)     /*!< Set NAK                                                              */

