NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Pos (10UL) /*!< Position of LSIPGCHKAFTERNAKSTALLFORINDIS field.  */
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Pos)
                                                                            /*!< Bit mask of LSIPGCHKAFTERNAKSTALLFORINDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            LSIPGCHKAFTERNAKSTALLFORINDIS field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            LSIPGCHKAFTERNAKSTALLFORINDIS field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_ENABLE_FIX (0x0UL) /*!< Host controller checks IPG after NAK/STALL
                                                                            for IN token*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_DISABLE_FIX (0x1UL) /*!< Host controller does not check IPG after
                                                                            NAK/STALL for IN token*/

/* PHYIOPXCVRSELTXVLDCORRDIS @Bit 11 : Disable the STAR fix added for Host controller to increase the gap between
                                       utmi_xcvrselect switching and utmi_txvalid assertion in LS/FS mode */

  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_Pos (11UL) /*!< Position of PHYIOPXCVRSELTXVLDCORRDIS field.          */
  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_Pos) /*!<
                                                                            Bit mask of PHYIOPXCVRSELTXVLDCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_Min (0x0UL) /*!< Min enumerator value of PHYIOPXCVRSELTXVLDCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_Max (0x1UL) /*!< Max enumerator value of PHYIOPXCVRSELTXVLDCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_ENABLE_FIX (0x0UL) /*!< Host controller asserts utmi_txvalid at least 2
                                                                            utmi_clk cycles after utmi_xcvrselect switching*/
  #define USBHSCORE_GSTARFXDIS_PHYIOPXCVRSELTXVLDCORRDIS_DISABLE_FIX (0x1UL) /*!< Host controller can assert utmi_txvalid after
                                                                            1 utmi_clk cycle of utmi_xcvrselect switching*/

/* ULPIXCVRSELSWITCHCORRDIS @Bit 12 : Disable the STAR fix added for Host controller to increase the preamble transceiver select
                                      switch delay to accommodate time taken for ULPI function control write */

  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_Pos (12UL) /*!< Position of ULPIXCVRSELSWITCHCORRDIS field.            */
  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_Pos) /*!<
                                                                            Bit mask of ULPIXCVRSELSWITCHCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_Min (0x0UL) /*!< Min enumerator value of ULPIXCVRSELSWITCHCORRDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_Max (0x1UL) /*!< Max enumerator value of ULPIXCVRSELSWITCHCORRDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_ENABLE_FIX (0x0UL) /*!< Host controller waits for previous functional
                                                                            register update to complete before switching the
                                                                            transceiver select again or asserting txvalid*/
  #define USBHSCORE_GSTARFXDIS_ULPIXCVRSELSWITCHCORRDIS_DISABLE_FIX (0x1UL) /*!< Host controller does not wait for the previous
                                                                            functional register update to complete before
                                                                            switching the transceiver select again or asserting
                                                                            txvalid*/

/* XACTERRDATA0CTRLSTSINDIS @Bit 13 : Disable the STAR fix added for Host controller to report transaction error when DATA0 PID
                                      is received for CTRL STATUS IN transfer in DMA mode */

  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_Pos (13UL) /*!< Position of XACTERRDATA0CTRLSTSINDIS field.            */
  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_Pos) /*!<
                                                                            Bit mask of XACTERRDATA0CTRLSTSINDIS field.*/
  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_Min (0x0UL) /*!< Min enumerator value of XACTERRDATA0CTRLSTSINDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_Max (0x1UL) /*!< Max enumerator value of XACTERRDATA0CTRLSTSINDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_ENABLE_FIX (0x0UL) /*!< Host controller reports transaction error when
                                                                            DATA0 PID is received for CTRL STATUS IN transfer in
                                                                            DMA mode*/
  #define USBHSCORE_GSTARFXDIS_XACTERRDATA0CTRLSTSINDIS_DISABLE_FIX (0x1UL) /*!< Host controller retries the transfer when DATA0
                                                                            PID is received for CTRL STATUS IN transfer in DMA
                                                                            mode*/

/* HOSTUTMITXVLDCORRDIS @Bit 16 : Disable the correction to OpMode/XcvrSel/TermSel on UTMI Interface in Host mode. */
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_Pos (16UL) /*!< Position of HOSTUTMITXVLDCORRDIS field.                    */
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_Pos) /*!< Bit mask
                                                                            of HOSTUTMITXVLDCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_Min (0x0UL) /*!< Min enumerator value of HOSTUTMITXVLDCORRDIS field.       */
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_Max (0x1UL) /*!< Max enumerator value of HOSTUTMITXVLDCORRDIS field.       */
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_ENABLE_FIX (0x0UL) /*!< Opmode, XcvrSel, TermSel are changed by the Host
                                                                            Controller after TxValid goes LOW (1'b0)*/
  #define USBHSCORE_GSTARFXDIS_HOSTUTMITXVLDCORRDIS_DISABLE_FIX (0x1UL) /*!< Opmode, XcvrSel, TermSel are changed by the Host
                                                                            Controller without waiting for TxValid to go LOW
                                                                            (1'b0) during SOF transmission*/

