NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* AUTHBUSY @Bit 6 : Authentication busy status. */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Pos (6UL)    /*!< Position of AUTHBUSY field.                                          */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Pos) /*!< Bit mask of AUTHBUSY field.      */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Min (0x0UL)  /*!< Min enumerator value of AUTHBUSY field.                              */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Max (0x1UL)  /*!< Max enumerator value of AUTHBUSY field.                              */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_No (0x0UL)   /*!< The authentication module is ready.                                  */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Yes (0x1UL)  /*!< The authentication module is busy.                                   */

/* AUTHENTICATED @Bit 7 : Authentication status. */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Pos (7UL) /*!< Position of AUTHENTICATED field.                                   */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Pos) /*!< Bit mask of
                                                                            AUTHENTICATED field.*/
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Min (0x0UL) /*!< Min enumerator value of AUTHENTICATED field.                     */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Max (0x1UL) /*!< Max enumerator value of AUTHENTICATED field.                     */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_No (0x0UL) /*!< Authentication required before using the debug module.            */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Yes (0x1UL) /*!< Authentication passed.                                           */

/* ANYHALTED @Bit 8 : Any currently selected harts halted status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Pos (8UL)   /*!< Position of ANYHALTED field.                                         */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYHALTED_Pos) /*!< Bit mask of ANYHALTED field.   */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Min (0x0UL) /*!< Min enumerator value of ANYHALTED field.                             */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Max (0x1UL) /*!< Max enumerator value of ANYHALTED field.                             */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_No (0x0UL)  /*!< None of the currently selected harts halted.                         */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Yes (0x1UL) /*!< Any of the currently selected harts halted.                          */

/* ALLHALTED @Bit 9 : All currently selected harts halted status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Pos (9UL)   /*!< Position of ALLHALTED field.                                         */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLHALTED_Pos) /*!< Bit mask of ALLHALTED field.   */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Min (0x0UL) /*!< Min enumerator value of ALLHALTED field.                             */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Max (0x1UL) /*!< Max enumerator value of ALLHALTED field.                             */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_No (0x0UL)  /*!< Not all of the currently selected harts halted.                      */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Yes (0x1UL) /*!< All of the currently selected harts halted.                          */

/* ANYRUNNING @Bit 10 : Any currently selected harts running status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Pos (10UL) /*!< Position of ANYRUNNING field.                                        */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Pos) /*!< Bit mask of ANYRUNNING field.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Min (0x0UL) /*!< Min enumerator value of ANYRUNNING field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Max (0x1UL) /*!< Max enumerator value of ANYRUNNING field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_No (0x0UL) /*!< None of the currently selected harts running.                        */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Yes (0x1UL) /*!< Any of the currently selected harts running.                        */

/* ALLRUNNING @Bit 11 : All currently selected harts running status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Pos (11UL) /*!< Position of ALLRUNNING field.                                        */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Pos) /*!< Bit mask of ALLRUNNING field.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Min (0x0UL) /*!< Min enumerator value of ALLRUNNING field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Max (0x1UL) /*!< Max enumerator value of ALLRUNNING field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_No (0x0UL) /*!< Not all of the currently selected harts running.                     */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Yes (0x1UL) /*!< All of the currently selected harts running.                        */

/* ANYUNAVAIL @Bit 12 : Any currently selected harts unavailable status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Pos (12UL) /*!< Position of ANYUNAVAIL field.                                        */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Pos) /*!< Bit mask of ANYUNAVAIL field.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Min (0x0UL) /*!< Min enumerator value of ANYUNAVAIL field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Max (0x1UL) /*!< Max enumerator value of ANYUNAVAIL field.                           */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_No (0x0UL) /*!< None of the currently selected harts unavailable.                    */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Yes (0x1UL) /*!< Any of the currently selected harts unavailable.                    */

