NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* BUSY @Bit 12 : Abstract command execution status. */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Pos (12UL)     /*!< Position of BUSY field.                                              */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Msk (0x1UL << VPR_DEBUGIF_ABSTRACTCS_BUSY_Pos) /*!< Bit mask of BUSY field.              */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Min (0x0UL)    /*!< Min enumerator value of BUSY field.                                  */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Max (0x1UL)    /*!< Max enumerator value of BUSY field.                                  */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_NotBusy (0x0UL) /*!< Not busy.                                                           */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Busy (0x1UL)   /*!< An abstract command is currently being executed. This bit is set as
                                                          soon as command is written, and is not cleared until that command has
                                                          completed.*/

/* PROGBUFSIZE @Bits 24..28 : Size of the Program Buffer, in 32-bit words. Valid sizes are 0 - 1. */
  #define VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Pos (24UL) /*!< Position of PROGBUFSIZE field.                                    */
  #define VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Msk (0x1FUL << VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Pos) /*!< Bit mask of PROGBUFSIZE
                                                                            field.*/


/* VPR_DEBUGIF_ABSTRACTCMD: Abstract command */
  #define VPR_DEBUGIF_ABSTRACTCMD_ResetValue (0x00000000UL) /*!< Reset value of ABSTRACTCMD register.                          */

/* CONTROL @Bits 0..23 : This Field is interpreted in a command specific manner, described for each abstract command. */
  #define VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Pos (0UL)  /*!< Position of CONTROL field.                                           */
  #define VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Msk (0xFFFFFFUL << VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Pos) /*!< Bit mask of CONTROL
                                                                            field.*/

/* CMDTYPE @Bits 24..31 : The type determines the overall functionality of this abstract command. */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Pos (24UL) /*!< Position of CMDTYPE field.                                           */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Msk (0xFFUL << VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Pos) /*!< Bit mask of CMDTYPE field.  */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Min (0x00UL) /*!< Min enumerator value of CMDTYPE field.                             */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Max (0x02UL) /*!< Max enumerator value of CMDTYPE field.                             */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_REGACCESS (0x00UL) /*!< Register Access Command                                      */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_QUICKACCESS (0x01UL) /*!< Quick Access Command                                       */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_MEMACCESS (0x02UL) /*!< Memory Access Command                                        */


/* VPR_DEBUGIF_ABSTRACTAUTO: Abstract Command Autoexec */
  #define VPR_DEBUGIF_ABSTRACTAUTO_ResetValue (0x00000000UL) /*!< Reset value of ABSTRACTAUTO register.                        */

/* AUTOEXECDATA @Bits 0..11 : When a bit in this field is 1, read or write accesses to the corresponding data word cause the
                              command in command to be executed again. */

  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Pos (0UL) /*!< Position of AUTOEXECDATA field.                                 */
  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Msk (0xFFFUL << VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Pos) /*!< Bit mask of
                                                                            AUTOEXECDATA field.*/

/* AUTOEXECPROGBUF @Bits 16..31 : When a bit in this field is 1, read or write accesses to the corresponding progbuf word cause
                                  the command in command to be executed again. */

  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Pos (16UL) /*!< Position of AUTOEXECPROGBUF field.                          */
  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Msk (0xFFFFUL << VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Pos) /*!< Bit mask
                                                                            of AUTOEXECPROGBUF field.*/


/* VPR_DEBUGIF_CONFSTRPTR: Configuration String Pointer [n] */
  #define VPR_DEBUGIF_CONFSTRPTR_MaxCount (4UL)      /*!< Max size of CONFSTRPTR[4] array.                                     */
  #define VPR_DEBUGIF_CONFSTRPTR_MaxIndex (3UL)      /*!< Max index of CONFSTRPTR[4] array.                                    */
  #define VPR_DEBUGIF_CONFSTRPTR_MinIndex (0UL)      /*!< Min index of CONFSTRPTR[4] array.                                    */
  #define VPR_DEBUGIF_CONFSTRPTR_ResetValue (0x00000000UL) /*!< Reset value of CONFSTRPTR[4] register.                         */

/* ADDR @Bits 0..31 : Address */
  #define VPR_DEBUGIF_CONFSTRPTR_ADDR_Pos (0UL)      /*!< Position of ADDR field.                                              */
  #define VPR_DEBUGIF_CONFSTRPTR_ADDR_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_CONFSTRPTR_ADDR_Pos) /*!< Bit mask of ADDR field.       */


/* VPR_DEBUGIF_NEXTDM: Next Debug Module */
  #define VPR_DEBUGIF_NEXTDM_ResetValue (0x00000000UL) /*!< Reset value of NEXTDM register.                                    */

/* ADDR @Bits 0..31 : Address */
  #define VPR_DEBUGIF_NEXTDM_ADDR_Pos (0UL)          /*!< Position of ADDR field.                                              */
  #define VPR_DEBUGIF_NEXTDM_ADDR_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_NEXTDM_ADDR_Pos) /*!< Bit mask of ADDR field.               */


/* VPR_DEBUGIF_PROGBUF: Program Buffer [n] */
  #define VPR_DEBUGIF_PROGBUF_MaxCount (16UL)        /*!< Max size of PROGBUF[16] array.                                       */
  #define VPR_DEBUGIF_PROGBUF_MaxIndex (15UL)        /*!< Max index of PROGBUF[16] array.                                      */
  #define VPR_DEBUGIF_PROGBUF_MinIndex (0UL)         /*!< Min index of PROGBUF[16] array.                                      */
  #define VPR_DEBUGIF_PROGBUF_ResetValue (0x00000000UL) /*!< Reset value of PROGBUF[16] register.                              */

/* DATA @Bits 0..31 : Data */
  #define VPR_DEBUGIF_PROGBUF_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_PROGBUF_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_PROGBUF_DATA_Pos) /*!< Bit mask of DATA field.             */


/* VPR_DEBUGIF_AUTHDATA: Authentication Data */
  #define VPR_DEBUGIF_AUTHDATA_ResetValue (0x00000000UL) /*!< Reset value of AUTHDATA register.                                */

/* DATA @Bits 0..31 : Data */
  #define VPR_DEBUGIF_AUTHDATA_DATA_Pos (0UL)        /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_AUTHDATA_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_AUTHDATA_DATA_Pos) /*!< Bit mask of DATA field.           */


