NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* DIRB9 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Pos (25UL)  /*!< Position of DIRB9 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Pos) /*!< Bit mask of DIRB9 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Min (0x0UL) /*!< Min enumerator value of DIRB9 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Max (0x1UL) /*!< Max enumerator value of DIRB9 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* DIRB10 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Pos (26UL) /*!< Position of DIRB10 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Pos) /*!< Bit mask of DIRB10 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Min (0x0UL) /*!< Min enumerator value of DIRB10 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Max (0x1UL) /*!< Max enumerator value of DIRB10 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */

/* DIRB11 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Pos (27UL) /*!< Position of DIRB11 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Pos) /*!< Bit mask of DIRB11 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Min (0x0UL) /*!< Min enumerator value of DIRB11 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Max (0x1UL) /*!< Max enumerator value of DIRB11 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */

/* DIRB12 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Pos (28UL) /*!< Position of DIRB12 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Pos) /*!< Bit mask of DIRB12 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Min (0x0UL) /*!< Min enumerator value of DIRB12 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Max (0x1UL) /*!< Max enumerator value of DIRB12 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */

/* DIRB13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Pos (29UL) /*!< Position of DIRB13 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Pos) /*!< Bit mask of DIRB13 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Min (0x0UL) /*!< Min enumerator value of DIRB13 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Max (0x1UL) /*!< Max enumerator value of DIRB13 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */

/* DIRB14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Pos (30UL) /*!< Position of DIRB14 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Pos) /*!< Bit mask of DIRB14 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Min (0x0UL) /*!< Min enumerator value of DIRB14 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Max (0x1UL) /*!< Max enumerator value of DIRB14 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */

/* DIRB15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Pos (31UL) /*!< Position of DIRB15 field.                                            */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Pos) /*!< Bit mask of DIRB15 field.    */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Min (0x0UL) /*!< Min enumerator value of DIRB15 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Max (0x1UL) /*!< Max enumerator value of DIRB15 field.                               */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                         */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_TOGGLE (0x1UL) /*!< Pin is toggled                                                   */


/**
  * @brief OUTUBTGL [VPRCSR_NORDIC_OUTUBTGL] Buffered GPIO Unshifted Output Toggle
  */
  #define VPRCSR_NORDIC_OUTUBTGL (0x00000BD6ul)
  #define VPRCSR_NORDIC_OUTUBTGL_ResetValue (0x00000000UL) /*!< Reset value of OUTUBTGL register.                              */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_Pos (0UL)      /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN0_Pos) /*!< Bit mask of PIN0 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_Min (0x0UL)    /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_Max (0x1UL)    /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN0_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_Pos (1UL)      /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN1_Pos) /*!< Bit mask of PIN1 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_Min (0x0UL)    /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_Max (0x1UL)    /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN1_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_Pos (2UL)      /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN2_Pos) /*!< Bit mask of PIN2 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_Min (0x0UL)    /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_Max (0x1UL)    /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN2_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_Pos (3UL)      /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN3_Pos) /*!< Bit mask of PIN3 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_Min (0x0UL)    /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_Max (0x1UL)    /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN3_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

