NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* RR6 @Bit 6 : Enable or disable RR[6] register */
  #define WDT_RREN_RR6_Pos (6UL)                     /*!< Position of RR6 field.                                               */
  #define WDT_RREN_RR6_Msk (0x1UL << WDT_RREN_RR6_Pos) /*!< Bit mask of RR6 field.                                             */
  #define WDT_RREN_RR6_Min (0x0UL)                   /*!< Min enumerator value of RR6 field.                                   */
  #define WDT_RREN_RR6_Max (0x1UL)                   /*!< Max enumerator value of RR6 field.                                   */
  #define WDT_RREN_RR6_Disabled (0x0UL)              /*!< Disable RR[6] register                                               */
  #define WDT_RREN_RR6_Enabled (0x1UL)               /*!< Enable RR[6] register                                                */

/* RR7 @Bit 7 : Enable or disable RR[7] register */
  #define WDT_RREN_RR7_Pos (7UL)                     /*!< Position of RR7 field.                                               */
  #define WDT_RREN_RR7_Msk (0x1UL << WDT_RREN_RR7_Pos) /*!< Bit mask of RR7 field.                                             */
  #define WDT_RREN_RR7_Min (0x0UL)                   /*!< Min enumerator value of RR7 field.                                   */
  #define WDT_RREN_RR7_Max (0x1UL)                   /*!< Max enumerator value of RR7 field.                                   */
  #define WDT_RREN_RR7_Disabled (0x0UL)              /*!< Disable RR[7] register                                               */
  #define WDT_RREN_RR7_Enabled (0x1UL)               /*!< Enable RR[7] register                                                */


/* WDT_CONFIG: Configuration register */
  #define WDT_CONFIG_ResetValue (0x00000001UL)       /*!< Reset value of CONFIG register.                                      */

/* SLEEP @Bit 0 : Configure WDT to either be paused, or kept running, while the CPU is sleeping */
  #define WDT_CONFIG_SLEEP_Pos (0UL)                 /*!< Position of SLEEP field.                                             */
  #define WDT_CONFIG_SLEEP_Msk (0x1UL << WDT_CONFIG_SLEEP_Pos) /*!< Bit mask of SLEEP field.                                   */
  #define WDT_CONFIG_SLEEP_Min (0x0UL)               /*!< Min enumerator value of SLEEP field.                                 */
  #define WDT_CONFIG_SLEEP_Max (0x1UL)               /*!< Max enumerator value of SLEEP field.                                 */
  #define WDT_CONFIG_SLEEP_Pause (0x0UL)             /*!< Pause WDT while the CPU is sleeping                                  */
  #define WDT_CONFIG_SLEEP_Run (0x1UL)               /*!< Keep WDT running while the CPU is sleeping                           */

/* HALT @Bit 3 : Configure WDT to either be paused, or kept running, while the CPU is halted by the debugger */
  #define WDT_CONFIG_HALT_Pos (3UL)                  /*!< Position of HALT field.                                              */
  #define WDT_CONFIG_HALT_Msk (0x1UL << WDT_CONFIG_HALT_Pos) /*!< Bit mask of HALT field.                                      */
  #define WDT_CONFIG_HALT_Min (0x0UL)                /*!< Min enumerator value of HALT field.                                  */
  #define WDT_CONFIG_HALT_Max (0x1UL)                /*!< Max enumerator value of HALT field.                                  */
  #define WDT_CONFIG_HALT_Pause (0x0UL)              /*!< Pause WDT while the CPU is halted by the debugger                    */
  #define WDT_CONFIG_HALT_Run (0x1UL)                /*!< Keep WDT running while the CPU is halted by the debugger             */

/* STOPEN @Bit 6 : Allow stopping WDT */
  #define WDT_CONFIG_STOPEN_Pos (6UL)                /*!< Position of STOPEN field.                                            */
  #define WDT_CONFIG_STOPEN_Msk (0x1UL << WDT_CONFIG_STOPEN_Pos) /*!< Bit mask of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Min (0x0UL)              /*!< Min enumerator value of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Max (0x1UL)              /*!< Max enumerator value of STOPEN field.                                */
  #define WDT_CONFIG_STOPEN_Disable (0x0UL)          /*!< Do not allow stopping WDT                                            */
  #define WDT_CONFIG_STOPEN_Enable (0x1UL)           /*!< Allow stopping WDT                                                   */


/* WDT_TSEN: Task stop enable */
  #define WDT_TSEN_ResetValue (0x00000000UL)         /*!< Reset value of TSEN register.                                        */

/* TSEN @Bits 0..31 : Allow stopping WDT */
  #define WDT_TSEN_TSEN_Pos (0UL)                    /*!< Position of TSEN field.                                              */
  #define WDT_TSEN_TSEN_Msk (0xFFFFFFFFUL << WDT_TSEN_TSEN_Pos) /*!< Bit mask of TSEN field.                                   */
  #define WDT_TSEN_TSEN_Min (0x6E524635UL)           /*!< Min enumerator value of TSEN field.                                  */
  #define WDT_TSEN_TSEN_Max (0x6E524635UL)           /*!< Max enumerator value of TSEN field.                                  */
  #define WDT_TSEN_TSEN_Enable (0x6E524635UL)        /*!< Value to allow stopping WDT                                          */


/* WDT_RR: Reload request n */
  #define WDT_RR_MaxCount (8UL)                      /*!< Max size of RR[8] array.                                             */
  #define WDT_RR_MaxIndex (7UL)                      /*!< Max index of RR[8] array.                                            */
  #define WDT_RR_MinIndex (0UL)                      /*!< Min index of RR[8] array.                                            */
  #define WDT_RR_ResetValue (0x00000000UL)           /*!< Reset value of RR[8] register.                                       */

/* RR @Bits 0..31 : Reload request register */
  #define WDT_RR_RR_Pos (0UL)                        /*!< Position of RR field.                                                */
  #define WDT_RR_RR_Msk (0xFFFFFFFFUL << WDT_RR_RR_Pos) /*!< Bit mask of RR field.                                             */
  #define WDT_RR_RR_Min (0x6E524635UL)               /*!< Min enumerator value of RR field.                                    */
  #define WDT_RR_RR_Max (0x6E524635UL)               /*!< Max enumerator value of RR field.                                    */
  #define WDT_RR_RR_Reload (0x6E524635UL)            /*!< Value to request a reload of the watchdog timer                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           WICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct WICR_MAC ===================================================== */
/**
  * @brief MAC [WICR_MAC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRESS0;                          /*!< (@ 0x00000000) MAC address for VIFn                                  */
  __IM  uint32_t  ADDRESS1;                          /*!< (@ 0x00000004) MAC address for VIFn                                  */
} NRF_WICR_MAC_Type;                                 /*!< Size = 8 (0x008)                                                     */
  #define WICR_MAC_MaxCount (2UL)                    /*!< Size of MAC[2] array.                                                */
  #define WICR_MAC_MaxIndex (1UL)                    /*!< Max index of MAC[2] array.                                           */
  #define WICR_MAC_MinIndex (0UL)                    /*!< Min index of MAC[2] array.                                           */

/* WICR_MAC_ADDRESS0: MAC address for VIFn */
  #define WICR_MAC_ADDRESS0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDRESS0 register.                                   */

/* B6 @Bits 0..7 : 6th byte (B6) of MAC address */
  #define WICR_MAC_ADDRESS0_B6_Pos (0UL)             /*!< Position of B6 field.                                                */
  #define WICR_MAC_ADDRESS0_B6_Msk (0xFFUL << WICR_MAC_ADDRESS0_B6_Pos) /*!< Bit mask of B6 field.                             */

/* B5 @Bits 8..15 : 5th byte (B5) of MAC address */
  #define WICR_MAC_ADDRESS0_B5_Pos (8UL)             /*!< Position of B5 field.                                                */
  #define WICR_MAC_ADDRESS0_B5_Msk (0xFFUL << WICR_MAC_ADDRESS0_B5_Pos) /*!< Bit mask of B5 field.                             */

/* B4 @Bits 16..23 : 4th byte (B4) of MAC address */
  #define WICR_MAC_ADDRESS0_B4_Pos (16UL)            /*!< Position of B4 field.                                                */
  #define WICR_MAC_ADDRESS0_B4_Msk (0xFFUL << WICR_MAC_ADDRESS0_B4_Pos) /*!< Bit mask of B4 field.                             */

/* B3 @Bits 24..31 : 3rd byte (B3) of MAC address */
  #define WICR_MAC_ADDRESS0_B3_Pos (24UL)            /*!< Position of B3 field.                                                */
  #define WICR_MAC_ADDRESS0_B3_Msk (0xFFUL << WICR_MAC_ADDRESS0_B3_Pos) /*!< Bit mask of B3 field.                             */


/* WICR_MAC_ADDRESS1: MAC address for VIFn */
  #define WICR_MAC_ADDRESS1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDRESS1 register.                                   */

/* B2 @Bits 0..7 : 2nd byte (B2) of MAC address */
  #define WICR_MAC_ADDRESS1_B2_Pos (0UL)             /*!< Position of B2 field.                                                */
  #define WICR_MAC_ADDRESS1_B2_Msk (0xFFUL << WICR_MAC_ADDRESS1_B2_Pos) /*!< Bit mask of B2 field.                             */

