NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_types.h
/* B1 @Bits 8..15 : 1st byte (B1) of MAC address */
  #define WICR_MAC_ADDRESS1_B1_Pos (8UL)             /*!< Position of B1 field.                                                */
  #define WICR_MAC_ADDRESS1_B1_Msk (0xFFUL << WICR_MAC_ADDRESS1_B1_Pos) /*!< Bit mask of B1 field.                             */



/* ==================================================== Struct WICR_CALIB ==================================================== */
/**
  * @brief CALIB [WICR_CALIB] (unspecified)
  */
typedef struct {
  __IOM uint32_t  XO;                                /*!< (@ 0x00000000) XO adjustment                                         */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  MAXPOW5G0MCS7;                     /*!< (@ 0x00000010) Max output power for MCS7                             */
  __IOM uint32_t  MAXPOW5G0MCS0;                     /*!< (@ 0x00000014) Max output power for MCS0                             */
} NRF_WICR_CALIB_Type;                               /*!< Size = 24 (0x018)                                                    */

/* WICR_CALIB_XO: XO adjustment */
  #define WICR_CALIB_XO_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of XO register.                                          */

/* XO @Bits 0..6 : XO adjustment */
  #define WICR_CALIB_XO_XO_Pos (0UL)                 /*!< Position of XO field.                                                */
  #define WICR_CALIB_XO_XO_Msk (0x7FUL << WICR_CALIB_XO_XO_Pos) /*!< Bit mask of XO field.                                     */


/* WICR_CALIB_MAXPOW5G0MCS7: Max output power for MCS7 */
  #define WICR_CALIB_MAXPOW5G0MCS7_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MAXPOW5G0MCS7 register.                       */

/* LOW @Bits 0..7 : Max output power for MCS7 in low 5GHz sub-band (channels 36 - 64) */
  #define WICR_CALIB_MAXPOW5G0MCS7_LOW_Pos (0UL)     /*!< Position of LOW field.                                               */
  #define WICR_CALIB_MAXPOW5G0MCS7_LOW_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS7_LOW_Pos) /*!< Bit mask of LOW field.            */

/* MID @Bits 8..15 : Max output power for MCS7 in mid 5GHz sub-band (channels 100 - 132) */
  #define WICR_CALIB_MAXPOW5G0MCS7_MID_Pos (8UL)     /*!< Position of MID field.                                               */
  #define WICR_CALIB_MAXPOW5G0MCS7_MID_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS7_MID_Pos) /*!< Bit mask of MID field.            */

/* HIGH @Bits 16..23 : Max output power for MCS7 in high 5GHz sub-band (channels 136 - 177) */
  #define WICR_CALIB_MAXPOW5G0MCS7_HIGH_Pos (16UL)   /*!< Position of HIGH field.                                              */
  #define WICR_CALIB_MAXPOW5G0MCS7_HIGH_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS7_HIGH_Pos) /*!< Bit mask of HIGH field.         */


/* WICR_CALIB_MAXPOW5G0MCS0: Max output power for MCS0 */
  #define WICR_CALIB_MAXPOW5G0MCS0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MAXPOW5G0MCS0 register.                       */

/* LOW @Bits 0..7 : Max output power for MCS0 in low 5GHz sub-band (channels 36 - 64) */
  #define WICR_CALIB_MAXPOW5G0MCS0_LOW_Pos (0UL)     /*!< Position of LOW field.                                               */
  #define WICR_CALIB_MAXPOW5G0MCS0_LOW_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS0_LOW_Pos) /*!< Bit mask of LOW field.            */

/* MID @Bits 8..15 : Max output power for MCS0 in mid 5GHz sub-band (channels 100 - 132) */
  #define WICR_CALIB_MAXPOW5G0MCS0_MID_Pos (8UL)     /*!< Position of MID field.                                               */
  #define WICR_CALIB_MAXPOW5G0MCS0_MID_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS0_MID_Pos) /*!< Bit mask of MID field.            */

/* HIGH @Bits 16..23 : Max output power for MCS0 in high 5GHz sub-band (channels 136 - 177) */
  #define WICR_CALIB_MAXPOW5G0MCS0_HIGH_Pos (16UL)   /*!< Position of HIGH field.                                              */
  #define WICR_CALIB_MAXPOW5G0MCS0_HIGH_Msk (0xFFUL << WICR_CALIB_MAXPOW5G0MCS0_HIGH_Pos) /*!< Bit mask of HIGH field.         */


/* ======================================================= Struct WICR ======================================================= */
/**
  * @brief Wi-Fi Information Configuration Registers
  */
  typedef struct {                                   /*!< WICR Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM NRF_WICR_MAC_Type MAC[2];                  /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED1[60];
    __IOM NRF_WICR_CALIB_Type CALIB;                 /*!< (@ 0x00000200) (unspecified)                                         */
  } NRF_WICR_Type;                                   /*!< Size = 536 (0x218)                                                   */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF7120_ENGA_TYPES_H */

